<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=utf-8">
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script><script src="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.js"></script>
<link rel="stylesheet" href="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.css" type="text/css">
<style type="text/css">
	ul { 
		list-style-type: none; 
		line-height:150%
	}

	ol { 
		line-height:150%
	}
	
	table {
		border-collapse:collapse;
	}
	
	#cabecalho {
		border: 0px solid black;
		text-align:left;
		width:100%;
	}
	
	th, td {
		border: 1px solid black;
		text-align:center;
		padding:1px;
	}

	div
	{
		text-align:justify;
		text-justify:inter-word;
	}

	p {
		line-height:150%
	}
	
	img {
	    height: auto;
	    max-width: 100%;
	}

	div.cabecalho {

	margin: 20px;
    padding: 3px 10px 10px;
    
	}	
	
</style>
</head>
<body>
<h2></h2>
<div class="cabecalho">
<ul>
<li>Universidade FUMEC / Faculdade de Ci&ecirc;ncias Empresariais</li>
</ul>
<ul>
<li>Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o</li>
</ul>
<ul>
<li>Disciplina de
Engenharia de Software
/ Turma
12-7DA / 12-7NA
</li>
</ul>
<ul>
<li>Professor Dr. Fernando Silva Parreiras</li>
</ul>
<ul>
<li>Exercicios de Revisao (
2017-02/cap07
)</li>
</ul>
</div>
<div style="width=100%">
<div class="questao" id="q1">
<p class="enunciado">1. 
          Dentre os principais est&aacute;gios do modelo de desenvolvimento em cascata est&aacute; o Projeto de sistema e
software,que</p>
<ul class="opcoes">
<li correta="nao">a) &eacute; a fase mais longa do ciclo de vida do sistema. O sistema &eacute; instalado e colocado em uso e &eacute; efetuada a corre&ccedil;&atilde;o de erros que n&atilde;o foram descobertos em est&aacute;gios iniciais.</li>
<li correta="nao">b) estabelece os servi&ccedil;os, restri&ccedil;&otilde;es e metas do sistema por meio de consulta aos usu&aacute;rios, e em seguida define em detalhes estes itens para serem utilizados como uma especifica&ccedil;&atilde;o do sistema.</li>
<li correta="nao">c) integra as unidades do programa ou programas como um sistema completo e efetuam testes para garantir que os requisitos do softwaretenham sido atendidos.</li>
<li correta="sim">d) aloca os requisitos tanto para sistemas de hardwarecomo para sistemas de software, por meio de uma arquitetura geral do sistema.</li>
<li correta="nao">e) desenvolve o projeto de softwarecomo um conjunto de programas ou unidades de programas para posteriormente serem aplicados os testes unit&aacute;rios.</li>
</ul>
<div class="coment1"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porHenriqueh&aacute; aproximadamente 1 ano.
                  
                     
                     a)Falso! Essa descri&ccedil;&atilde;o &eacute; a da fase de implementa&ccedil;&atilde;o.
                     b)Falso! Essa &eacute; a fase de an&aacute;lise, onde os requisitos ser&atilde;o definidos.
                     c)Falso! Essa descri&ccedil;&atilde;o aborda um pouco da fase de implementa&ccedil;&atilde;o e um pouco da fase de testes.
                     d)Verdadeiro! A fase do Projeto &eacute; respons&aacute;vel por definir a arquitetura do software, atrav&eacute;s de modelos e identifica&ccedil;&atilde;o de seus componentes em alto n&iacute;vel e descer o n&iacute;vel dessas especifica&ccedil;&otilde;es at&eacute; que o projeto esteja bem detalhado para codifica&ccedil;&atilde;o e testes.
                     e)Falso! Novamente, se refere a fase de implementa&ccedil;&atilde;o.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porElias Luzh&aacute; aproximadamente 1 ano.
                  
                     O erro da quest&atilde;o E creio que esta aqui,"para posteriormente serem aplicados os testes unit&aacute;rios."
                        
                        O est&aacute;gio seguinte ao de Projeto de Sistema &eacute; aImplementa&ccedil;&atilde;o, e n&atilde;o o de"testes unt&aacute;rios".
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porMarcoh&aacute; aproximadamente 1 ano.
                  
                     De acordo com o Livro de Engenharia de Software do Sommerville os principais est&aacute;gios do modelo em cascata s&atilde;o:
                     
                        
                           An&aacute;lise e Defini&ccedil;&atilde;o de Requisitos:As fun&ccedil;&otilde;es, as restri&ccedil;&otilde;es e os objetivos do sistema s&atilde;o estabelecidos por meio da consulta aos usu&aacute;rios do sistema. &nbsp;Em seguida, s&atilde;o definidos em detalhes e servem como uma especifica&ccedil;&atilde;o do sistema. LETRA B
                        
                        
                           Projeto de sistemas e de software:
                           O processo de projeto de sistemas agrupa os requisitos em sistemas de hardware ou de software. &nbsp;Ele estabelece &nbsp;uma arquitetura do sistema geral. &nbsp;O projeto de software envolve a identifica&ccedil;&atilde;o e a descri&ccedil;&atilde;o das abstra&ccedil;&otilde;es fundamentais do sistema de software e suas rela&ccedil;&otilde;es. - LETRA D
                        
                        
                           Implementa&ccedil;&atilde;o e teste de unidades:Durante esse est&aacute;gio, o projeto de software &eacute; compreendido como um conjunto de programas ou unidades de programa. &nbsp;O teste de unidades envolve verificar que cada unidade atenda a sua especifica&ccedil;&atilde;o. - LETRA E
                        
                        
                           Integra&ccedil;&atilde;o e teste de Sistema:As unidades de programa ou programas individuais s&atilde;o integrados e testados como um sistema completo a fim de garantir que os requisitos de software foram atendidos. &nbsp;Depois dos testes, o sistema de software &eacute; entregue ao cliente. LETRA C
                        
                        
                           Opera&ccedil;&atilde;o e manuten&ccedil;&atilde;o:
                           
                           Normalmente, esta &eacute; a fase mais longa do ciclo de vida. &nbsp;O sistema &eacute; instalado e colocado em opera&ccedil;&atilde;o. &nbsp;A manuten&ccedil;&atilde;o envolve corrigir erros que n&atilde;o foram descobertos em est&aacute;gios anteriores do ciclo de vida, melhorando a implementa&ccedil;&atilde;o das unidade de sistema e aumentando as fun&ccedil;&otilde;es desse sistema &agrave; medida que novos requisitos s&atilde;o descobertos. LETRA A
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (61)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            An&aacute;lise e Defini&ccedil;&atilde;o de Requisitos:As fun&ccedil;&otilde;es, as restri&ccedil;&otilde;es e os objetivos do sistema s&atilde;o estabelecidos por meio da consulta aos usu&aacute;rios do sistema. &nbsp;Em seguida, s&atilde;o definidos em detalhes e servem como uma especifica&ccedil;&atilde;o do sistema. LETRA B
         
      <br>
<br>
</p>
<p>
         
            Projeto de sistemas e de software:
            O processo de projeto de sistemas agrupa os requisitos em sistemas de hardware ou de software. &nbsp;Ele estabelece &nbsp;uma arquitetura do sistema geral. &nbsp;O projeto de software envolve a identifica&ccedil;&atilde;o e a descri&ccedil;&atilde;o das abstra&ccedil;&otilde;es fundamentais do sistema de software e suas rela&ccedil;&otilde;es. - LETRA D
         
      <br>
<br>
</p>
<p>
         
            Implementa&ccedil;&atilde;o e teste de unidades:Durante esse est&aacute;gio, o projeto de software &eacute; compreendido como um conjunto de programas ou unidades de programa. &nbsp;O teste de unidades envolve verificar que cada unidade atenda a sua especifica&ccedil;&atilde;o. - LETRA E
         
      <br>
<br>
</p>
<p>
         
            Integra&ccedil;&atilde;o e teste de Sistema:As unidades de programa ou programas individuais s&atilde;o integrados e testados como um sistema completo a fim de garantir que os requisitos de software foram atendidos. &nbsp;Depois dos testes, o sistema de software &eacute; entregue ao cliente. LETRA C
         
      <br>
<br>
</p>
<p>
         
            Opera&ccedil;&atilde;o e manuten&ccedil;&atilde;o:
            
            Normalmente, esta &eacute; a fase mais longa do ciclo de vida. &nbsp;O sistema &eacute; instalado e colocado em opera&ccedil;&atilde;o. &nbsp;A manuten&ccedil;&atilde;o envolve corrigir erros que n&atilde;o foram descobertos em est&aacute;gios anteriores do ciclo de vida, melhorando a implementa&ccedil;&atilde;o das unidade de sistema e aumentando as fun&ccedil;&otilde;es desse sistema &agrave; medida que novos requisitos s&atilde;o descobertos. LETRA A
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porIzaiash&aacute; aproximadamente 1 ano.
                  
                     Acredito que seja pelo fato da letra "E" s&oacute; fazer referencia ao requisido de "SOFTWARE" e nada fala sobre o requisito de "SISTEMA" como a quest&atilde;o pede.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porSilvia Belarminoh&aacute; aproximadamente 1 ano.
                  
                     Algu&eacute;m poder&iacute;a comentar porque a letra e) n&atilde;o se enquadra?
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porEduardoh&aacute; aproximadamente 1 ano.
                  
                     Projeto. &nbsp;[Sommerville]O processo de projeto de sistema divide os requisitos em sistemas de hardware ou de softwareEle estabelece uma arquitetura geral do sistema. O projeto de software envolve a identifica&ccedil;&atilde;o e a descri&ccedil;&atilde;o das abstra&ccedil;&otilde;es fundamentais do sistema de software e suas rela&ccedil;&otilde;es.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (19)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q2">
<p class="enunciado">2. 
          O Projeto de software &eacute; o primeiro passo da fase de desenvolvimento de qualquer produto ou sistema de engenharia.
Do ponto de vista t&eacute;cnico, a fase de projeto produz:</p>
<ul class="opcoes">
<li correta="nao">a) projeto de dados, sistema e dom&iacute;nio.</li>
<li correta="nao">b) projeto de dados, sistema, dom&iacute;nio e interface.</li>
<li correta="sim">c) projeto de dados, arquitetural, procedimental e interface.</li>
<li correta="nao">d) projeto de dados, sistema, dom&iacute;nio, procedimental e interface.</li>
<li correta="nao">e) projeto de dados, dom&iacute;nio, arquitetural, procedimental e interface.</li>
</ul>
<div class="coment2"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porwoshingtonh&aacute; aproximadamente 1 ano.
                  
                     Essa quest&atilde;o pode ser resolvida da seguinte forma:na letra a) temos sistema que seria uma fase de desenvolvimento p&oacute;s-projeto, o sistema &eacute; algo completo que &eacute; obtido na fase de constru&ccedil;&atilde;o. na letra b) novamente temos sistema e isso invalida a alternativa, na letra d) temos dom&iacute;nio que invalida a alternativa, pois o dom&iacute;nio &eacute; obtido antes do projeto, na fase de elabora&ccedil;&atilde;o, de especifica&ccedil;&atilde;o de requisitos, por esta mesma raz&atilde;o a letra e) est&aacute; errada, restando assim a letra c)
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (5)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porRafael Concurseiroh&aacute; aproximadamente 1 ano.
                  
                     Quest&atilde;o retirada da p&aacute;gina 418 do Pressman 3a edi&ccedil;&atilde;o, conforme a figura:
                        
                        http://s12.postimage.org/nauqx8cot/pastewzb5gw.jpg
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (3)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porWilsonh&aacute; mais de 2 anos.
                  
                     Resposta letra C.
                        
                        Projeto de dados:interpreta objetos de dados do modelo de an&aacute;lise (abstrato) para estruturas de dados que s&atilde;o usadas nos componentes do software e, quando necess&aacute;rio, uma arquitetura de banco de dados para a aplica&ccedil;&atilde;o.
                        Projeto arquitetural:vem a ser a estrutura do software, com os seus componentes interligados, com as suas interfaces internas, externas e interface com os usu&aacute;rios.
                        Projeto procedimental ou projeto de componentes:vem a ser os m&oacute;dulos do software, com os seus atributos e procedimentos para processamentos dos dados. Possui um algor&iacute;tmo descrevendo como o m&oacute;dulo funciona e como funciona a interface de entrada e sa&iacute;da de dados do m&oacute;dulo.
                        Projeto de interface:&eacute; parecido com uma classe. Possui os m&eacute;todos que implementam a interface e a permiss&atilde;o para que sejam acessados.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (16)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q3">
<p class="enunciado">3. 
          Requisitos s&atilde;o capacidades e condi&ccedil;&otilde;es &agrave;s quais o  sistema &ndash; e em termos mais amplos, o projeto &ndash; deve  atender. Entre as diversas classifica&ccedil;&otilde;es e tipos  de requisitos, encontramos requisitos do usu&aacute;rio,  requisitos de sistema e especifica&ccedil;&atilde;o de projeto de  software.
Assinale a op&ccedil;&atilde;o que trata de requisitos de usu&aacute;rio.</p>
<ul class="opcoes">
<li correta="nao">a) O usu&aacute;rio deve dispor de recursos para definir o tipo de arquivos externos.</li>
<li correta="sim">b) O software deve oferecer um meio de representar e acessar arquivos externos criados por outras ferramentas</li>
<li correta="nao">c) Cada tipo de arquivo externo pode ter uma ferramenta associada que pode ser aplicada a ele.</li>
<li correta="nao">d) Cada tipo de arquivo externo pode ser representado com um &iacute;cone espec&iacute;fico na tela do usu&aacute;rio.</li>
<li correta="nao">e) Devem ser fornecidos recursos para o &iacute;cone que representa um arquivo externo, a ser definido pelo usu&aacute;rio.</li>
</ul>
<div class="coment3"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porBetoh&aacute; 8 meses.
                  
                     
                     
                        
                           Tamb&eacute;m apresentei dificuldades para identificar porque a letra B &eacute; a correta, mas ap&oacute;s ter contato com o texto abaixo (atentem &agrave; parte grifada em amarelo), ficou mais claro o porque da B ser a correta.
                              Resposta: a letra B &eacute; a &uacute;nica que come&ccedil;a com"O software deve oferecer...", e essa &eacute; uma caracter&iacute;stica de como os requisitos de usu&aacute;rio dever&atilde;o ser redigidos.
                              
                              Fonte:&nbsp;http://pt.wikipedia.org/wiki/Engenharia_de_requisitos#Requisitos_do_utilizador
                           
                        
                        &nbsp;
                     
                        
                           
                              Requisitos do utilizador
                           
                        
                     
                     
                        
                           Os&nbsp;requisitos do utilizador&nbsp;destinam-se portanto aos v&aacute;rios n&iacute;veis hier&aacute;rquicos da organiza&ccedil;&atilde;o na qual o sistema ser&aacute; implementado (desde gestores a usu&aacute;rios), pelo que s&atilde;o descritos usando apenas (conforme j&aacute; foi referido) linguagem natural, formul&aacute;rios e diagramas muito simples. Obviamente, neste n&iacute;vel de especifica&ccedil;&atilde;o surgem algumas dificuldades:
                        
                     
                     
                        
                           
                              
                                 Ambiguidade: torna-se dif&iacute;cil descrever os requisitos de uma forma inequ&iacute;voca sem tornar a sua descri&ccedil;&atilde;o muito longa ou de dif&iacute;cil compreens&atilde;o.
                              
                           
                        
                        
                           
                              
                                 Confus&atilde;o: ainda que possa n&atilde;o ser t&atilde;o relevante do ponto de vista do cliente, a distin&ccedil;&atilde;o entre requisitos funcionais/n&atilde;o-funcionais e objetivos do sistema torna-se dif&iacute;cil.
                              
                           
                        
                        
                           
                              
                                 Agrupamento de requisitos: ao descrever as funcionalidades de um sistema, pode tornar-se dif&iacute;cil separar claramente os requisitos, o que leva a que v&aacute;rios requisitos sejam expressos como sendo apenas um.
                              
                           
                        
                     
                     
                        
                           Algumas considera&ccedil;&otilde;es &uacute;teis a ter em conta ao escrever uma especifica&ccedil;&atilde;o de requisitos do utilizador:
                        
                     
                     
                        
                           
                              
                                 Usar o mesmo formato em todos os requisitos (evitam-se omiss&otilde;es e facilita-se a verifica&ccedil;&atilde;o dos requisitos).
                              
                           
                        
                        
                           
                              
                                 
                                    Distinguir claramente entre comportamentos&nbsp;
                                    
                                       esperados
                                    
                                    &nbsp;e&nbsp;
                                    
                                       desej&aacute;veis
                                    
                                    &nbsp;do sistema atrav&eacute;s do uso de express&otilde;es como "O sistema permitir&aacute; criar (...)" ou "Dever&aacute; ser poss&iacute;vel criar (...)" respectivamente. &Eacute; importante deixar claro o que o sistema&nbsp;
                                    
                                       tem
                                    
                                    &nbsp;de fazer e sugest&otilde;es de como o&nbsp;
                                    
                                       deve
                                    
                                    &nbsp;fazer e, acima de tudo, usar este tipo de express&otilde;es de forma consistente ao longo de todo o documento.
                                 
                              
                           
                        
                        
                           
                              
                                 Usar formata&ccedil;&atilde;o de texto para salientar determinados aspectos do documento (usando negrito, por exemplo).
                              
                           
                        
                        
                           
                              
                                 Evitar usar termos demasiado t&eacute;cnicos ou fora do &acirc;mbito do sistema, identificando-os e definindo-os de uma forma clara quando for absolutamente necess&aacute;rio us&aacute;-los.
                              
                           
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (2)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Ambiguidade: torna-se dif&iacute;cil descrever os requisitos de uma forma inequ&iacute;voca sem tornar a sua descri&ccedil;&atilde;o muito longa ou de dif&iacute;cil compreens&atilde;o.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Confus&atilde;o: ainda que possa n&atilde;o ser t&atilde;o relevante do ponto de vista do cliente, a distin&ccedil;&atilde;o entre requisitos funcionais/n&atilde;o-funcionais e objetivos do sistema torna-se dif&iacute;cil.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Agrupamento de requisitos: ao descrever as funcionalidades de um sistema, pode tornar-se dif&iacute;cil separar claramente os requisitos, o que leva a que v&aacute;rios requisitos sejam expressos como sendo apenas um.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Usar o mesmo formato em todos os requisitos (evitam-se omiss&otilde;es e facilita-se a verifica&ccedil;&atilde;o dos requisitos).
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     Distinguir claramente entre comportamentos&nbsp;
                     
                        esperados
                     
                     &nbsp;e&nbsp;
                     
                        desej&aacute;veis
                     
                     &nbsp;do sistema atrav&eacute;s do uso de express&otilde;es como "O sistema permitir&aacute; criar (...)" ou "Dever&aacute; ser poss&iacute;vel criar (...)" respectivamente. &Eacute; importante deixar claro o que o sistema&nbsp;
                     
                        tem
                     
                     &nbsp;de fazer e sugest&otilde;es de como o&nbsp;
                     
                        deve
                     
                     &nbsp;fazer e, acima de tudo, usar este tipo de express&otilde;es de forma consistente ao longo de todo o documento.
                  
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Usar formata&ccedil;&atilde;o de texto para salientar determinados aspectos do documento (usando negrito, por exemplo).
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Evitar usar termos demasiado t&eacute;cnicos ou fora do &acirc;mbito do sistema, identificando-os e definindo-os de uma forma clara quando for absolutamente necess&aacute;rio us&aacute;-los.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porBrenoh&aacute; 9 meses.
                  
                     Eu tenho aqui umas defini&ccedil;&otilde;es do Sommerville, mas ainda assim n&atilde;o consigo ver o porqu&ecirc; da B ser a certa.
                        
                        Requisitos de Usu&aacute;rio
                        Declara&ccedil;&otilde;es, em linguagem natural e diagramas, sobre os servi&ccedil;os que o sistema oferece e as restri&ccedil;&otilde;es para a sua opera&ccedil;&atilde;o. Escrito para os clientes.
                        
                        Requisitos de Sistema
                        S&atilde;o descri&ccedil;&otilde;es mais detalhadas das fun&ccedil;&otilde;es, servi&ccedil;os e restri&ccedil;&otilde;es operacionais do sistema de software. O documento de requisitos de sistema (&agrave;s vezes, chamado especifica&ccedil;&atilde;o funcional) deve definir exatamente o que deve ser implementado. Pode ser parte do contrato entre o comprador do sistema e os desenvolvedores de software.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porThiago Diash&aacute; 11 meses.
                  
                     Muito abstratas.N&atilde;o consegui definir tb. As quest&otilde;es de Eng de Soft na maioria s&atilde;o assim...
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porSilas Rodrigues do R&ecirc;go J&uacute;niorh&aacute; aproximadamente 1 ano.
                  
                     Algu&eacute;m poderia explicar cada item?
                        Os tipos de requisitos n&atilde;o seriam: funcional, n&atilde;o-funcional e de dom&iacute;nio? Achei confusa a quest&atilde;o.
                        Grato!
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q4">
<p class="enunciado">4. 
          Suponha que um projeto de
softwaresiga o modelo cascata e utilize t&eacute;cnicas de refatora&ccedil;&atilde;o apoiadas por uma ferramenta durante a etapa de implementa&ccedil;&atilde;o. Qual o impacto resultante na etapa de an&aacute;lise e projeto?</p>
<ul class="opcoes">
<li correta="nao">a) Pode aumentar o trabalho do analista, pois o c&oacute;digo deve estar preparado para utilizar as t&eacute;cnicas de refatora&ccedil;&atilde;o.</li>
<li correta="nao">b) Pode aumentar o trabalho do analista se o profissional que realizar a etapa de an&aacute;lise for diferente do profissional que implementar&aacute; o software.</li>
<li correta="nao">c) Pode diminuir o trabalho do analista, mas apenas se o profissional que realizar a etapa de an&aacute;lise for o mesmo que implementar o software.</li>
<li correta="sim">d) Pode diminuir o trabalho do analista, j&aacute; que o profissional de an&aacute;lise e projeto saber&aacute; que mudan&ccedil;as futuras no modelo gerado durante essa etapa poder&atilde;o ser realizadas com um custo menor na etapa de implementa&ccedil;&atilde;o.</li>
<li correta="nao">e) N&atilde;o ter&aacute; impacto se o profissional j&aacute; conhecer as t&eacute;cnicas de refatora&ccedil;&atilde;o.</li>
</ul>
<div class="coment4"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porJuniorh&aacute; mais de 2 anos.
                  
                     Achei o enunciado muito mal escrito.
                        Pois h&aacute; ambiguidade na frase "mudan&ccedil;as futuras no modelo gerado durante essa etapa poder&atilde;o ser realizadas com um custo menor na etapa de implementa&ccedil;&atilde;o".
                        Menor custo em rela&ccedil;&atilde;o a implementa&ccedil;&atilde;o semrefactoring? O que torna a alternativa verdadeira.Ou menor custo em rela&ccedil;&atilde;o &agrave;s outras fases? O que &eacute; falso. Pois mudan&ccedil;as na fase de implementa&ccedil;&atilde;o &eacute; mais custoso do que na fase de concep&ccedil;&atilde;o.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porWilsonh&aacute; mais de 2 anos.
                  
                     Complementando: se um analista de an&aacute;lise e projeto sabe que na fase de implementa&ccedil;&atilde;o s&atilde;o usadas ferramentas de refabrica&ccedil;&atilde;o, ele fica mais tranquilo. N&atilde;o ter&aacute; que prever o melhor modelo e projeto para ser implementado. Ele poder&aacute; desenvolver os modelos e projeto com o que tem no momento. Sabe ainda que quaisquer mudan&ccedil;as nessas etapas ser&atilde;o adaptadas na implementa&ccedil;&atilde;o mais facilmente, pois h&aacute;&nbsp;o uso das ferramentas automatizadas.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (7)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porWilsonh&aacute; mais de 2 anos.
                  
                     Gostei da cita&ccedil;&atilde;o que o Renato fez. Muito bom o livro do Fowler...
                        O que Fowler quis dizer foi que antigamente, corrigir um erro de programa&ccedil;&atilde;o ou acabar com a ambiguidade ou simplesmente, refinar o software era muito dispendioso. Qualquer mudan&ccedil;a no c&oacute;digo tinha um efeito no modelo de an&aacute;lise e no projeto. Com o aparecimento das ferramentas, essas mudan&ccedil;as para melhor nos c&oacute;digos (refabrica&ccedil;&atilde;o - Pressman) pode ser feita sem medo de aumentar os custos nas etapas anteriores.Antes, quando o modelo de an&aacute;lise estava pronto, quando o projeto estava pronto, o c&oacute;digo estava imut&aacute;vel, praticamente. Qualquer refabrica&ccedil;&atilde;o era custoso demais para ser aplicado. Hoje, a hist&oacute;ria &eacute; diferente. Se for necess&aacute;rio otimizar o c&oacute;digo, fa&ccedil;a. As ferramentas automatizadas lhe ajudar&atilde;o a encaixar essas mudan&ccedil;as no modelo de an&aacute;lise e no projeto.
                        Lembrando que o modelo de an&aacute;lise &eacute; uma abstra&ccedil;&atilde;o do sistema, utilizado para constru&ccedil;&atilde;o do projeto.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (7)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porRenato costah&aacute; mais de 4 anos.
                  
                     Quando se utiliza uma ferramenta de refatora&ccedil;&atilde;o o custo das mudan&ccedil;as na implementa&ccedil;&atilde;o s&atilde;o reduzidos, consequentemente pode-se fazer um projeto menos aprofundado pois caso se encontre algum erro o custo para corre&ccedil;&atilde;o deste &eacute; reduzido quando comparado aos projetos que n&atilde;o utilizam tais ferramentas.Esse conceito foi extra&iacute;do do livro de refatora&ccedil;&atilde;o do Martin Fowler. Segue o trecho do livro que trata a respeito:
                     As refactoring becomes less expensive, design mistakes become less costly. Because it is less expensive to fix design mistakes, less design needs to be done up front. Upfront design is a predictive activity because the requirements will be incomplete. Because the code is not available, the correct way to design to simplify the code is not obvious. In the past, we had to livewith whatever design we initially created because the cost to change the design was too great. With automatic refactoring tools, we can allow the design to be more fluid because changing it is much less costly. Given this new set of costs, we can design to the level of the current problem knowing that we can inexpensively extend the design to add additional flexibility in the future. Nolonger do we need to attempt to predict every possible way the system might change in the future. If we find that the current design makes the code awkward with the smells described in Chapter 3, we can quickly change the design to make the code clean and maintainable.
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (13)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porSergio Vicenteh&aacute; mais de 4 anos.
                  
                     Achei uma pergunta um tanto capciosa do examinador, porque existem diversos aspectos envolvidos em um projeto de software que podem influir de modo favor&aacute;vel ou prejudicial ao se utilizar 'refactoring'. Um deles, de grande relev&acirc;ncia, &eacute; o uso de testes unit&aacute;rios e funcionais. A XP se baseia efetivamente nisso, desenvolver os testes primeiramente. E sem um bom projeto de testes, fazer refatora&ccedil;&atilde;o pode at&eacute; ser desastroso em alguns casos.
                        Mas partindo do pressuposto de "condi&ccedil;&otilde;es normais de temperatura e press&atilde;o (CNTP)" eu pensei do seguinte modo: o gestor respons&aacute;vel pela fase de an&aacute;lise e projeto ficaria bem mais tranquilo porque ao promover mudan&ccedil;as no modelo estas seriam implementadas mais facilmente e com mais seguran&ccedil;a num c&oacute;digo refatorado, pois este tem como premissas ser mais claro (limpo, f&aacute;cil de entender e de manter) e funcional.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q5">
<p class="enunciado">5. 
          Dentre os principais est&aacute;gios do modelo de desenvolvimento em cascata est&aacute; o Projeto de sistema e
software,que</p>
<ul class="opcoes">
<li correta="nao">a) &eacute; a fase mais longa do ciclo de vida do sistema. O sistema &eacute; instalado e colocado em uso e &eacute; efetuada a corre&ccedil;&atilde;o de erros que n&atilde;o foram descobertos em est&aacute;gios iniciais.</li>
<li correta="nao">b) estabelece os servi&ccedil;os, restri&ccedil;&otilde;es e metas do sistema por meio de consulta aos usu&aacute;rios, e em seguida define em detalhes estes itens para serem utilizados como uma especifica&ccedil;&atilde;o do sistema.</li>
<li correta="nao">c) integra as unidades do programa ou programas como um sistema completo e efetuam testes para garantir que os requisitos do softwaretenham sido atendidos.</li>
<li correta="sim">d) aloca os requisitos tanto para sistemas de hardwarecomo para sistemas de software, por meio de uma arquitetura geral do sistema.</li>
<li correta="nao">e) desenvolve o projeto de softwarecomo um conjunto de programas ou unidades de programas para posteriormente serem aplicados os testes unit&aacute;rios.</li>
</ul>
<div class="coment5"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porHenriqueh&aacute; aproximadamente 1 ano.
                  
                     
                     a)Falso! Essa descri&ccedil;&atilde;o &eacute; a da fase de implementa&ccedil;&atilde;o.
                     b)Falso! Essa &eacute; a fase de an&aacute;lise, onde os requisitos ser&atilde;o definidos.
                     c)Falso! Essa descri&ccedil;&atilde;o aborda um pouco da fase de implementa&ccedil;&atilde;o e um pouco da fase de testes.
                     d)Verdadeiro! A fase do Projeto &eacute; respons&aacute;vel por definir a arquitetura do software, atrav&eacute;s de modelos e identifica&ccedil;&atilde;o de seus componentes em alto n&iacute;vel e descer o n&iacute;vel dessas especifica&ccedil;&otilde;es at&eacute; que o projeto esteja bem detalhado para codifica&ccedil;&atilde;o e testes.
                     e)Falso! Novamente, se refere a fase de implementa&ccedil;&atilde;o.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porElias Luzh&aacute; aproximadamente 1 ano.
                  
                     O erro da quest&atilde;o E creio que esta aqui,"para posteriormente serem aplicados os testes unit&aacute;rios."
                        
                        O est&aacute;gio seguinte ao de Projeto de Sistema &eacute; aImplementa&ccedil;&atilde;o, e n&atilde;o o de"testes unt&aacute;rios".
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porMarcoh&aacute; aproximadamente 1 ano.
                  
                     De acordo com o Livro de Engenharia de Software do Sommerville os principais est&aacute;gios do modelo em cascata s&atilde;o:
                     
                        
                           An&aacute;lise e Defini&ccedil;&atilde;o de Requisitos:As fun&ccedil;&otilde;es, as restri&ccedil;&otilde;es e os objetivos do sistema s&atilde;o estabelecidos por meio da consulta aos usu&aacute;rios do sistema. &nbsp;Em seguida, s&atilde;o definidos em detalhes e servem como uma especifica&ccedil;&atilde;o do sistema. LETRA B
                        
                        
                           Projeto de sistemas e de software:
                           O processo de projeto de sistemas agrupa os requisitos em sistemas de hardware ou de software. &nbsp;Ele estabelece &nbsp;uma arquitetura do sistema geral. &nbsp;O projeto de software envolve a identifica&ccedil;&atilde;o e a descri&ccedil;&atilde;o das abstra&ccedil;&otilde;es fundamentais do sistema de software e suas rela&ccedil;&otilde;es. - LETRA D
                        
                        
                           Implementa&ccedil;&atilde;o e teste de unidades:Durante esse est&aacute;gio, o projeto de software &eacute; compreendido como um conjunto de programas ou unidades de programa. &nbsp;O teste de unidades envolve verificar que cada unidade atenda a sua especifica&ccedil;&atilde;o. - LETRA E
                        
                        
                           Integra&ccedil;&atilde;o e teste de Sistema:As unidades de programa ou programas individuais s&atilde;o integrados e testados como um sistema completo a fim de garantir que os requisitos de software foram atendidos. &nbsp;Depois dos testes, o sistema de software &eacute; entregue ao cliente. LETRA C
                        
                        
                           Opera&ccedil;&atilde;o e manuten&ccedil;&atilde;o:
                           
                           Normalmente, esta &eacute; a fase mais longa do ciclo de vida. &nbsp;O sistema &eacute; instalado e colocado em opera&ccedil;&atilde;o. &nbsp;A manuten&ccedil;&atilde;o envolve corrigir erros que n&atilde;o foram descobertos em est&aacute;gios anteriores do ciclo de vida, melhorando a implementa&ccedil;&atilde;o das unidade de sistema e aumentando as fun&ccedil;&otilde;es desse sistema &agrave; medida que novos requisitos s&atilde;o descobertos. LETRA A
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (61)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            An&aacute;lise e Defini&ccedil;&atilde;o de Requisitos:As fun&ccedil;&otilde;es, as restri&ccedil;&otilde;es e os objetivos do sistema s&atilde;o estabelecidos por meio da consulta aos usu&aacute;rios do sistema. &nbsp;Em seguida, s&atilde;o definidos em detalhes e servem como uma especifica&ccedil;&atilde;o do sistema. LETRA B
         
      <br>
<br>
</p>
<p>
         
            Projeto de sistemas e de software:
            O processo de projeto de sistemas agrupa os requisitos em sistemas de hardware ou de software. &nbsp;Ele estabelece &nbsp;uma arquitetura do sistema geral. &nbsp;O projeto de software envolve a identifica&ccedil;&atilde;o e a descri&ccedil;&atilde;o das abstra&ccedil;&otilde;es fundamentais do sistema de software e suas rela&ccedil;&otilde;es. - LETRA D
         
      <br>
<br>
</p>
<p>
         
            Implementa&ccedil;&atilde;o e teste de unidades:Durante esse est&aacute;gio, o projeto de software &eacute; compreendido como um conjunto de programas ou unidades de programa. &nbsp;O teste de unidades envolve verificar que cada unidade atenda a sua especifica&ccedil;&atilde;o. - LETRA E
         
      <br>
<br>
</p>
<p>
         
            Integra&ccedil;&atilde;o e teste de Sistema:As unidades de programa ou programas individuais s&atilde;o integrados e testados como um sistema completo a fim de garantir que os requisitos de software foram atendidos. &nbsp;Depois dos testes, o sistema de software &eacute; entregue ao cliente. LETRA C
         
      <br>
<br>
</p>
<p>
         
            Opera&ccedil;&atilde;o e manuten&ccedil;&atilde;o:
            
            Normalmente, esta &eacute; a fase mais longa do ciclo de vida. &nbsp;O sistema &eacute; instalado e colocado em opera&ccedil;&atilde;o. &nbsp;A manuten&ccedil;&atilde;o envolve corrigir erros que n&atilde;o foram descobertos em est&aacute;gios anteriores do ciclo de vida, melhorando a implementa&ccedil;&atilde;o das unidade de sistema e aumentando as fun&ccedil;&otilde;es desse sistema &agrave; medida que novos requisitos s&atilde;o descobertos. LETRA A
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porIzaiash&aacute; aproximadamente 1 ano.
                  
                     Acredito que seja pelo fato da letra "E" s&oacute; fazer referencia ao requisido de "SOFTWARE" e nada fala sobre o requisito de "SISTEMA" como a quest&atilde;o pede.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porSilvia Belarminoh&aacute; aproximadamente 1 ano.
                  
                     Algu&eacute;m poder&iacute;a comentar porque a letra e) n&atilde;o se enquadra?
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porEduardoh&aacute; aproximadamente 1 ano.
                  
                     Projeto. &nbsp;[Sommerville]O processo de projeto de sistema divide os requisitos em sistemas de hardware ou de softwareEle estabelece uma arquitetura geral do sistema. O projeto de software envolve a identifica&ccedil;&atilde;o e a descri&ccedil;&atilde;o das abstra&ccedil;&otilde;es fundamentais do sistema de software e suas rela&ccedil;&otilde;es.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (19)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q6">
<p class="enunciado">6. 
          O Projeto de software &eacute; o primeiro passo da fase de desenvolvimento de qualquer produto ou sistema de engenharia.
Do ponto de vista t&eacute;cnico, a fase de projeto produz:</p>
<ul class="opcoes">
<li correta="nao">a) projeto de dados, sistema e dom&iacute;nio.</li>
<li correta="nao">b) projeto de dados, sistema, dom&iacute;nio e interface.</li>
<li correta="sim">c) projeto de dados, arquitetural, procedimental e interface.</li>
<li correta="nao">d) projeto de dados, sistema, dom&iacute;nio, procedimental e interface.</li>
<li correta="nao">e) projeto de dados, dom&iacute;nio, arquitetural, procedimental e interface.</li>
</ul>
<div class="coment6"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porwoshingtonh&aacute; aproximadamente 1 ano.
                  
                     Essa quest&atilde;o pode ser resolvida da seguinte forma:na letra a) temos sistema que seria uma fase de desenvolvimento p&oacute;s-projeto, o sistema &eacute; algo completo que &eacute; obtido na fase de constru&ccedil;&atilde;o. na letra b) novamente temos sistema e isso invalida a alternativa, na letra d) temos dom&iacute;nio que invalida a alternativa, pois o dom&iacute;nio &eacute; obtido antes do projeto, na fase de elabora&ccedil;&atilde;o, de especifica&ccedil;&atilde;o de requisitos, por esta mesma raz&atilde;o a letra e) est&aacute; errada, restando assim a letra c)
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (5)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porRafael Concurseiroh&aacute; aproximadamente 1 ano.
                  
                     Quest&atilde;o retirada da p&aacute;gina 418 do Pressman 3a edi&ccedil;&atilde;o, conforme a figura:
                        
                        http://s12.postimage.org/nauqx8cot/pastewzb5gw.jpg
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (3)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porWilsonh&aacute; mais de 2 anos.
                  
                     Resposta letra C.
                        
                        Projeto de dados:interpreta objetos de dados do modelo de an&aacute;lise (abstrato) para estruturas de dados que s&atilde;o usadas nos componentes do software e, quando necess&aacute;rio, uma arquitetura de banco de dados para a aplica&ccedil;&atilde;o.
                        Projeto arquitetural:vem a ser a estrutura do software, com os seus componentes interligados, com as suas interfaces internas, externas e interface com os usu&aacute;rios.
                        Projeto procedimental ou projeto de componentes:vem a ser os m&oacute;dulos do software, com os seus atributos e procedimentos para processamentos dos dados. Possui um algor&iacute;tmo descrevendo como o m&oacute;dulo funciona e como funciona a interface de entrada e sa&iacute;da de dados do m&oacute;dulo.
                        Projeto de interface:&eacute; parecido com uma classe. Possui os m&eacute;todos que implementam a interface e a permiss&atilde;o para que sejam acessados.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (16)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q7">
<p class="enunciado">7. 
          Requisitos s&atilde;o capacidades e condi&ccedil;&otilde;es &agrave;s quais o  sistema &ndash; e em termos mais amplos, o projeto &ndash; deve  atender. Entre as diversas classifica&ccedil;&otilde;es e tipos  de requisitos, encontramos requisitos do usu&aacute;rio,  requisitos de sistema e especifica&ccedil;&atilde;o de projeto de  software.
Assinale a op&ccedil;&atilde;o que trata de requisitos de usu&aacute;rio.</p>
<ul class="opcoes">
<li correta="nao">a) O usu&aacute;rio deve dispor de recursos para definir o tipo de arquivos externos.</li>
<li correta="sim">b) O software deve oferecer um meio de representar e acessar arquivos externos criados por outras ferramentas</li>
<li correta="nao">c) Cada tipo de arquivo externo pode ter uma ferramenta associada que pode ser aplicada a ele.</li>
<li correta="nao">d) Cada tipo de arquivo externo pode ser representado com um &iacute;cone espec&iacute;fico na tela do usu&aacute;rio.</li>
<li correta="nao">e) Devem ser fornecidos recursos para o &iacute;cone que representa um arquivo externo, a ser definido pelo usu&aacute;rio.</li>
</ul>
<div class="coment7"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porBetoh&aacute; 8 meses.
                  
                     
                     
                        
                           Tamb&eacute;m apresentei dificuldades para identificar porque a letra B &eacute; a correta, mas ap&oacute;s ter contato com o texto abaixo (atentem &agrave; parte grifada em amarelo), ficou mais claro o porque da B ser a correta.
                              Resposta: a letra B &eacute; a &uacute;nica que come&ccedil;a com"O software deve oferecer...", e essa &eacute; uma caracter&iacute;stica de como os requisitos de usu&aacute;rio dever&atilde;o ser redigidos.
                              
                              Fonte:&nbsp;http://pt.wikipedia.org/wiki/Engenharia_de_requisitos#Requisitos_do_utilizador
                           
                        
                        &nbsp;
                     
                        
                           
                              Requisitos do utilizador
                           
                        
                     
                     
                        
                           Os&nbsp;requisitos do utilizador&nbsp;destinam-se portanto aos v&aacute;rios n&iacute;veis hier&aacute;rquicos da organiza&ccedil;&atilde;o na qual o sistema ser&aacute; implementado (desde gestores a usu&aacute;rios), pelo que s&atilde;o descritos usando apenas (conforme j&aacute; foi referido) linguagem natural, formul&aacute;rios e diagramas muito simples. Obviamente, neste n&iacute;vel de especifica&ccedil;&atilde;o surgem algumas dificuldades:
                        
                     
                     
                        
                           
                              
                                 Ambiguidade: torna-se dif&iacute;cil descrever os requisitos de uma forma inequ&iacute;voca sem tornar a sua descri&ccedil;&atilde;o muito longa ou de dif&iacute;cil compreens&atilde;o.
                              
                           
                        
                        
                           
                              
                                 Confus&atilde;o: ainda que possa n&atilde;o ser t&atilde;o relevante do ponto de vista do cliente, a distin&ccedil;&atilde;o entre requisitos funcionais/n&atilde;o-funcionais e objetivos do sistema torna-se dif&iacute;cil.
                              
                           
                        
                        
                           
                              
                                 Agrupamento de requisitos: ao descrever as funcionalidades de um sistema, pode tornar-se dif&iacute;cil separar claramente os requisitos, o que leva a que v&aacute;rios requisitos sejam expressos como sendo apenas um.
                              
                           
                        
                     
                     
                        
                           Algumas considera&ccedil;&otilde;es &uacute;teis a ter em conta ao escrever uma especifica&ccedil;&atilde;o de requisitos do utilizador:
                        
                     
                     
                        
                           
                              
                                 Usar o mesmo formato em todos os requisitos (evitam-se omiss&otilde;es e facilita-se a verifica&ccedil;&atilde;o dos requisitos).
                              
                           
                        
                        
                           
                              
                                 
                                    Distinguir claramente entre comportamentos&nbsp;
                                    
                                       esperados
                                    
                                    &nbsp;e&nbsp;
                                    
                                       desej&aacute;veis
                                    
                                    &nbsp;do sistema atrav&eacute;s do uso de express&otilde;es como "O sistema permitir&aacute; criar (...)" ou "Dever&aacute; ser poss&iacute;vel criar (...)" respectivamente. &Eacute; importante deixar claro o que o sistema&nbsp;
                                    
                                       tem
                                    
                                    &nbsp;de fazer e sugest&otilde;es de como o&nbsp;
                                    
                                       deve
                                    
                                    &nbsp;fazer e, acima de tudo, usar este tipo de express&otilde;es de forma consistente ao longo de todo o documento.
                                 
                              
                           
                        
                        
                           
                              
                                 Usar formata&ccedil;&atilde;o de texto para salientar determinados aspectos do documento (usando negrito, por exemplo).
                              
                           
                        
                        
                           
                              
                                 Evitar usar termos demasiado t&eacute;cnicos ou fora do &acirc;mbito do sistema, identificando-os e definindo-os de uma forma clara quando for absolutamente necess&aacute;rio us&aacute;-los.
                              
                           
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (2)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Ambiguidade: torna-se dif&iacute;cil descrever os requisitos de uma forma inequ&iacute;voca sem tornar a sua descri&ccedil;&atilde;o muito longa ou de dif&iacute;cil compreens&atilde;o.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Confus&atilde;o: ainda que possa n&atilde;o ser t&atilde;o relevante do ponto de vista do cliente, a distin&ccedil;&atilde;o entre requisitos funcionais/n&atilde;o-funcionais e objetivos do sistema torna-se dif&iacute;cil.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Agrupamento de requisitos: ao descrever as funcionalidades de um sistema, pode tornar-se dif&iacute;cil separar claramente os requisitos, o que leva a que v&aacute;rios requisitos sejam expressos como sendo apenas um.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Usar o mesmo formato em todos os requisitos (evitam-se omiss&otilde;es e facilita-se a verifica&ccedil;&atilde;o dos requisitos).
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     Distinguir claramente entre comportamentos&nbsp;
                     
                        esperados
                     
                     &nbsp;e&nbsp;
                     
                        desej&aacute;veis
                     
                     &nbsp;do sistema atrav&eacute;s do uso de express&otilde;es como "O sistema permitir&aacute; criar (...)" ou "Dever&aacute; ser poss&iacute;vel criar (...)" respectivamente. &Eacute; importante deixar claro o que o sistema&nbsp;
                     
                        tem
                     
                     &nbsp;de fazer e sugest&otilde;es de como o&nbsp;
                     
                        deve
                     
                     &nbsp;fazer e, acima de tudo, usar este tipo de express&otilde;es de forma consistente ao longo de todo o documento.
                  
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Usar formata&ccedil;&atilde;o de texto para salientar determinados aspectos do documento (usando negrito, por exemplo).
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  Evitar usar termos demasiado t&eacute;cnicos ou fora do &acirc;mbito do sistema, identificando-os e definindo-os de uma forma clara quando for absolutamente necess&aacute;rio us&aacute;-los.
               
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porBrenoh&aacute; 9 meses.
                  
                     Eu tenho aqui umas defini&ccedil;&otilde;es do Sommerville, mas ainda assim n&atilde;o consigo ver o porqu&ecirc; da B ser a certa.
                        
                        Requisitos de Usu&aacute;rio
                        Declara&ccedil;&otilde;es, em linguagem natural e diagramas, sobre os servi&ccedil;os que o sistema oferece e as restri&ccedil;&otilde;es para a sua opera&ccedil;&atilde;o. Escrito para os clientes.
                        
                        Requisitos de Sistema
                        S&atilde;o descri&ccedil;&otilde;es mais detalhadas das fun&ccedil;&otilde;es, servi&ccedil;os e restri&ccedil;&otilde;es operacionais do sistema de software. O documento de requisitos de sistema (&agrave;s vezes, chamado especifica&ccedil;&atilde;o funcional) deve definir exatamente o que deve ser implementado. Pode ser parte do contrato entre o comprador do sistema e os desenvolvedores de software.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porThiago Diash&aacute; 11 meses.
                  
                     Muito abstratas.N&atilde;o consegui definir tb. As quest&otilde;es de Eng de Soft na maioria s&atilde;o assim...
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porSilas Rodrigues do R&ecirc;go J&uacute;niorh&aacute; aproximadamente 1 ano.
                  
                     Algu&eacute;m poderia explicar cada item?
                        Os tipos de requisitos n&atilde;o seriam: funcional, n&atilde;o-funcional e de dom&iacute;nio? Achei confusa a quest&atilde;o.
                        Grato!
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q8">
<p class="enunciado">8. 
          Suponha que um projeto de
softwaresiga o modelo cascata e utilize t&eacute;cnicas de refatora&ccedil;&atilde;o apoiadas por uma ferramenta durante a etapa de implementa&ccedil;&atilde;o. Qual o impacto resultante na etapa de an&aacute;lise e projeto?</p>
<ul class="opcoes">
<li correta="nao">a) Pode aumentar o trabalho do analista, pois o c&oacute;digo deve estar preparado para utilizar as t&eacute;cnicas de refatora&ccedil;&atilde;o.</li>
<li correta="nao">b) Pode aumentar o trabalho do analista se o profissional que realizar a etapa de an&aacute;lise for diferente do profissional que implementar&aacute; o software.</li>
<li correta="nao">c) Pode diminuir o trabalho do analista, mas apenas se o profissional que realizar a etapa de an&aacute;lise for o mesmo que implementar o software.</li>
<li correta="sim">d) Pode diminuir o trabalho do analista, j&aacute; que o profissional de an&aacute;lise e projeto saber&aacute; que mudan&ccedil;as futuras no modelo gerado durante essa etapa poder&atilde;o ser realizadas com um custo menor na etapa de implementa&ccedil;&atilde;o.</li>
<li correta="nao">e) N&atilde;o ter&aacute; impacto se o profissional j&aacute; conhecer as t&eacute;cnicas de refatora&ccedil;&atilde;o.</li>
</ul>
<div class="coment8"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porJuniorh&aacute; mais de 2 anos.
                  
                     Achei o enunciado muito mal escrito.
                        Pois h&aacute; ambiguidade na frase "mudan&ccedil;as futuras no modelo gerado durante essa etapa poder&atilde;o ser realizadas com um custo menor na etapa de implementa&ccedil;&atilde;o".
                        Menor custo em rela&ccedil;&atilde;o a implementa&ccedil;&atilde;o semrefactoring? O que torna a alternativa verdadeira.Ou menor custo em rela&ccedil;&atilde;o &agrave;s outras fases? O que &eacute; falso. Pois mudan&ccedil;as na fase de implementa&ccedil;&atilde;o &eacute; mais custoso do que na fase de concep&ccedil;&atilde;o.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porWilsonh&aacute; mais de 2 anos.
                  
                     Complementando: se um analista de an&aacute;lise e projeto sabe que na fase de implementa&ccedil;&atilde;o s&atilde;o usadas ferramentas de refabrica&ccedil;&atilde;o, ele fica mais tranquilo. N&atilde;o ter&aacute; que prever o melhor modelo e projeto para ser implementado. Ele poder&aacute; desenvolver os modelos e projeto com o que tem no momento. Sabe ainda que quaisquer mudan&ccedil;as nessas etapas ser&atilde;o adaptadas na implementa&ccedil;&atilde;o mais facilmente, pois h&aacute;&nbsp;o uso das ferramentas automatizadas.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (7)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porWilsonh&aacute; mais de 2 anos.
                  
                     Gostei da cita&ccedil;&atilde;o que o Renato fez. Muito bom o livro do Fowler...
                        O que Fowler quis dizer foi que antigamente, corrigir um erro de programa&ccedil;&atilde;o ou acabar com a ambiguidade ou simplesmente, refinar o software era muito dispendioso. Qualquer mudan&ccedil;a no c&oacute;digo tinha um efeito no modelo de an&aacute;lise e no projeto. Com o aparecimento das ferramentas, essas mudan&ccedil;as para melhor nos c&oacute;digos (refabrica&ccedil;&atilde;o - Pressman) pode ser feita sem medo de aumentar os custos nas etapas anteriores.Antes, quando o modelo de an&aacute;lise estava pronto, quando o projeto estava pronto, o c&oacute;digo estava imut&aacute;vel, praticamente. Qualquer refabrica&ccedil;&atilde;o era custoso demais para ser aplicado. Hoje, a hist&oacute;ria &eacute; diferente. Se for necess&aacute;rio otimizar o c&oacute;digo, fa&ccedil;a. As ferramentas automatizadas lhe ajudar&atilde;o a encaixar essas mudan&ccedil;as no modelo de an&aacute;lise e no projeto.
                        Lembrando que o modelo de an&aacute;lise &eacute; uma abstra&ccedil;&atilde;o do sistema, utilizado para constru&ccedil;&atilde;o do projeto.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (7)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porRenato costah&aacute; mais de 4 anos.
                  
                     Quando se utiliza uma ferramenta de refatora&ccedil;&atilde;o o custo das mudan&ccedil;as na implementa&ccedil;&atilde;o s&atilde;o reduzidos, consequentemente pode-se fazer um projeto menos aprofundado pois caso se encontre algum erro o custo para corre&ccedil;&atilde;o deste &eacute; reduzido quando comparado aos projetos que n&atilde;o utilizam tais ferramentas.Esse conceito foi extra&iacute;do do livro de refatora&ccedil;&atilde;o do Martin Fowler. Segue o trecho do livro que trata a respeito:
                     As refactoring becomes less expensive, design mistakes become less costly. Because it is less expensive to fix design mistakes, less design needs to be done up front. Upfront design is a predictive activity because the requirements will be incomplete. Because the code is not available, the correct way to design to simplify the code is not obvious. In the past, we had to livewith whatever design we initially created because the cost to change the design was too great. With automatic refactoring tools, we can allow the design to be more fluid because changing it is much less costly. Given this new set of costs, we can design to the level of the current problem knowing that we can inexpensively extend the design to add additional flexibility in the future. Nolonger do we need to attempt to predict every possible way the system might change in the future. If we find that the current design makes the code awkward with the smells described in Chapter 3, we can quickly change the design to make the code clean and maintainable.
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (13)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porSergio Vicenteh&aacute; mais de 4 anos.
                  
                     Achei uma pergunta um tanto capciosa do examinador, porque existem diversos aspectos envolvidos em um projeto de software que podem influir de modo favor&aacute;vel ou prejudicial ao se utilizar 'refactoring'. Um deles, de grande relev&acirc;ncia, &eacute; o uso de testes unit&aacute;rios e funcionais. A XP se baseia efetivamente nisso, desenvolver os testes primeiramente. E sem um bom projeto de testes, fazer refatora&ccedil;&atilde;o pode at&eacute; ser desastroso em alguns casos.
                        Mas partindo do pressuposto de "condi&ccedil;&otilde;es normais de temperatura e press&atilde;o (CNTP)" eu pensei do seguinte modo: o gestor respons&aacute;vel pela fase de an&aacute;lise e projeto ficaria bem mais tranquilo porque ao promover mudan&ccedil;as no modelo estas seriam implementadas mais facilmente e com mais seguran&ccedil;a num c&oacute;digo refatorado, pois este tem como premissas ser mais claro (limpo, f&aacute;cil de entender e de manter) e funcional.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
</div>
</body>
</html>
