<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=utf-8">
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script><script src="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.js"></script>
<link rel="stylesheet" href="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.css" type="text/css">
<style type="text/css">
	ul { 
		list-style-type: none; 
		line-height:150%
	}

	ol { 
		line-height:150%
	}
	
	table {
		border-collapse:collapse;
	}
	
	#cabecalho {
		border: 0px solid black;
		text-align:left;
		width:100%;
	}
	
	th, td {
		border: 1px solid black;
		text-align:center;
		padding:1px;
	}

	div
	{
		text-align:justify;
		text-justify:inter-word;
	}

	p {
		line-height:150%
	}
	
	img {
	    height: auto;
	    max-width: 100%;
	}

	div.cabecalho {

	margin: 20px;
    padding: 3px 10px 10px;
    
	}	
	
</style>
</head>
<body>
<h2></h2>
<div class="cabecalho">
<ul>
<li>Universidade FUMEC / Faculdade de Ci&ecirc;ncias Empresariais</li>
</ul>
<ul>
<li>Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o</li>
</ul>
<ul>
<li>Disciplina de
Engenharia de Software I
/ Turma
12-7DA / 12-7NA
</li>
</ul>
<ul>
<li>Professor Dr. Fernando Silva Parreiras</li>
</ul>
<ul>
<li>Exercicios de Revisao (
2017-02/cap01
)</li>
</ul>
</div>
<div style="width=100%">
<div class="questao" id="q1">
<p class="enunciado">1. 
          A Engenharia de
Software</p>
<ul class="opcoes">
<li correta="sim">a) &eacute; uma &aacute;rea da computa&ccedil;&atilde;o que visa abordar de modo sistem&aacute;tico as quest&otilde;es t&eacute;cnicas e n&atilde;o t&eacute;cnicas no projeto, implanta&ccedil;&atilde;o, opera&ccedil;&atilde;o e manuten&ccedil;&atilde;o no desenvolvimento de um software.</li>
<li correta="nao">b) consiste em uma disciplina da computa&ccedil;&atilde;o que aborda assuntos relacionados a t&eacute;cnicas para a otimiza&ccedil;&atilde;o de algoritmos e elabora&ccedil;&atilde;o de ambientes de desenvolvimento.</li>
<li correta="nao">c) trata-se de um ramo da TI que discute os aspectos t&eacute;cnicos e emp&iacute;ricos nos processos de desenvolvimento de sistemas, tal como a defini&ccedil;&atilde;o de artefatos para a modelagem &aacute;gil.</li>
<li correta="nao">d) envolve um conjunto de itens que abordam os aspectos de an&aacute;lise de mercado, concep&ccedil;&atilde;o e projeto de software,sendo independente da engenharia de um sistema.</li>
<li correta="nao">e) agrupa as melhores pr&aacute;ticas para o concep&ccedil;&atilde;o, projeto, opera&ccedil;&atilde;o e manuten&ccedil;&atilde;o de artefatos que suportam a execu&ccedil;&atilde;o de programas de computador, tais como as t&eacute;cnicas de armazenamento e as estruturas em mem&oacute;ria principal.</li>
</ul>
<div class="coment1"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porRodrigo Souzah&aacute; 3 meses.
                  
                     
                        A engenharia de software &eacute; uma disciplina de engenharia relacionada a TODOS os aspectos da produ&ccedil;&atilde;o de software, desde os est&aacute;gios iniciais de especifica&ccedil;&atilde;o dos sistema at&eacute; sua manuten&ccedil;&atilde;o, depois que entrar em opera&ccedil;&atilde;o
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porLeonardo Piresh&aacute; 10 meses.
                  
                     A engenharia de software est&aacute; preocupada com aspectos de produ&ccedil;&atilde;o de um software. Ela envolve 3 elementos segundo pressman: Processos, M&eacute;todos e Ferramentas.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porEvertonh&aacute; 11 meses.
                  
                     
                        CONCEITO:&nbsp;Engenharia de software &eacute; uma &aacute;rea da computa&ccedil;&atilde;o voltada &agrave;&nbsp;especifica&ccedil;&atilde;o, desenvolvimento&nbsp;e&nbsp;manuten&ccedil;&atilde;o de sistemas de software, com aplica&ccedil;&atilde;o de tecnologias e&nbsp;pr&aacute;ticas de ger&ecirc;ncia de projetos e outras disciplinas, visando organiza&ccedil;&atilde;o, produtividade e qualidade.
                        
                        a) &eacute; uma &aacute;rea da computa&ccedil;&atilde;o que visa abordar de modo sistem&aacute;tico asquest&otilde;es t&eacute;cnicas e n&atilde;o t&eacute;cnicas no projeto, implanta&ccedil;&atilde;o, opera&ccedil;&atilde;o emanuten&ccedil;&atilde;o no desenvolvimento de um
                        
                        
                           &nbsp;software.
                        
                        
                        
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (5)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porNilce Mara Pereira Araujoh&aacute; aproximadamente 1 ano.
                  
                     Engenharia de Software trata de aspectos relacionados ao estabelecimento de processos, m&eacute;todos, t&eacute;cnicas, ferramentas e ambientes de suporte ao desenvolvimento de software com o objetivo de melhorar a qualidade dos produtos de software e aumentar a produtividade no processo de desenvolvimento.
                        ES - processos, t&eacute;cnicas, ferramentas e ambientes de suporte ao desenvolvimento de software.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q2">
<p class="enunciado">2. 
          Considere:
&eacute; uma disciplina que se ocupa de todos os aspectos da produ&ccedil;&atilde;o de software, desde os est&aacute;gios iniciais de  especifica&ccedil;&atilde;o do sistema at&eacute; a manuten&ccedil;&atilde;o desse sistema, depois que ele entrou em opera&ccedil;&atilde;o. Seu principal objetivo &eacute; fornecer  uma estrutura metodol&oacute;gica para a constru&ccedil;&atilde;o de software com alta qualidade. A defini&ccedil;&atilde;o refere-se</p>
<ul class="opcoes">
<li correta="nao">a) ao ciclo de vida do software.</li>
<li correta="nao">b) &agrave; programa&ccedil;&atilde;o orientada a objetos.</li>
<li correta="nao">c) &agrave; an&aacute;lise de sistemas.</li>
<li correta="nao">d) &agrave; engenharia de requisitos.</li>
<li correta="sim">e) &agrave; engenharia de software.</li>
</ul>
<div class="coment2"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porF&aacute;bio Gasparonih&aacute; 11 meses.
                  
                     Complementando o coment&aacute;rio do Friathau...
                        O RUP utiliza o modelo iterativo/incremental que diz que os requisitos s&atilde;o din&acirc;micos, ou seja, v&atilde;o evoluindo ou sendo alterados/ajustados nas fases posteriores &agrave; fase inicial.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (7)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porfriathauh&aacute; aproximadamente 1 ano.
                  
                     O coment&aacute;rio da ma est&aacute; 99% correto, por&eacute;m acho que a disciplina de engenharia de requisitos n&atilde;o existe s&oacute; nos est&aacute;gios iniciais. Como exemplo o RUP, esta disciplina &eacute; mais utilizada na fase de concep&ccedil;&atilde;o, por&eacute;m ela continua at&eacute; a transi&ccedil;&atilde;o, por&eacute;m com menos intensidade.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado pormah&aacute; aproximadamente 1 ano.
                  
                     A dica da quest&atilde;o est&aacute; na palavra "disciplina".a) ciclo de vida n&atilde;o &eacute; disciplinab) programa&ccedil;&atilde;o OO tamb&eacute;m n&atilde;o &eacute; disciplinac) an&aacute;lise de sistemas n&atilde;o &eacute; disciplinad) engenharia de requisitos &eacute; disciplina MAS ela compete apenas a fase inicial do desenvolvimento. (ao contr&aacute;rio do que afirma aqui: "desde os est&aacute;gios iniciais de especifica&ccedil;&atilde;o do sistema at&eacute; a manuten&ccedil;&atilde;o desse sistema")e)Engenharia de software&eacute; disciplina e abrange todas as etapas do desenvolvimento, desde a especifica&ccedil;&atilde;o at&eacute; a manuten&ccedil;&atilde;o. (CORRETA)
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (53)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porMarco Aur&eacute;lio Americo de Azevedoh&aacute; aproximadamente 1 ano.
                  
                     
                     Engenharia de software &eacute; uma &aacute;rea da computa&ccedil;&atilde;o voltada &agrave; especifica&ccedil;&atilde;o, desenvolvimento e manuten&ccedil;&atilde;o de sistemas de software, com aplica&ccedil;&atilde;o de tecnologias e pr&aacute;ticas de ger&ecirc;ncia de projetos e outras disciplinas, visando organiza&ccedil;&atilde;o, produtividade e qualidade.
                     &nbsp;
                     fonte: http://pt.wikipedia.org/wiki/Engenharia_de_software
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q3">
<p class="enunciado">3. 
          Assinale a op&ccedil;&atilde;o correta.</p>
<ul class="opcoes">
<li correta="nao">a) Para se desenvolver um formul&aacute;rio Web ASP. NET, pode-se usar: Controles de servidor HPL, Controles de servidor Web, Controles de inicializa&ccedil;&atilde;o.</li>
<li correta="nao">b) Em ASP.NET, atributos de uma p&aacute;gina podem ser de?nidos pelas assertivas: @PageAbroad, @Import, @OutputCoach, @Assume.</li>
<li correta="nao">c) Para se desenvolver um BackupButtonde 7 formul&aacute;rios Web ASP.NET, pode-se usar: Requisitos de servidor HTM, Controles de provedor Web, Controles de valida&ccedil;&atilde;o.</li>
<li correta="nao">d) Em ASP.NET, atributos de uma p&aacute;gina podem ser de?nidos pelas fun&ccedil;&otilde;es: @Pageset, @Import, @OutputCache, @Ressembly.</li>
<li correta="sim">e) Para se desenvolver um formul&aacute;rio Web ASP. NET, pode-se usar: Controles de servidor HTML, Controles de servidor Web, Controles de valida&ccedil;&atilde;o.</li>
</ul>
<div class="coment3"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
</div>
</div>
<div class="questao" id="q4">
<p class="enunciado">4. 
          As  fases  do  ciclo  de  Nolan  est&atilde;o  relacionadas  a  seguir,
&agrave; exce&ccedil;&atilde;o de uma. Assinale-a.</p>
<ul class="opcoes">
<li correta="nao">a) Inicia&ccedil;&atilde;o.</li>
<li correta="sim">b) Implementa&ccedil;&atilde;o.</li>
<li correta="nao">c) Controle.</li>
<li correta="nao">d) Integra&ccedil;&atilde;o.</li>
<li correta="nao">e) Cont&aacute;gio.</li>
</ul>
<div class="coment4"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porEricah&aacute; aproximadamente 1 ano.
                  
                     Cobrar Nolan nessa decoreba toda &eacute; sacanagem da banca :/
                        realmente o avaliador TE ODEIA
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (6)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porJohnson Santana de Carvalhoh&aacute; mais de 2 anos.
                  
                     
                     Modelo por est&aacute;gios de crescimento da organiza&ccedil;&atilde;o de Nolan de 1993, apresenta uma proposta de est&aacute;gios para administra&ccedil;&atilde;o da evolu&ccedil;&atilde;o dos sistemas de informa&ccedil;&otilde;es na organiza&ccedil;&atilde;o, sendo eles: inicia&ccedil;&atilde;o, cont&aacute;gio, controle, integra&ccedil;&atilde;o, administra&ccedil;&atilde;o de dados e maturidade (NOLAN, 1993).
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (18)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q5">
<p class="enunciado">5. 
          Sobre a engenharia de software, considere:
I. Atualmente todos os problemas na constru&ccedil;&atilde;o de software de alta qualidade no prazo e dentro do or&ccedil;amento foram solucionados.
II. Ao longo dos &uacute;ltimos 50 anos, o software evoluiu de um produto de ind&uacute;stria para um ferramental especializado em solu&ccedil;&atilde;o de problemas e an&aacute;lise de informa&ccedil;&otilde;es espec&iacute;ficas.
III. Todo projeto de software &eacute; iniciado por alguma necessidade do neg&oacute;cio.
IV. O intuito da engenharia de software &eacute; fornecer uma estrutura para a constru&ccedil;&atilde;o de software com alta qualidade.
Est&aacute; correto o que consta em</p>
<ul class="opcoes">
<li correta="sim">a) III e IV, somente.</li>
<li correta="nao">b) II e III, somente.</li>
<li correta="nao">c) I, II e IV, somente.</li>
<li correta="nao">d) II, III e IV, somente.</li>
<li correta="nao">e) I, II, III e IV.</li>
</ul>
<div class="coment5"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porLeandroh&aacute; 11 meses.
                  
                     Pergunta muito mal elaborada e subjetiva. A reda&ccedil;&atilde;o est&aacute; p&eacute;ssima e h&aacute; diverg&ecirc;ncias &oacute;bvias.
                        
                        III. Todo projeto de software &eacute; iniciado por alguma necessidade do neg&oacute;cio.
                           Um projeto de software pode come&ccedil;ar por in&uacute;meras outras raz&otilde;es, incluindo:
                        
                        - atualiza&ccedil;&atilde;o tecnol&oacute;gica;
                        
                        - mera curiosidade de um programador.s&oacute; pra citar o que veio a mente agora.
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (4)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porSusyelle Pereira Xavierh&aacute; mais de 2 anos.
                  
                     I - Atualmente todos os problemas na constru&ccedil;&atilde;o de software de alta qualidade no prazo e dentro do or&ccedil;amento foram solucionados. (Errada)II - Ao longo dos &uacute;ltimos 50 anos, o software evoluiu de um produto de ind&uacute;stria para um ferramental especializado em solu&ccedil;&atilde;o de problemas e an&aacute;lise de informa&ccedil;&otilde;es espec&iacute;ficas. (Errada,pois o SW evoluiu de um ferramental especializado para solu&ccedil;&atilde;o de problemas e an&aacute;lise da informa&ccedil;&atilde;o para uma ind&uacute;stria em si mesmo. )III - Todo projeto de software &eacute; iniciado por alguma necessidade do neg&oacute;cio. (Correta)Aparentemente, a FFC baseou boa parte da quest&atilde;o no seguinte texto (encontrado na Internet):IV - O intuito da engenharia de software &eacute; fornecer uma estrutura para a constru&ccedil;&atilde;o de software com alta qualidade.(correto)
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (4)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porFernanda Rigamonth&aacute; mais de 2 anos.
                  
                     O intuito da engenharia de software &eacute; o desenvolvimento de sistema com bao rela&ccedil;&atilde;o custo-benef&iacute;cio, voltada a especifica&ccedil;&atilde;o, desenvolvimento e manuten&ccedil;ao em sistemas de software, aplicnado diversas tecnologias e disciplinas de computa&ccedil;&atilde;o. Objetiva a organiza&ccedil;&atilde;o, produtividade e qualidade.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porZambah&aacute; mais de 3 anos.
                  
                     Gabarito: A
                        Aparentemente, a FFC baseou boa parte da quest&atilde;o no seguinte texto (encontrado na Internet):
                        O software tornou-se elemento chave na evolu&ccedil;&atilde;o de sistemas e produtos baseados em computador.Ao longo dos &uacute;ltimos 50 anos, o SW evoluiu de um ferramental especializado para solu&ccedil;&atilde;o de problemas e an&aacute;lise da informa&ccedil;&atilde;o para uma ind&uacute;stria em si mesmo.Mas a antiga cultura e hist&oacute;ria &ldquo;de programa&ccedil;&atilde;o&rdquo; criou um conjunto de problemas que persiste ainda hoje (tornando o SW fator limitante na cont&iacute;nua evolu&ccedil;&atilde;o dos sistemas de computador).O software &eacute; composto de programas, dados e documentos. Cada um desses itens constitui uma configura&ccedil;&atilde;o, que &eacute; criada como parte do processo de engenharia de software.O intuito da engenharia de software &eacute; fornecer uma estrutura para a constru&ccedil;&atilde;o de software com alta qualidade.
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (21)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q6">
<p class="enunciado">6. 
          A  Engenharia  de
Software&eacute;  uma  disciplina  que  se  ocupa  de  todos  os  aspectos  da  produ&ccedil;&atilde;o  de
software,desde  os  est&aacute;gios  iniciais  de  especifica&ccedil;&atilde;o  do  sistema  at&eacute;  a  sua  manuten&ccedil;&atilde;o.  A  Engenharia de
Softwareadota m&eacute;todos que</p>
<ul class="opcoes">
<li correta="nao">a) s&atilde;o um conjunto de atividades, cuja meta &eacute; o desenvolvimento ou a evolu&ccedil;&atilde;o do software.</li>
<li correta="nao">b) s&atilde;o uma representa&ccedil;&atilde;o simplificada de um processo de software, apresentada a partir de uma perspectiva espec&iacute;fica.</li>
<li correta="sim">c) s&atilde;o abordagens de estruturadas para o desenvolvimento de software, que incluem modelos de sistemas, nota&ccedil;&otilde;es, regras, recomenda&ccedil;&otilde;es de projetos e diretrizes de processos.</li>
<li correta="nao">d) se ocupam da teoria e dos fundamentos de desenvolvimento de software.</li>
</ul>
<div class="coment6"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porF&aacute;bio Gasparonih&aacute; 4 meses.
                  
                     
                        
                           O que &eacute; Engenharia de Software
                        
                        
                        Disciplina de engenharia preocupada com todos os aspectos sobre a produ&ccedil;&atilde;o de software, incluindo:
                        
                        
                        Processos ou Procedimentos
                        
                        Racionalizam o desenvolvimento de Software, ou seja, t&eacute;cnicas de manuseio das ferramentas para aplica&ccedil;&atilde;o dos m&eacute;todos;
                        
                        M&eacute;todos
                        
                        Conhecimento t&eacute;cnico; &ldquo;Como&rdquo; fazer, s&atilde;o as t&eacute;cnicas/paradigmas para o desenvolvimento de software;
                        
                        Ferramentas
                        
                        Suporte automatizado para processos e m&eacute;todos
                        
                        
                           
                              Alternativa: C
                           
                        
                        
                        
                        Fonte: Aulas Fernando Pedrosa
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (5)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porRodrigo Gomesh&aacute; aproximadamente 1 ano.
                  
                     a) refere-se aPROCESSO DE SOFTWARE
                        b) refere-se aMODELO DE PROCESSO DE SOFTWARE
                        c) CORRETAd) refere-se aCI&Ecirc;NCIA DA COMPUTA&Ccedil;&Atilde;O
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (36)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q7">
<p class="enunciado">7. 
          No contexto de conceitos e tecnologias de Internet, &eacute; uma caracter&iacute;stica do lado cliente das Aplica&ccedil;&otilde;es para Internet Ricas (Rich Internet Applications) o uso</p>
<ul class="opcoes">
<li correta="nao">a) da linguagem AJAX, que torna obsoleto o uso da linguagem JavaScript.</li>
<li correta="nao">b) de tecnologias, tais como DOM e RPC, para acesso ao lado servidor de modo ass&iacute;ncrono.</li>
<li correta="nao">c) de XSL para armazenar o estado da aplica&ccedil;&atilde;o no lado do cliente.</li>
<li correta="nao">d) de CSS para atualizar uma parte do conte&uacute;do de uma p&aacute;gina HTML exibida ao usu&aacute;rio da aplica&ccedil;&atilde;o.</li>
<li correta="sim">e) de um modelo de eventos para responder a intera&ccedil;&otilde;es do usu&aacute;rio.</li>
</ul>
<div class="coment7"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porPhoenixh&aacute; mais de 3 anos.
                  
                     
                        Aplica&ccedil;&otilde;es de Internet Rica (da sigla em ingl&ecirc;s RIA - Rich Internet Application)s&atilde;o Aplica&ccedil;&otilde;es Web que tem caracter&iacute;sticas e funcionalidades de softwares tradicionais do tipo Desktop. RIA t&iacute;picos transferem todo o processamento da interface para o navegador da internet, por&eacute;m mant&eacute;m a maior parte dos dados (como por exemplo, o estado do programa, dados do banco) no servidor de aplica&ccedil;&atilde;o.RIAs normalmente:-Rodam em um navegador, ou n&atilde;o necessitam de Instala&ccedil;&atilde;o-Rodam localmente em um ambiente seguro chamado sandbox
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q8">
<p class="enunciado">8. 
          De acordo com Pressman, a engenharia de software &eacute; baseada em camadas, com foco na qualidade.
Essas camadas s&atilde;o:</p>
<ul class="opcoes">
<li correta="nao">a) m&eacute;todos, processo e teste.</li>
<li correta="sim">b) ferramentas, m&eacute;todos e processo.</li>
<li correta="nao">c) m&eacute;todos, constru&ccedil;&atilde;o, teste e implanta&ccedil;&atilde;o.</li>
<li correta="nao">d) planejamento, modelagem, constru&ccedil;&atilde;o, valida&ccedil;&atilde;o e implanta&ccedil;&atilde;o.</li>
<li correta="nao">e) comunica&ccedil;&atilde;o, planejamento, modelagem, constru&ccedil;&atilde;o e implanta&ccedil;&atilde;o.</li>
</ul>
<div class="coment8"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porWilson Souzah&aacute; aproximadamente 1 ano.
                  
                     A resposta est&aacute; na p&aacute;gina 39 da s&eacute;tima edi&ccedil;&atilde;o do livro do pressman, em que ele apresenta uma figura com as 3 camadas citadas na quest&atilde;o (ferramentas, m&eacute;todos e processo) e uma &uacute;ltima camada chamada "Foco na qualidade".
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porBruno Marquete da Silvah&aacute; mais de 2 anos.
                  
                     Esse &eacute; o foco da Engenharia de Software.
                        Ferramentas, M&eacute;todos e Processosque visam produzir software de qualidade em tempo e custo h&aacute;beis.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (3)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porLucianoh&aacute; mais de 2 anos.
                  
                     N&atilde;o sei de qual edi&ccedil;&atilde;o do Pressman &eacute; a cita&ccedil;&atilde;o do colega Hugo.Na 6a.Ed. em portugu&ecirc;s, p&aacute;gina 17, tem uma ilustra&ccedil;&atilde;o destas camadas, dentro do t&oacute;pico "Engenharia de Software - Uma Tecnologia em Camadas".
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (9)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porErickh&aacute; mais de 2 anos.
                  
                     As cr&iacute;ticas s&atilde;o t&atilde;o infundadas e sem sentido que basta observar que a banca examinadora desse certame &eacute; a FGV e n&atilde;o a Carlos Chaga.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porRaul Miltonh&aacute; mais de 2 anos.
                  
                     
                        A FCC tem que mudar seus editais: onde constar "Engenharia de Software", trocar para "Livro do Pressman". :)
                        P.S. - Sem crit&iacute;cas ao livro, que considero &oacute;timo.
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porHugoh&aacute; mais de 3 anos.
                  
                     Est&aacute; na p&aacute;gina 31 do livro do Rogers Pressman, Engenharia de Software. E diz o seguinte: A&nbsp;engenharia de SW &eacute; um rebento da engenharia de sistemas e de HW. Ela abrange um conjunto de tr&ecirc;s elementos fundamentais - m&eacute;todos, ferramentas e procedimentos - .............&nbsp;
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (33)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porSaia da Matrix. Assita: http://www.youtube.com/watch?v=YnQb58BoBQwh&aacute; mais de 3 anos.
                  
                     Que provinha hein?
                        Se algu&eacute;m descobrir qual a p&aacute;gina ou roda-p&eacute; que est&aacute; essa defini&ccedil;&atilde;o, me avise.
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q9">
<p class="enunciado">9. 
          A Engenharia de Software</p>
<ul class="opcoes">
<li correta="nao">a) n&atilde;o tem como m&eacute;todo a abordagem estruturada para o desenvolvimento de software, pois baseia-se exclusivamente nos modelos de software, nota&ccedil;&otilde;es, regras e t&eacute;cnicas de desenvolvimento.</li>
<li correta="nao">b) se confunde com a Ci&ecirc;ncia da Computa&ccedil;&atilde;o quando ambas tratam do desenvolvimento de teorias, fundamenta&ccedil;&otilde;es e pr&aacute;ticas de desenvolvimento de software.</li>
<li correta="nao">c) tendo como foco apenas o tratamento dos aspectos de constru&ccedil;&atilde;o de software, subsidia a Engenharia de Sistemas no tratamento dos sistemas baseados em computadores, incluindo hardware e software.</li>
<li correta="sim">d) tem como foco principal estabelecer uma abordagem sistem&aacute;tica de desenvolvimento, atrav&eacute;s de ferramentas e t&eacute;cnicas apropriadas, dependendo do problema a ser abordado, considerando restri&ccedil;&otilde;es e recursos dispon&iacute;veis.</li>
<li correta="nao">e) segue princ&iacute;pios, tais como, o da Abstra&ccedil;&atilde;o, que identifica os aspectos importantes sem ignorar os detalhes e o da Composi&ccedil;&atilde;o, que agrupa as atividades em um &uacute;nico processo para distribui&ccedil;&atilde;o aos especialistas.</li>
</ul>
<div class="coment9"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porRosa Machadoh&aacute; 5 meses.
                  
                     Outro erro da letra c &eacute; que a engenharia de software n&atilde;o cuida somente da constru&ccedil;&atilde;o do software e sim de todo o seu ciclo de vida: constru&ccedil;&atilde;o e manuten&ccedil;&atilde;o do mesmo.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porFabr&iacute;cio Cozerh&aacute; 5 meses.
                  
                     A engenharia de software &eacute; uma disciplina que se baseia naqualidadepara produzir software, levando em conta osprocessos(une as camadas),m&eacute;todos(define como fazer) eferramentas(auxilia o processo e m&eacute;todo de forma automatizada ou semi).
                        O erro da letra c) &eacute; afirmar que a engenharia de software, subsidia, ou seja, ajuda a engenharia de sistemas no tratamendo dehardware.
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porRog&eacute;rio Ara&uacute;joh&aacute; aproximadamente 1 ano.
                  
                     Corrigindo o coment&aacute;rio do primeiro colega, n&atilde;o &eacute; o princ&iacute;pio da
                           Composi&ccedil;&atilde;o
                        . O que temos &eacute; o da
                           DEcomposi&ccedil;&atilde;o
                        :
                        &Eacute; a t&eacute;cnica de se dividir o problema em partes de maneira que cada uma possa ser resolvida de uma forma mais espec&iacute;fica.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (3)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porLeandro P. das Nevesh&aacute; mais de 2 anos.
                  
                     Segundo Fernando Pedrosa Lopes em seu curso de Introdu&ccedil;&atilde;o &agrave; Engenharia de Software:
                        "Engenharia de Sistemas&eacute; algo maior: preocupa-se com todos os aspectos de sistemas baseados em computador?Software?Hardware?Processos?Pessoas e outros sistemas, etc.
                        Engenharia de Software&eacute; apenas parte deste processo"
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (10)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado poralcirh&aacute; mais de 2 anos.
                  
                     eu fiquei na duvida entre a C e D... marquei a D no "chut&ocirc;metro", porque achei que estava "mais completa"... eu li em algum lugar, que a engenharia de software tamb&eacute;m &eacute; utilizada com hardware e software.... algu&eacute;m pode esclarecer esta d&uacute;vida por favor!
                        a)
                           n&atilde;o
                        tem como m&eacute;todo a abordagem estruturada para o desenvolvimento de software, pois baseia-se exclusivamente nos modelos de software, nota&ccedil;&otilde;es, regras e t&eacute;cnicas de desenvolvimento.
                        b)
                           se confunde com a Ci&ecirc;ncia da Computa&ccedil;&atilde;o quando ambas tratam do desenvolvimento de teorias, fundamenta&ccedil;&otilde;es e pr&aacute;ticas de desenvolvimento de software.
                        
                        
                        c) tendo como foco apenas o tratamento dos aspectos de constru&ccedil;&atilde;o de software, subsidia a Engenharia de Sistemas no tratamento dos sistemas baseados em computadores, incluindo hardware e software.
                        d) tem como foco principal estabelecer uma abordagem sistem&aacute;tica de desenvolvimento, atrav&eacute;s de ferramentas e t&eacute;cnicas apropriadas, dependendo do problema a ser abordado, considerando restri&ccedil;&otilde;es e recursos dispon&iacute;veis.
                        e) segue princ&iacute;pios, tais como, o da Abstra&ccedil;&atilde;o, que identifica os aspectos importantes sem ignorar os detalhes e o da Composi&ccedil;&atilde;o,
                           que agrupa as atividades em um &uacute;nico processo para distribui&ccedil;&atilde;o aos especialistas
                        .
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q10">
<p class="enunciado">10. 
          A Engenharia de Software
I. n&atilde;o visa o desenvolvimento de teorias e fundamenta&ccedil;&otilde;es, preocupando-se unicamente com as pr&aacute;ticas de desenvolvimento de software.
II. tem como foco o tratamento dos aspectos de desenvolvimento de software, abstraindo-se dos sistemas baseados em computadores, incluindo hardware e software.
III. tem como m&eacute;todos as abordagens estruturadas para o desenvolvimento de software que incluem os modelos de software, nota&ccedil;&otilde;es, regras e maneiras de desenvolvimento.
IV. segue princ&iacute;pios, tais como, o da Abstra&ccedil;&atilde;o, que identifica os aspectos importantes sem ignorar os detalhes e o da Composi&ccedil;&atilde;o, que agrupa as atividades em um &uacute;nico processo para distribui&ccedil;&atilde;o aos especialistas.
&Eacute; correto o que se afirma em</p>
<ul class="opcoes">
<li correta="nao">a) III e IV, apenas.</li>
<li correta="nao">b) I, II, III e IV.</li>
<li correta="nao">c) I e II, apenas.</li>
<li correta="sim">d) I, II e III, apenas.</li>
<li correta="nao">e) II, III e IV, apenas.</li>
</ul>
<div class="coment10"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porRog&eacute;rio Ara&uacute;joh&aacute; aproximadamente 1 ano.
                  
                     Apenas complementando o coment&aacute;rio do Luiz Cl&aacute;udio, n&atilde;o h&aacute; o princ&iacute;pio da
                           Composi&ccedil;&atilde;o
                        e sim da
                           Decomposi&ccedil;&atilde;o
                        :
                        &Eacute; a t&eacute;cnica de se dividir o problema em partes de maneira que cada uma possa ser resolvida de uma forma mais espec&iacute;fica.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (10)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porLuiz Cl&aacute;udioh&aacute; mais de 2 anos.
                  
                     
                        I. n&atilde;o visa o desenvolvimento de teorias e fundamenta&ccedil;&otilde;es, preocupando-se unicamente com as pr&aacute;ticas de desenvolvimento de software.&nbsp;
                        
                     
                     "Computer science focuses on theory and&nbsp;fundamentals; software engineering is concerned&nbsp;with the practicalities of developing and delivering&nbsp;useful software." (Sommerville 9, p&aacute;g.6)
                     
                     II. tem como foco o tratamento dos aspectos de desenvolvimento de software, abstraindo-se dos sistemas baseados em computadores, incluindo hardware e software.&nbsp;
                     Quem se preocupa com os aspectos de hardware e software &eacute; a Eng. de Sistemas: "System engineering is concerned with all aspects of&nbsp;computer-based systems development including&nbsp;hardware, software, and process engineering. Software&nbsp;engineering is part of this more general process".
                     
                     IV. segue princ&iacute;pios, tais como, o da Abstra&ccedil;&atilde;o, que identifica os aspectos importantes sem ignorar os detalhes e o da Composi&ccedil;&atilde;o, que agrupa as atividades em um &uacute;nico processo para distribui&ccedil;&atilde;o aos especialistas.&nbsp;"o correto seria: [...] aspectos importantes ignorando os detalhes [...]
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (17)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porS&eacute;rgio Ricardo Matos de Sousah&aacute; mais de 2 anos.
                  
                     Concordo com o Diego Martins, a &uacute;nica correta &eacute; a afirma&ccedil;&atilde;o III.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porDiego Martinsh&aacute; mais de 2 anos.
                  
                     ou a quest&atilde;o foi mal feita ou ela foi "comprada"..o &uacute;nico item certo &eacute; o III.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porGustavo Sousah&aacute; mais de 3 anos.
                  
                     
                     &nbsp;Mas o pr&oacute;prio Sommerville cita que a Engenharia de Software abrange todos aspectos relacionados ao desenvolvimento de software, incluindo "o desenvolvimento de ferramentas, m&eacute;todos e teorias para auxiliar na produ&ccedil;&atilde;o de software"
                     &nbsp;
                     "Software engineering is not just concerned with the technical processes of software development but also with activities such as software project management and with the development of tools, meth- ods and theories to support software production."
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (14)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porT. Renegadoh&aacute; mais de 3 anos.
                  
                     
                     &nbsp;&Eacute; porque ele se baseou na afirma&ccedil;&atilde;o de Somerville Sabe-tudo:
                     &nbsp;
                     &nbsp;
                     A Ci&ecirc;ncia da Computa&ccedil;&atilde;o est&aacute; relacionada com teoria e fundamentos. A Engenharia de Software est&aacute; preocupada com as pr&aacute;ticas de desenvolvimento e entrega de software &uacute;til.
                     &nbsp;
                     &nbsp;
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (22)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porRamon Ceminh&aacute; mais de 3 anos.
                  
                     
                     Quest&atilde;o pass&iacute;vel de recurso. O item I est&aacute; incorreto, pois temos os m&eacute;todos formais que se preocupam em dar uma base matem&aacute;tica para o desenvolvimento de sistemas.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q11">
<p class="enunciado">11. 
          A  Engenharia  de  Software  resume-se  em  um  conjunto  de  t&eacute;cnicas utilizadas para o desenvolvimento e manuten&ccedil;&atilde;o de  sistemas  computadorizados,  visando  produzir  e  manter  softwares  de  forma  padronizada  e  com  qualidade.  Ela  obedece  a  alguns  princ&iacute;pios  como  (1)  Formalidade,  (2)  Abstra&ccedil;&atilde;o,  (3)  Decomposi&ccedil;&atilde;o,  (4)  Generaliza&ccedil;&atilde;o  e  (5)  Flexibiliza&ccedil;&atilde;o. Assinale a alternativa que apresenta conceito  correto sobre os princ&iacute;pios da Engenharia de Software.</p>
<ul class="opcoes">
<li correta="sim">a) A flexibiliza&ccedil;&atilde;o &eacute; o processo que permite que o softwarepossa ser alterado, sem causar problemas para sua execu&ccedil;&atilde;o.</li>
<li correta="nao">b) A formalidade &eacute; a maneira usada para resolver um problema, de forma gen&eacute;rica, com o intuito de poder reaproveitar essa solu&ccedil;&atilde;o em outras situa&ccedil;&otilde;es semelhantes.</li>
<li correta="nao">c) A generaliza&ccedil;&atilde;o preocupa-se com a identifica&ccedil;&atilde;o de um determinado fen&ocirc;meno da realidade, sem se preocupar com detalhes, considerando apenas os aspectos mais relevantes.</li>
<li correta="nao">d) Pelo princ&iacute;pio da decomposi&ccedil;&atilde;o, o softwaredeve ser desenvolvido de acordo com passos definidos com precis&atilde;o e seguidos de maneira efetiva.</li>
<li correta="nao">e) A abstra&ccedil;&atilde;o &eacute; a t&eacute;cnica de se dividir o problema em partes, de maneira que cada uma possa ser resolvida de uma forma mais espec&iacute;fica.</li>
</ul>
<div class="coment11"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porLuiz Cl&aacute;udioh&aacute; aproximadamente 1 ano.
                  
                     P/ treinar, as alternativas fornecem os seguintes conceitosb) Generaliza&ccedil;&atilde;oc) Abstra&ccedil;&atilde;od) Formalidadee) Decomposi&ccedil;&atilde;o
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (14)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porDouglash&aacute; mais de 2 anos.
                  
                     Princ&iacute;pios da Engenharia de Software;
                        A formalidade &eacute; a t&eacute;cnica onde osoftwaredeve ser desenvolvido de acordo com passos definidos com precis&atilde;o e seguidos de maneira efetiva.
                        A Abstra&ccedil;&atilde;o preocupa-se com a identifica&ccedil;&atilde;o de um determinado fen&ocirc;meno da realidade, sem se preocupar com detalhes, considerando apenas os aspectos mais relevantes.
                        A decomposi&ccedil;&atilde;o &eacute; a t&eacute;cnica de se dividir o problema em partes, de maneira que cada uma possa ser resolvida de uma forma mais espec&iacute;fica.
                        A generaliza&ccedil;&atilde;o &eacute; a maneira usada para resolver um problema, de forma gen&eacute;rica, com o intuito de poder reaproveitar essa solu&ccedil;&atilde;o em outras situa&ccedil;&otilde;es semelhantes.
                        A flexibiliza&ccedil;&atilde;o &eacute; o processo que permite que osoftwarepossa ser alterado, sem causar problemas para sua execu&ccedil;&atilde;o.
                        
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (28)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q12">
<p class="enunciado">12. 
          Assim  como  a  Engenharia  de  Software,  existe  tamb&eacute;m  na  &aacute;rea de inform&aacute;tica a chamada Ci&ecirc;ncia da Computa&ccedil;&atilde;o.  Assinale a alternativa que melhor apresenta a diferen&ccedil;a entre  Engenharia de Software e Ci&ecirc;ncia da Computa&ccedil;&atilde;o.</p>
<ul class="opcoes">
<li correta="sim">a) A Ci&ecirc;ncia da Computa&ccedil;&atilde;o tem como objetivo o desenvolvimento de teorias e fundamenta&ccedil;&otilde;es. J&aacute; a Engenharia de Software se preocupa com as pr&aacute;ticas de desenvolvimento de software.</li>
<li correta="nao">b) A Engenharia de Software trata da cria&ccedil;&atilde;o dos sistemas de computa&ccedil;&atilde;o ( softwares) enquanto a Ci&ecirc;ncia da Computa&ccedil;&atilde;o est&aacute; ligada ao desenvolvimento e cria&ccedil;&atilde;o de componentes de hardware.</li>
<li correta="nao">c) A Engenharia de Software trata dos sistemas com base em computadores, que inclui hardware e software, e a Ci&ecirc;ncia da Computa&ccedil;&atilde;o trata apenas dos aspectos de desenvolvimento de sistemas.</li>
<li correta="nao">d) A Ci&ecirc;ncia da Computa&ccedil;&atilde;o trata dos sistemas com base em computadores, que inclui hardwaree software, e a Engenharia de Software trata apenas dos aspectos de desenvolvimento de sistemas.</li>
<li correta="nao">e) A Ci&ecirc;ncia da Computa&ccedil;&atilde;o destina-se ao estudo e solu&ccedil;&atilde;o para problemas gen&eacute;ricos das &aacute;reas de rede e banco de dados e a Engenharia de Software restringe- se ao desenvolvimento de sistemas.</li>
</ul>
<div class="coment12"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porM.Eh&aacute; 11 meses.
                  
                     
                        A Ci&ecirc;ncia da Computa&ccedil;&atilde;o tem como objetivo o desenvolvimento deteorias e fundamenta&ccedil;&otilde;es?????parece-me um pouco vago.
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (2)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porLuiz Alexandreh&aacute; 11 meses.
                  
                     
                        Ci&ecirc;ncia da computa&ccedil;&atilde;oest&aacute; relacionada comteorias e fundamentos.
                        
                        Engenharia de Softwareest&aacute; relacionada compr&aacute;tica de desenvolvimento e entrega de software &uacute;til.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (5)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porLucianoh&aacute; mais de 2 anos.
                  
                     Sommerville.
                        Qual a diferen&ccedil;a entre engenharia de software e ci&ecirc;ncia da computa&ccedil;&atilde;o?A ci&ecirc;ncia da computa&ccedil;&atilde;o se ocupa da teoria e dos fundamentos; a engenharia de software trata da praticidade de desenvolver e fornecer software &uacute;til.
                        Pense em um engenheiro civil: ele n&atilde;o se preocupa com o desenvolvimento de teorias da f&iacute;sica ou matem&aacute;tica, por exemplo. Ela aplica estes conhecimentos para desempenhar sua fun&ccedil;&atilde;o de construir edifica&ccedil;&otilde;es.
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (12)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q13">
<p class="enunciado">13. 
          Segundo Pressman, em um sistema baseado em computador, &eacute; uma medida simples de confiabilidade:</p>
<ul class="opcoes">
<li correta="nao">a) Viola&ccedil;&atilde;o dos Padr&otilde;es de Programa&ccedil;&atilde;o (VPS);</li>
<li correta="nao">b) Desvio Intencional das Especifica&ccedil;&otilde;es (IDS);</li>
<li correta="sim">c) Tempo M&eacute;dio Entre Falhas (MTBF);</li>
<li correta="nao">d) Erro na L&oacute;gica do Projeto (EDL);</li>
<li correta="nao">e) Teste Incompleto ou Err&ocirc;neo (IET).</li>
</ul>
<div class="coment13"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porMarcelo Guimaraesh&aacute; mais de 2 anos.
                  
                     
                     Em Pressman, 7ed, Pag 396, diz:
                        "Se considerarmos um sistema computacional, uma medida de confiabilidade simples &eacute; o&nbsp;tempo m&eacute;dio entre falhas (MTBF, mean-time-to-failure):
                        
                        MTBF = MTTF + MTTR "
                        Os outros sao: Mean time to failure e mean time to repair.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (11)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porapg-bhh&aacute; mais de 2 anos.
                  
                     
                     Quem faz o uso do conceito de MTBF &eacute; o Gerenciamento da Disponibilidade do do Livro de Desenho de servicos do ITIL.
                        O Tempo M&eacute;dio entre as Falhas demonstra a confiabilidade do componente. Se um componente tiver um MTBF muito pequeno, significa que ele tem tend&ecirc;ncia a gerar incidentes com freq&uuml;&ecirc;ncia.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (1)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q14">
<p class="enunciado">14. 
          A lista a seguir descreve atividades a serem realizadas durante a  an&aacute;lise e o projeto estruturado de sistemas.
I.Definir mensagens de entrada e sa&iacute;da
II.Definir mensagens das fun&ccedil;&otilde;es internas
III.Decompor o sistema em processos primitivos
IV.Especificar processos primitivos
As  atividades  acima  descritas  representam  tarefas  a  serem  desenvolvidas na modelagem:</p>
<ul class="opcoes">
<li correta="nao">a) Est&aacute;tica</li>
<li correta="sim">b) Funcional</li>
<li correta="nao">c) Din&acirc;mica</li>
<li correta="nao">d) Orientada a Metas</li>
<li correta="nao">e) Orientada a Objetos</li>
</ul>
<div class="coment14"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porMarco Aur&eacute;lio Freesz Juniorh&aacute; aproximadamente 1 ano.
                  
                     N&atilde;o entendi a rela&ccedil;&atilde;o do metodo de modelagem funcional com as atividades apresentadas, se alguem puder me ajudar eu agradeceria mto !&nbsp;
                        
                        abs !&nbsp;
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (0)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porJuniorh&aacute; mais de 2 anos.
                  
                     
                     
                        
                           1. Modelo Din&acirc;mico
                        
                     
                     Este modelo representa, como o pr&oacute;prio nome diz, a parte din&acirc;mica do sistema. Este modelo tem como elementos b&aacute;sicos: eventos e estados.Quando um evento ocorre estimulando um objeto pode ocorrer uma resposta a este est&iacute;mulo e/ou, eventualmente, a gera&ccedil;&atilde;o de um outro evento. Um evento separa dois estados e um estado separa dois eventos.O modelo din&acirc;mico &eacute; composto, basicamente, por dois tipos de diagramas: diagramas de eventos e diagramas de estados.&nbsp;Em suma, o modelo din&acirc;mico &eacute; uma cole&ccedil;&atilde;o de diagramas de estados que interagem uns com os outros atrav&eacute;s de eventos compartilhados.
                     
                        
                           2. Modelo Funcional
                        
                     
                     O modelo funcional especifica os resultados de um processamento sem especificar como ou quando eles ser&atilde;o processados. Ele especifica o significado das opera&ccedil;&otilde;es do modelo de objetos e as a&ccedil;&otilde;es do modelo din&acirc;mico. Este modelo descreve como os dados s&atilde;o transformados, mas n&atilde;o quem ou quando isto ocorrer&aacute;.
                     O modelo funcional &eacute; composto por m&uacute;ltiplos DFD&amp;#39;s (Diagramas de Fluxo de Dados), que especificam o significado das opera&ccedil;&otilde;es e restri&ccedil;&otilde;es. Um DFD cont&eacute;m processos que transformam dados, fluxos de dados que movimentam os dados, objetos atores que produzem e consomem dados e objetos dep&oacute;sitos, que armazenam dados passivamente.
                        fonte:&nbsp;http://algol.dcc.ufla.br/~heitor/Artigos/Artigo_004.html
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (13)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q15">
<p class="enunciado">15. 
          Segundo Pressman (1995), Engenharia de Software &eacute; o estabelecimento e uso de s&oacute;lidos princ&iacute;pios de engenharia  para que se possa obter economicamente um software que seja confi&aacute;vel e que funcione eficientemente em  m&aacute;quinas reais, abrangendo um conjunto de tr&ecirc;s elementos fundamentais (m&eacute;todos, ferramentas e procedimentos).  Assinale a alternativa INCORRETA:</p>
<ul class="opcoes">
<li correta="nao">a) M&eacute;todos de Engenharia de Software proporcionam os detalhes de &ldquo;como fazer&rdquo; para construir o software.</li>
<li correta="nao">b) As ferramentas proporcionam apoio automatizado ou semi-automatizado aos m&eacute;todos.</li>
<li correta="nao">c) Procedimentos constituem o elo de liga&ccedil;&atilde;o dos m&eacute;todos e das ferramentas e possibilitam o desenvolvimento racional e oportuno de software.</li>
<li correta="nao">d) M&eacute;todos envolvem um amplo conjunto de tarefas que incluem: planejamento e estimativa de projeto, an&aacute;lise de requisitos de software e sistemas, projeto de estrutura de dados, arquitetura de programa e algoritmo de processamento, codifica&ccedil;&atilde;o, teste e manuten&ccedil;&atilde;o.</li>
<li correta="sim">e) Ferramentas s&atilde;o roteiros para o desenvolvimento de software.</li>
</ul>
<div class="coment15"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
            
               
                  
                     
                  
               
               
          
                  
                     
                  
               
            
            
               
            
            Comentado porLuiz Alexandreh&aacute; 11 meses.
                  
                     
                        
                           
                              
                                 A Engenharia de Software
                              
                           
                        :
                        - Tem seufocovoltado para aqualidadeemelhoria cont&iacute;nua.-
                           Processos (procedimentos)
                        
                        
                        
                           mant&eacute;m unida
                        
                        sas camadas de tecnologia e define as &aacute;reas-chave do processo.-
                           M&eacute;todos
                        fornecem a t&eacute;cnica de
                           como fazerpara
                           construir
                        (um amplo conjunto de tarefas)&nbsp;software .-
                           Ferramentas
                        de Eng. de SW fornecem
                           apoio automatizado ou semi-automatizado
                        para osprocessose para osm&eacute;todos.
                        
                        CAMADAS DA TECNOLOGIA DA ENG. DE SW
                        &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
                        &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp;
                        | &nbsp; &nbsp;FERRAMENTAS&nbsp; &nbsp; &nbsp; | &nbsp; &nbsp;&nbsp;
                        &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;
                        | &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;M&Eacute;TODOS&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;| &nbsp; &nbsp;
                        &nbsp; &nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;
                        | &nbsp;PROCESSOS/PROCEDIMENTOS&nbsp; | &nbsp; &nbsp; &nbsp;
                        &nbsp; &nbsp; &nbsp;| &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;FOCO NA QUALIDADE&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; |
                     
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (6)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porFrederico C. Selbachh&aacute; aproximadamente 1 ano.
                  
                     N&atilde;o tem muito o que comentar sobre essa quest&atilde;o. Realmente, de acordo com Pressman, a Engenharia de Software baseia-se em 3 conceitos fundamentais:- M&eacute;todos: t&eacute;cnicas/paradigmas de desenvolvimento de software;- Ferramentas: mecanismos que auxiliam a aplica&ccedil;&atilde;o dos m&eacute;todos;- Procedimentos: t&eacute;cnicas de manuseio das ferramentas para aplica&ccedil;&atilde;o dos m&eacute;todos.Com base nisso, pode-se concluir que a letra E &eacute; a alternativa incorreta, uma vez que "roteiros para o desenvolvimento de software" s&atilde;o m&eacute;todos, e n&atilde;o ferramentas.
                  
                  
                  
                  
                  
            
                     
                     &Uacute;til (14)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            
               
                  
                     
                  
               
               
          
            
            
               
            
            Comentado porMarcel Mauricioh&aacute; mais de 2 anos.
                  
                     Aproveitando os itens da pr&oacute;pria quest&atilde;o pra descrever os tr&ecirc;s elementos fundamentais:
                     
                        
                           M&eacute;todos de Engenharia de Software proporcionam os detalhes de &ldquo;como fazer&rdquo; para construir o software, que&nbsp;
                           envolvem um amplo conjunto de tarefas que incluem: planejamento e estimativa de projeto, an&aacute;lise de requisitos de software e sistemas, projeto de estrutura de dados, arquitetura de programa e algoritmo de processamento, codifica&ccedil;&atilde;o, teste e manuten&ccedil;&atilde;o.
                        
                        
                           As ferramentas proporcionam apoio automatizado ou semi-automatizado aos m&eacute;todos
                           .
                        
                        
                           Procedimentos constituem o elo de liga&ccedil;&atilde;o dos m&eacute;todos e das ferramentas e possibilitam o desenvolvimento racional e oportuno de software
                           .
                        
                     Restando apenas o item E como incorreto.
                  
                  
                  
                  
            
                     
                     &Uacute;til (16)
                  
                  
            
                     Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
                     
                     
                  
                  
                  
               
               
               
            
            
         
      <br>
<br>
</p>
<p>
         
            M&eacute;todos de Engenharia de Software proporcionam os detalhes de &ldquo;como fazer&rdquo; para construir o software, que&nbsp;
            envolvem um amplo conjunto de tarefas que incluem: planejamento e estimativa de projeto, an&aacute;lise de requisitos de software e sistemas, projeto de estrutura de dados, arquitetura de programa e algoritmo de processamento, codifica&ccedil;&atilde;o, teste e manuten&ccedil;&atilde;o.
         
      <br>
<br>
</p>
<p>
         
            As ferramentas proporcionam apoio automatizado ou semi-automatizado aos m&eacute;todos
            .
         
      <br>
<br>
</p>
<p>
         
            Procedimentos constituem o elo de liga&ccedil;&atilde;o dos m&eacute;todos e das ferramentas e possibilitam o desenvolvimento racional e oportuno de software
            .
         
      <br>
<br>
</p>
</div>
</div>
</div>
</body>
</html>
