<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=utf-8">
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script><script src="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.js"></script>
<link rel="stylesheet" href="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.css" type="text/css">
<style type="text/css">
	ul { 
		list-style-type: none; 
		line-height:150%
	}

	ol { 
		line-height:150%
	}
	
	table {
		border-collapse:collapse;
	}
	
	#cabecalho {
		border: 0px solid black;
		text-align:left;
		width:100%;
	}
	
	th, td {
		border: 1px solid black;
		text-align:center;
		padding:1px;
	}

	div
	{
		text-align:justify;
		text-justify:inter-word;
	}

	p {
		line-height:150%
	}
	
	img {
	    height: auto;
	    max-width: 100%;
	}

	div.cabecalho {

	margin: 20px;
    padding: 3px 10px 10px;
    
	}	
	
</style>
</head>
<body>
<h2></h2>
<div class="cabecalho">
<ul>
<li>Universidade FUMEC / Faculdade de Ci&ecirc;ncias Empresariais</li>
</ul>
<ul>
<li>Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o</li>
</ul>
<ul>
<li>Disciplina de
Engenharia de Software
/ Turma
12-7DA / 12-7NA
</li>
</ul>
<ul>
<li>Professor Dr. Fernando Silva Parreiras</li>
</ul>
<ul>
<li>Exercicios de Revisao (
2017-02/cap08
)</li>
</ul>
</div>
<div style="width=100%">
<div class="questao" id="q1">
<p class="enunciado">1. 
          Sobre teste de software considere:
I.  Uma estrat&eacute;gia de teste que &eacute; escolhida por grande  parte das equipes de software adota uma vis&atilde;o incremental do teste, come&ccedil;ando com o teste de unidades individuais de programa, avan&ccedil;ando para  testes projetados a fim de facilitar a integra&ccedil;&atilde;o das  unidades e culmina com testes que exercitam o  sistema constru&iacute;do.
II.  O teste de unidade focaliza o esfor&ccedil;o de verifica&ccedil;&atilde;o  na menor unidade de projeto do
software- o componente ou m&oacute;dulo de
software.Usando a descri&ccedil;&atilde;o de projeto no n&iacute;vel de componente como guia,  caminhos de controle importantes s&atilde;o testados  para descobrir erros dentro dos limites do m&oacute;dulo.
III.  O teste de unidade &eacute; normalmente considerado um  ap&ecirc;ndice ao passo de codifica&ccedil;&atilde;o. O projeto de  teste de unidade pode ser realizado antes que o  c&oacute;digo seja iniciado ou depois de o c&oacute;digo-fonte ter  sido gerado.
IV.  O teste de integra&ccedil;&atilde;o &eacute; uma t&eacute;cnica sistem&aacute;tica  para construir a arquitetura do
softwareenquanto,  ao mesmo tempo, conduz testes para descobrir  erros associados &agrave;s interfaces. O objetivo &eacute;, a partir  de componentes testados no n&iacute;vel de unidade,  construir uma estrutura de programa determinada  pelo projeto.
Est&aacute; correto o que se afirma em
</p>
<ul class="opcoes">
<li correta="sim">a) I, II, III e IV.</li>
<li correta="nao">b) I, II e IV, apenas.</li>
<li correta="nao">c) II, III e IV, apenas.</li>
<li correta="nao">d) III e IV, apenas.</li>
<li correta="nao">e) I e III, apenas.</li>
</ul>
<div class="coment1"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 19
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Silas Rodrigues do R&ecirc;go J&uacute;nior
									h&aacute; 11 meses.
								
								          
									            
										Letra A? Eu dava como certa a letra E. Algu&eacute;m poderia detalhar melhor?
										
										              
										Grato.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 14
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Thiago
									h&aacute; 11 meses.
								
								          
									            Acreditei que seria a letra E tamb&eacute;m.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 14
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Guilherme
									h&aacute; 10 meses.
								
								          
									            
										Quest&atilde;o retirada do&nbsp;
										http://www.ceunes.ufes.br/downloads/2/mariateixeira-EC.Engenharia%20de%20Software.Conte%C3%BAdo%206.2011.2.pdf
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 12
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Gustavo
									h&aacute; 8 meses.
								
								          
									            
										Tamb&eacute;m considero correta a letra E.
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Pablo Silva
									h&aacute; 5 meses.
								
								          
									            
										que coisa feia, a FCC copiou todos os t&oacute;picos do livro de Pressman 6&ordf; edi&ccedil;&atilde;o. Nem fizeram uma parafrase nem nada, foi s&oacute; no copia e cola. Se eu fizesse isso na minha monografia, era processo judicial na minha cola e ainda cassavam meu diploma.
										
										              
										Gabarito letra A, como disse foi retirado do Pressman
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 2
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eduardo Jorge dos Santos Cordeiro
									h&aacute; 2 meses.
								
								          
									            
										Teste de integra&ccedil;&atilde;o analisar a interface?!?!?!
										
										Como tinha certeza que a IV tava errada, acabei optando pela E tamb&eacute;m.
										
										Ao meu ver &eacute; pass&iacute;vel de anula&ccedil;&atilde;o.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 5
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Tiago Melquiades
									h&aacute; 2 meses.
								
								          
									            
										              I. Uma estrat&eacute;gia de teste que &eacute; escolhida por grande parte das equipes de software adota uma vis&atilde;o incremental do teste, come&ccedil;ando com o teste de unidades individuais de programa, avan&ccedil;ando para testes projetados a fim de facilitar a integra&ccedil;&atilde;o das unidades e culmina com testes que exercitam o sistema constru&iacute;do.
										              
											                (CORRETO, acredito nao haver duvida aqui)
										              
										              
										              
										              II. O teste de unidade focaliza o esfor&ccedil;o de verifica&ccedil;&atilde;o na menor unidade de projeto do&nbsp;
										              software
										              &nbsp;- o componente ou m&oacute;dulo de&nbsp;
										              software.&nbsp;
										              Usando a descri&ccedil;&atilde;o de projeto no n&iacute;vel de componente como guia, caminhos de controle importantes s&atilde;o testados para descobrir erros dentro dos limites do m&oacute;dulo.
										              
											                (Achei estranho o uso da express&atilde;o "m&oacute;dulo de software" para se referir a unidade mas... CORRETO)
										              
										              
										              
										              III. O teste de unidade &eacute; normalmente considerado um ap&ecirc;ndice ao passo de codifica&ccedil;&atilde;o. O projeto de teste de unidade pode ser realizado antes que o c&oacute;digo seja iniciado ou depois de o c&oacute;digo-fonte ter sido gerado.
										              
											                (CORRETO, TDD ou Test Driven Development diz que devemos primeiro criar os testes antes mesmo de criar os codigos)
										              
										              
										              
										              IV. O teste de integra&ccedil;&atilde;o &eacute; uma t&eacute;cnica sistem&aacute;tica para construir a arquitetura do&nbsp;
										              software
										              &nbsp;enquanto, ao mesmo tempo, conduz testes para descobrir erros associados &agrave;s interfaces. O objetivo &eacute;, a partir de componentes testados no n&iacute;vel de unidade, construir uma estrutura de programa determinada pelo projeto.
										              
											                (CORRETO. Perceba aqui que "interfaces" sao as interfaces entre as unidades ok, n&atilde;o tem nada haver com Interface com o usuario)
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q2">
<p class="enunciado">2. 
          Tipo de teste que focaliza cada componente de um software de forma individual, garantindo que o componente funciona  adequadamente:
</p>
<ul class="opcoes">
<li correta="nao">a) Teste de Integra&ccedil;&atilde;o.</li>
<li correta="sim">b) Teste de Unidade.</li>
<li correta="nao">c) Teste de Regress&atilde;o.</li>
<li correta="nao">d) Teste de Valida&ccedil;&atilde;o.</li>
</ul>
<div class="coment2"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 17
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leonel
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              a)(N&atilde;o condiz)
										Teste de Integra&ccedil;&atilde;o.
										
										Integra e testa os componentes de um sistema com o objetivo de encontrar erros durante suas intera&ccedil;&otilde;es.
										
										[
										PRESSMAN
										] &Eacute; uma t&eacute;cnica sistem&aacute;tica para construir a arquitetura de software ao mesmo tempo que conduz testes para descobrir erros associados com as interfaces
										
										              b)(Condiz)
										Teste de Unidade.
										
										Testa componentes individuais para assegurar sua correta opera&ccedil;&atilde;o
										
										[
										PRESSMAN
										] focaliza o esfor&ccedil;o de verifica&ccedil;&atilde;o na menor unidade de projeto do software
										
										              c)(N&atilde;o condiz)
										Teste de Regress&atilde;o.
										
										Realiza a execu&ccedil;&atilde;o de um subconjunto de teste que j&aacute; foram executados com o objetivo de garantir que mudan&ccedil;as n&atilde;o propagem erros.
										
										[
										PRESSMAN
										] &eacute; a reexecu&ccedil;&atilde;o do mesmo subconjunto de teste que j&aacute; foram executados para assegurar que as altera&ccedil;&otilde;es n&atilde;o tenham propagado efeitos colaterais indesejados
										
										              d)(N&atilde;o condiz)
										Teste de Valida&ccedil;&atilde;o.
										
										Ap&oacute;s a execu&ccedil;&atilde;o dos teste de integra&ccedil;&atilde;o pode ser iniciado os teste de valida&ccedil;&atilde;o ou aceita&ccedil;&atilde;o que objetivam demonstrar que o software est&aacute; em conformidade com o resquisitos.
										
										[
										PRESSMAN
										] O teste focaliza a&ccedil;&otilde;es vis&iacute;veis ao usu&aacute;rio e sa&iacute;das do sistema reconhec&iacute;veis pelo usu&aacute;rio ... a valida&ccedil;&atilde;o tem sucesso quando o software funciona de maneira que pode ser razoavelmente esperada pelo cliente.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q3">
<p class="enunciado">3. 
          Considere os seguintes poss&iacute;veis fatores que afetam a precis&atilde;o da estimativa de confiabilidade durante os  testes estat&iacute;sticos no processo de desenvolvimento de
software.I. A validade do perfil de  uso.
II. O n&uacute;mero de casos de teste efetuados.
III. A linguagem de programa&ccedil;&atilde;o  usada para  implementar o c&oacute;digo.
Sobre os  fatores, est&aacute;  correto o  contido em
</p>
<ul class="opcoes">
<li correta="nao">a) I, apenas.</li>
<li correta="sim">b) I e II, apenas.</li>
<li correta="nao">c) I e III, apenas</li>
<li correta="nao">d) Il e III, apenas.</li>
<li correta="nao">e) I, II e III.</li>
</ul>
<div class="coment3"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Fernanda
									h&aacute; 10 meses.
								
								          
									            Resposta correta &eacute; a letra B, por que?
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Adriano Pedro
									h&aacute; 9 meses.
								
								          
									            Tamb&eacute;m, gostaria de saber por que a letra B? Pela l&oacute;gica eu at&eacute; acertei aqui estudando, mas para mim s&oacute; a frase n&ordm; II est&aacute; correta...
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 5
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									eder campos ribeiro
									h&aacute; 6 meses.
								
								          
									            
										PAGINA 401(CAP&Iacute;TULO 21)&nbsp;DO LIVRO ENGENHARIA DE SOFTWARE - SOMMERVILLE. SEXTA EDI&Ccedil;&Atilde;O.
										
										RESPOSTA LETRA "B".
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 4
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Breno
									h&aacute; 5 meses.
								
								          
									            
										Em [1] fala que existem 4 etapas pra medir a confiabilidade de um sistema, vou dar uma resumida:
										
										              
										1) Estudo de sistemas existentes para estabelecer um
										perfil operacional
										.
										
										2) Constr&oacute;i um conjunto de
										dados de teste
										que reflitam esse perfil.
										
										3)
										Testa
										o sistema usando esses dados.
										
										4) Depois de observar o n&uacute;mero de falhas estatisticamente significativas, voc&ecirc; calcula a confiabilidade.
										
										              
										Nas outras p&aacute;ginas ele se aprofunda nesses passos, mas acredito que j&aacute; d&aacute; pra ver que a I e II est&atilde;o corretas. A III acredito que est&aacute; errada porque [1] n&atilde;o fala em nenhum momento em linguagem de programa&ccedil;&atilde;o.
										
										              
										[1] Sommerville, Engenharia de Software, 8&ordf; Edi&ccedil;&atilde;o p&aacute;gina 375
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q4">
<p class="enunciado">4. 
          Sobre testes de sistemas, considere:
I.  Testes de cen&aacute;rio s&atilde;o &uacute;teis pois podem garantir que n&atilde;o restam erros no sistema. Neste ponto diferem dos testes de  componentes que apenas garantem a integridade de m&oacute;dulos isolados do sistema, mas n&atilde;o garantem que a totalidade do  sistema est&aacute; isenta de erros.
II.  Testes de desenvolvimento incluem testes unit&aacute;rios, nos quais s&atilde;o testados objetos e m&eacute;todos espec&iacute;ficos; testes de  componentes, nos quais s&atilde;o testados diversos grupos de objetos; testes de sistema, nos quais s&atilde;o testados sistemas  parciais e sistemas completos.
III.  Os testes de usu&aacute;rio podem ser divididos em tr&ecirc;s fases: teste alfa, em que os usu&aacute;rios do
softwaretrabalham com a  equipe de desenvolvimento para efetuar testes no local do desenvolvedor; teste beta, em que um release de
software&eacute;  disponibilizado aos usu&aacute;rios para que possam experimentar e levantar os problemas descobertos com os  desenvolvedores do sistema; teste de sistema, em que os clientes testam um sistema para decidir se ele est&aacute; pronto para  ser implantado no ambiente de trabalho.
Est&aacute; correto o que se afirma em
</p>
<ul class="opcoes">
<li correta="nao">a) I, II e III.</li>
<li correta="sim">b) II, apenas.</li>
<li correta="nao">c) I e II, apenas.</li>
<li correta="nao">d) III, apenas.</li>
<li correta="nao">e) II e III, apenas.</li>
</ul>
<div class="coment4"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 23
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Gabriel  Di Atlanta
									h&aacute; aproximadamente 1 ano.
								
								          
									            Algu&eacute;m pode explicar o erro da afirmativa III?
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 31
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Renato Alves Felix
									h&aacute; aproximadamente 1 ano.
								
								          
									            
									            Com rela&ccedil;&atilde;o ao item I
									            
										              
										              &nbsp;&nbsp;&nbsp;&nbsp; Testes de Release, temos:
									            
									            
										              
											                Teste Funciona
											                
												l
												
												sendo os a
											
											                tores:
											                
												                  
													                    
														                      
															equipe de teste
															independente -
															                        ou seja, n&atilde;o &eacute; feito pela equipe de desenvolvimento
															                        
															tem o objetivo de
															
																                          Valida&ccedil;&atilde;o
															                        
															                        
														                      
													                    
												                  
												                  
													                    Tipos
												                  
											                
										              
										              
											                
												                  
													                    Testes baseados em Requisitos:
													                    o requisito deve ser escrito de modo que um teste possa ser projetado para ele
													                    &nbsp;
												                  
												                  
													                    
														Testes de
														Cen&aacute;rio
														:
													
													                    vc imagina cen&aacute;rios t&iacute;picos de uso e os usa para desenvolver casos de teste para o sistema
													                    &nbsp;
												                  
												                  
													                    Testes de Desempenho
													                    
														                      
															                        +
															                        -
															                        Perfil Operacional:
															                        conjunto de testes q refletem a mistura real de trabalho q ser&aacute; manipulado pelo sistema
															                        
															                        Ex: Testes de estresse
														                      
													                    
												                  
											                
										              
									            
									            
										              
										Com rela&ccedil;&atilde;o ao item III - o erro seria basicamente devido a troca dos termos Aceita&ccedil;&atilde;o por de Sistema, pois
									
									            
										              
											                
												                  
													Teste
													Alfa:
													                    
														os usu&aacute;rios trabalham com a equipe de desenv. para testar o sw
														no local do desenvolvedor
													                    
												                  
											                
										              
										              
											                
												                  
													Teste
													Beta:
													                    
														uma
														release antecipada
														&nbsp;&eacute; disponibilizada aos usu&aacute;rios p/ experimentarem
													
												                  
											                
										              
										              
											                
												                  
													Teste de
													
														                      Aceita&ccedil;&atilde;o
														:
													
													                    
														os clientes testam um sistema p/ decidir se est&aacute; ou n&atilde;o pronto para ser implantado
														no ambiente do cliente
													                    
												                  
											                
											                
												                  
													                    Sendo composto de 6 Est&aacute;gios:
													                    
														                      
															                        1. Definir crit&eacute;rios de aceita&ccedil;&atilde;o
														                      
														                      
															                        2. Planejar testes de aceita&ccedil;&atilde;o
														                      
														                      
															                        3. Derivar testes de aceita&ccedil;&atilde;o
														                      
														                      
															                        4. Executar testes de aceita&ccedil;&atilde;o
														                      
														                      
															                        5. Negociar resultados de teste
														                      
														                      
															                        6. Rejeitar/Aceitar sistema
														                      
													                    
												                  
											                
										              
									            
									Fonte: Ian Sommerville, Engenharia de Software, 9&ordf; Ed.
								
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
											          Teste Funciona
											          
												l
												
												sendo os a
											
											          tores:
											          
												            
													              
														                
															equipe de teste
															independente -
															                  ou seja, n&atilde;o &eacute; feito pela equipe de desenvolvimento
															                  
															tem o objetivo de
															
																                    Valida&ccedil;&atilde;o
															                  
															                  
														                
													              
												            
												            
													              Tipos
												            
											          
										        
      <br>
<br>
</p>
<p>
         
													              
														                
															equipe de teste
															independente -
															                  ou seja, n&atilde;o &eacute; feito pela equipe de desenvolvimento
															                  
															tem o objetivo de
															
																                    Valida&ccedil;&atilde;o
															                  
															                  
														                
													              
												            
      <br>
<br>
</p>
<p>
         
													              Tipos
												            
      <br>
<br>
</p>
<p>
         
											          
												            
													              Testes baseados em Requisitos:
													              o requisito deve ser escrito de modo que um teste possa ser projetado para ele
													              &nbsp;
												            
												            
													              
														Testes de
														Cen&aacute;rio
														:
													
													              vc imagina cen&aacute;rios t&iacute;picos de uso e os usa para desenvolver casos de teste para o sistema
													              &nbsp;
												            
												            
													              Testes de Desempenho
													              
														                
															                  +
															                  -
															                  Perfil Operacional:
															                  conjunto de testes q refletem a mistura real de trabalho q ser&aacute; manipulado pelo sistema
															                  
															                  Ex: Testes de estresse
														                
													              
												            
											          
										        
      <br>
<br>
</p>
<p>
         
													              Testes baseados em Requisitos:
													              o requisito deve ser escrito de modo que um teste possa ser projetado para ele
													              &nbsp;
												            
      <br>
<br>
</p>
<p>
         
													              
														Testes de
														Cen&aacute;rio
														:
													
													              vc imagina cen&aacute;rios t&iacute;picos de uso e os usa para desenvolver casos de teste para o sistema
													              &nbsp;
												            
      <br>
<br>
</p>
<p>
         
													              Testes de Desempenho
													              
														                
															                  +
															                  -
															                  Perfil Operacional:
															                  conjunto de testes q refletem a mistura real de trabalho q ser&aacute; manipulado pelo sistema
															                  
															                  Ex: Testes de estresse
														                
													              
												            
      <br>
<br>
</p>
<p>
         
															                  +
															                  -
															                  Perfil Operacional:
															                  conjunto de testes q refletem a mistura real de trabalho q ser&aacute; manipulado pelo sistema
															                  
															                  Ex: Testes de estresse
														                
      <br>
<br>
</p>
<p>
         
											          
												            
													Teste
													Alfa:
													              
														os usu&aacute;rios trabalham com a equipe de desenv. para testar o sw
														no local do desenvolvedor
													              
												            
											          
										        
      <br>
<br>
</p>
<p>
         
											          
												            
													Teste
													Beta:
													              
														uma
														release antecipada
														&nbsp;&eacute; disponibilizada aos usu&aacute;rios p/ experimentarem
													
												            
											          
										        
      <br>
<br>
</p>
<p>
         
											          
												            
													Teste de
													
														                Aceita&ccedil;&atilde;o
														:
													
													              
														os clientes testam um sistema p/ decidir se est&aacute; ou n&atilde;o pronto para ser implantado
														no ambiente do cliente
													              
												            
											          
											          
												            
													              Sendo composto de 6 Est&aacute;gios:
													              
														                
															                  1. Definir crit&eacute;rios de aceita&ccedil;&atilde;o
														                
														                
															                  2. Planejar testes de aceita&ccedil;&atilde;o
														                
														                
															                  3. Derivar testes de aceita&ccedil;&atilde;o
														                
														                
															                  4. Executar testes de aceita&ccedil;&atilde;o
														                
														                
															                  5. Negociar resultados de teste
														                
														                
															                  6. Rejeitar/Aceitar sistema
														                
													              
												            
											          
										        
      <br>
<br>
</p>
<p>
         
													              Sendo composto de 6 Est&aacute;gios:
													              
														                
															                  1. Definir crit&eacute;rios de aceita&ccedil;&atilde;o
														                
														                
															                  2. Planejar testes de aceita&ccedil;&atilde;o
														                
														                
															                  3. Derivar testes de aceita&ccedil;&atilde;o
														                
														                
															                  4. Executar testes de aceita&ccedil;&atilde;o
														                
														                
															                  5. Negociar resultados de teste
														                
														                
															                  6. Rejeitar/Aceitar sistema
														                
													              
												            
      <br>
<br>
</p>
<p>
         
															                  1. Definir crit&eacute;rios de aceita&ccedil;&atilde;o
														                
      <br>
<br>
</p>
<p>
         
															                  2. Planejar testes de aceita&ccedil;&atilde;o
														                
      <br>
<br>
</p>
<p>
         
															                  3. Derivar testes de aceita&ccedil;&atilde;o
														                
      <br>
<br>
</p>
<p>
         
															                  4. Executar testes de aceita&ccedil;&atilde;o
														                
      <br>
<br>
</p>
<p>
         
															                  5. Negociar resultados de teste
														                
      <br>
<br>
</p>
<p>
         
															                  6. Rejeitar/Aceitar sistema
														                
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 27
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Nelson Gutemberg
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              III -&nbsp;
										              Os testes de usu&aacute;rio podem ser divididos em tr&ecirc;s fases: teste alfa, em que os usu&aacute;rios do&nbsp;
										              software&nbsp;
										              trabalham com a equipe de desenvolvimento para efetuar testes no local do desenvolvedor; teste beta, em que um release de&nbsp;
										              software
										              &nbsp;&eacute; disponibilizado aos usu&aacute;rios para que possam experimentar e levantar os problemas descobertos com os desenvolvedores do sistema;
										              
											                teste de sistema, em que os clientes testam um sistema para decidir se ele est&aacute; pronto para ser implantado no ambiente de trabalho.
										              
										              &nbsp;Teste de sistema &eacute; definido no Item II da quest&atilde;o e n&atilde;o s&atilde;o testados pelos clientes...
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 19
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rafael Matos
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              
											I. Testes de cen&aacute;rio s&atilde;o &uacute;teis pois podem garantir que n&atilde;o restam erros no sistema. Neste ponto diferem dos testes de componentes que apenas garantem a integridade de m&oacute;dulos isolados do sistema, mas n&atilde;o garantem que a totalidade do sistema est&aacute; isenta de erros.&nbsp;
											
											                
											Incorreto, essa descri&ccedil;&atilde;o &eacute; sobre testes de sistema.
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Paulo
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Teste Alfa: S&atilde;o testes conduzidos pelo cliente nas instala&ccedil;&otilde;es do desenvolvedor, ou seja no ambiente de desenvolvimento.
										
										Teste Beta: &Eacute; conduzido em um ou mais locais do cliente, pelo usu&aacute;rio final do produto, geralmente sem a presen&ccedil;a do desenvolvedor, o cliente reporta aos desenvolvedores os poss&iacute;veis defeitos ou erros encontrados.
										
										Teste de Sistema: &Eacute; efetuado em ambiente operacional, levando em considera&ccedil;&atilde;o todos os requesitos do sistema, tais como pessoas, hardware, software, processos, informa&ccedil;&otilde;es etc. S&atilde;o conduzidos em um ambiente completo e integrado, por v&aacute;rias pessoas (n&atilde;o s&oacute; os desenvolvedores).
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 24
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eduardo Haddad
									h&aacute; 12 meses.
								
								          
									            
										I. Testes de cen&aacute;rio s&atilde;o &uacute;teis pois podem garantir que n&atilde;o restam erros no sistema. Neste ponto diferem dos testes de componentes que apenas garantem a integridade de m&oacute;dulos isolados do sistema, mas n&atilde;o garantem que a totalidade do sistema est&aacute; isenta de erros.
										
											                (Errado)
											                
											R.: Essa afirma&ccedil;&atilde;o de que "garante que n&atilde;o restam erros no sistema" &eacute; forte, &eacute; muito dif&iacute;cil garantir que o sistema est&aacute; livre de erros.
										
										              
										              
										              
										II. Testes de desenvolvimento incluem testes unit&aacute;rios, nos quais s&atilde;o testados objetos e m&eacute;todos espec&iacute;ficos; testes de componentes, nos quais s&atilde;o testados diversos grupos de objetos; testes de sistema, nos quais s&atilde;o testados sistemas parciais e sistemas completos.
										
											                (Certo)
										              
										              
										              
										III. Os testes de usu&aacute;rio podem ser divididos em tr&ecirc;s fases: teste alfa, em que os usu&aacute;rios do
										software
										trabalham com a equipe de desenvolvimento para efetuar testes no local do desenvolvedor; teste beta, em que um release de
										software
										&eacute; disponibilizado aos usu&aacute;rios para que possam experimentar e levantar os problemas descobertos com os desenvolvedores do sistema;
										teste de sistema
										,
										(teste de aceita&ccedil;&atilde;o)
										&nbsp;em que os clientes testam um sistema para decidir se ele est&aacute; pronto para ser implantado no ambiente de trabalho.
										
											                (Errado)
										              
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 13
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Diego
									h&aacute; 9 meses.
								
								          
									            
										II. Testes de desenvolvimento incluem testes unit&aacute;rios, nos quais s&atilde;o testados objetos e m&eacute;todos espec&iacute;ficos;
										testes de componentes, nos quais s&atilde;o testados diversos grupos de objetos
										; testes de sistema, nos quais s&atilde;o testados sistemas parciais e sistemas completos.
										
										              
										Teste de componente &eacute; a mesma coisa que teste unitario, logo a defini&ccedil;&atilde;o correta seria a defini&ccedil;&atilde;o anterior: "s&atilde;o testados objetos e m&eacute;todos espec&iacute;ficos".
										
										              
										J&aacute; o texto "
										testados diversos grupos de objetos
										" leva a entender que s&atilde;o objetos interagindo e isso nos leva a entender que est&aacute; mais para teste de integra&ccedil;&atilde;o do que teste de componente.
										
										              
										Para mim, todas est&atilde;o erradas. Alguem tem a informa&ccedil;&atilde;o se essa quest&atilde;o foi anulada?
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 6
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Odilon Filho
									h&aacute; 7 meses.
								
								          
									            
										              Acredito que o &uacute;nico erro da III &eacute; que o teste de sistema n&atilde;o &eacute; feito pelo usu&aacute;rio e sim pela equipe de desenvolvimento e testes.A defini&ccedil;&atilde;o que ele coloca como teste de sistema(
										              
											                Como est&aacute; de vermelho
										              
										              
											) s&atilde;o as caracter&iacute;sticas do teste de aceita&ccedil;&atilde;o.
											
											                
											III. Os testes de usu&aacute;rio podem ser divididos em tr&ecirc;s fases: teste alfa, em que os usu&aacute;rios do&nbsp;
										
										              software&nbsp;
										              trabalham com a equipe de desenvolvimento para efetuar testes no local do desenvolvedor; teste beta, em que um release de&nbsp;
										              software
										              &nbsp;&eacute; disponibilizado aos usu&aacute;rios para que possam experimentar e levantar os problemas descobertos com os desenvolvedores do sistema;
										              
											                teste de sistema, em que os clientes testam um sistema para decidir se ele est&aacute; pronto para ser implantado no ambiente de trabalho.
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 7
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									EDSON
									h&aacute; 7 meses.
								
								          
									            
										              III. Os testes de usu&aacute;rio podem ser divididos em tr&ecirc;s fases: teste alfa, em que os usu&aacute;rios do&nbsp;
										              software&nbsp;
										              
											trabalham com a equipe de desenvolvimento para efetuar testes no local do desenvolvedor;
											teste beta
											, em que um release de&nbsp;
										
										              software
										              
											&nbsp;&eacute; disponibilizado aos usu&aacute;rios para que possam experimentar e levantar os problemas
											descobertos com os desenvolvedores do sistema
											;
											teste de sistema
											, em que os clientes testam um sistema para decidir se ele est&aacute; pronto para ser implantado no ambiente de trabalho.
											
											                
											                
												Bom, a parte grifada em vermelho &eacute; teste de Aceita&ccedil;&atilde;o o correto, por isso ficou errado o item III,
												
												                  
												Por&eacute;m onde grifei de amarelo, fiquei com d&uacute;vida se tbm est&aacute; errado, pois o teste Beta n&atilde;o &eacute; "sem" a presen&ccedil;a do desenvolvedor???
												
												N&atilde;o tem ngm comentando q essa parte tbm estaria errada, comentem ae pessoal se concordam comigo q isso tbm eh um erro...
											
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 1
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Tiago Melquiades
									h&aacute; 2 meses.
								
								          
									            
										@Edson, com rela&ccedil;&atilde;o a seu coment&aacute;rio, perceba que tem uma ambiguidade na quest&atilde;o veja: "(...) os problemas descobertos com os desenvolvedores do sistema" --&gt; ou seja, os problemas foram descobertos junto com os desenvolvedores, mas nada diz que os desenvolvedores est&atilde;o presentes no teste, entende? Para ter esse sentido deveria haver uma virgula depois de "descobertos". Mas enfim, isso &eacute; quest&atilde;o de portugues mas como esta na quest&atilde;o acredito ser valido comentar.
										
										              
										Quanto a parte tecnica acredito estar errada quando ele diz que o teste beta &eacute; disponibilizado aos usuarios
										para que possam experimentar e levantar os problemas descobertos
										(...). Ora! o teste beta nao &eacute; para experimentar e levantar problemas ocorridos no teste alfa, aqui ser&atilde;o realizados novos testes com o intuito de encontrar novos erros que nao foram detectados em fases anteriores.
										
										              
										              
											Pra mim os erros do item III esta marcado abaixo:
											
											                
											Os testes de usu&aacute;rio podem ser divididos em tr&ecirc;s fases: teste alfa, em que os usu&aacute;rios do&nbsp;
											software&nbsp;
											trabalham com a equipe de desenvolvimento para efetuar testes no local do desenvolvedor; teste beta, em que um release de&nbsp;
											software
											&nbsp;&eacute; disponibilizado aos usu&aacute;rios
										
										              
											                para que possam experimentar e levantar os problemas descobertos com os desenvolvedores do sistema
										              
										              ;
										              
											                
												                  teste de sistema
											                
										              
										              
											, em que os clientes testam um sistema para decidir se ele est&aacute; pronto para ser implantado no ambiente de trabalho.&nbsp;
											
											                
											Abra&ccedil;os, bom estudos!!!
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 1
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Hugo
									h&aacute; 28 dias.
								
								          
									            
										              A assertiva II est&aacute; correta, diretamente tirada do livro do Sommerville (9th ed., p&aacute;gina 211):
										              
										              
										              *1. Unit testing, where individual program units or object classes are
										              
										              tested. Unit&nbsp;
										              testing should focus on testing the functionality of objects or methods.*
										              
										              *2. Component testing, where several individual units are integrated to
										              
										              create composite&nbsp;
										              components. Component testing should focus on testing component&nbsp;
										              interfaces.*
										              
										              *3. System testing, where some or all of the components in a system are
										              
										              integrated&nbsp;
										              and the system is tested as a whole. System testing should focus on
										              
										              testing component&nbsp;
										              interactions*
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 0.00
									
									Votos: 0
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Wagner Salazar
									h&aacute; 1 dia.
								
								          
									            
										Gostaria apenas de lembra-los que Sommervile define teste de sistema em duas fases: teste de integra&ccedil;&atilde;o e teste de libera&ccedil;&atilde;o. E ainda comenta que o teste de libera&ccedil;&atilde;o &eacute; tamb&eacute;m chamado de aceita&ccedil;&atilde;o e realmente envolve o cliente, como muitos j&aacute; disseram.
										
										              
										N&atilde;o menos importante, pressman menciona que o teste de sistema &eacute; composto v&aacute;rios teste de integra&ccedil;&atilde;o e valida&ccedil;&atilde;o e que esses n&atilde;o s&atilde;o conduzidos pelos engenheiros de software.
										
										              
										              
										Asssim, acredito que o erro n&atilde;o sei a troca das palavras sistemas por aceita&ccedil;&atilde;o.&nbsp;
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q5">
<p class="enunciado">5. 
          Observe  a  figura,  que  ilustra  o  modelo  de  um  sistema  em  teste.
No  modelo,  o  testador  fornece  as  entradas  para  o  componente  ou  o  sistema  e  examina  as  sa&iacute;das  correspondentes. Se as sa&iacute;das n&atilde;o forem as previstas, o teste  detectou  um  problema  com  o  software.  Este  teste  &eacute;  conhecido como teste de
</p>
<img src="https://qcon-assets-production.s3.amazonaws.com/images/provas/25803/Imagem 007.jpg"><br>
<ul class="opcoes">
<li correta="nao">a) configura&ccedil;&atilde;o.</li>
<li correta="sim">b) caixa preta.</li>
<li correta="nao">c) caixa branca.</li>
<li correta="nao">d) desempenho.</li>
</ul>
<div class="coment5"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 18
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Charles Miranda Santos
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              
											Segundo Pressman, Teste caixa preta refere-se a testes que s&atilde;o conduzidos na interface do software. Um teste caixa preta examina algum aspecto fundamental do sistema. Tamb&eacute;m chamado de teste comportamental, focaliza os requisitos funcionais do software. Permite ao engenheiro de software dedivar conjuntos de
											condi&ccedil;&otilde;es de entrada
											que v&atilde;o exercitar plenamente todos os requisitos funcionais do prorgama.
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Charles Miranda Santos
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              
											Importante destacar que esta quest&atilde;o, assim como algumas outras desta prova foram retiradas do livro Egenharia de Software do Sommerville.
											
											&nbsp;&nbsp;&nbsp;&nbsp; O teste de releases geralmente &eacute; um processo de teste
											
												                  caixa-preta
											                
											no qual os
											
												                  testes s&atilde;o derivados da especifica&ccedil;&atilde;o do sistema
											                
											. O sistema &eacute; tratado como uma caixa-preta, cujo
											
												                  comportamento pode ser somente determinado por meio do estudo de suas entradas e sa&iacute;das relacionadas
											                
											.
											
												                  Outro nome para isso &eacute; teste funcional, pois o testador concentra-se na funcionalidade, e n&atilde;o na implementa&ccedil;&atilde;o do software.
											                
											                
											&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; O testador fornece as entradas para o componente e examina as sa&iacute;das correspondentes. Se as saidas n&atilde;o forem as previstas, o teste detectou um problema com o software.
											
											                
											Fonte: Engenharia de Software, Sommerville 8a. Edi&ccedil;&atilde;o,&nbsp; p. 359
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q6">
<p class="enunciado">6. 
          
Considere:O objetivo &eacute; executar o sistema sob o ponto de vista de seu usu&aacute;rio final, varrendo as funcionalidades em busca de falhas em  rela&ccedil;&atilde;o aos objetivos originais. Os testes s&atilde;o executados em condi&ccedil;&otilde;es similares &agrave;quelas que um usu&aacute;rio utilizar&aacute; no seu dia-a- dia de manipula&ccedil;&atilde;o do sistema.
A afirmativa refere-se ao teste de</p>
<ul class="opcoes">
<li correta="nao">a) aceita&ccedil;&atilde;o.</li>
<li correta="sim">b) sistema.</li>
<li correta="nao">c) unidade.</li>
<li correta="nao">d) opera&ccedil;&atilde;o.</li>
<li correta="nao">e) integra&ccedil;&atilde;o.</li>
</ul>
<div class="coment6"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 36
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Everton
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Testes de sistema: s&atilde;o realizados pela equipe de testes, visando a execu&ccedil;&atilde;o do sistema como um todo ou um subsistema (parte do sistema), dentro de um ambiente operacional controlado, para validar a exatid&atilde;o e perfei&ccedil;&atilde;o na execu&ccedil;&atilde;o de suas fun&ccedil;&otilde;es. Neste est&aacute;gio de testes deve ser simulada a opera&ccedil;&atilde;o normal do sistema, sendo testadas todas as suas fun&ccedil;&otilde;es de forma mais pr&oacute;xima poss&iacute;vel do que ir&aacute; ocorrer no ambiente de produ&ccedil;&atilde;o. S&atilde;o usados dados de teste e situa&ccedil;&otilde;es de teste de modo a tentar evitar a ocorr&ecirc;ncia de defeitos em ambiente de produ&ccedil;&atilde;o. Esses testes s&atilde;o feitos pela equipe de teste de software
										
										              
										Fonte: Prof Marcio Victorino
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 31
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Apoena Teixeira
									h&aacute; aproximadamente 1 ano.
								
								          
									            
									            
										              
											                
												a) aceita&ccedil;&atilde;o.
												
												Teste de aceite
												
												Acceptance testing
												
												Teste formal relacionado &agrave;s necessidades dos usu&aacute;rios, requisitos e processos de neg&oacute;cios. &Eacute; realizado para estabelecer se um sistema satisfaz ou n&atilde;o os crit&eacute;rios de aceita&ccedil;&atilde;o e para possibilitar aos usu&aacute;rios, aos clientes e &agrave;s outras entidades autorizadas decidir aceitar ou n&atilde;o determinado sistema. [posterior a IEEE 610]
											
										              
									            
									            
										              
											                
												b) sistema.
												CORRETA
												                  
												Teste de sistema
												
												System testing
												
												Testa um sistema integrado para verificar se ele atende aos requisitos especificados. [Hetzel]
											
										              
									            
									            
										              
											                
												c) unidade.
												
												Teste de unidade
												
												Unit testing
												
												Ver teste de componente.
												
												                  
												Teste de componente
												
												Component testing
												
												Teste individual de componente de software. [posterior a IEEE 610]
											
										              
									            
									            
										              
											                
												d) opera&ccedil;&atilde;o.
												
												N&atilde;o tem defini&ccedil;&atilde;o no Syllabus do ISTQB
											
										              
									            
									            
										              
											                
												e) integra&ccedil;&atilde;o.
												
												Teste de integra&ccedil;&atilde;o
												
												Integration testing
												
												Teste realizado com a finalidade de expor defeitos nas interfaces e nas intera&ccedil;&otilde;es entre componentes ou sistemas integrados. Ver tamb&eacute;m teste de integra&ccedil;&atilde;o de componente e teste de integra&ccedil;&atilde;o de sistema.
												
												                  
												Teste de integra&ccedil;&atilde;o de componentes
												
												Component integration testing
												
												Testes realizados para expor os defeitos nas interfaces e intera&ccedil;&atilde;o entre os componentes integrados.
												
												                  
												Teste de integra&ccedil;&atilde;o de sistema
												
												System integration testing
												
												Testar a integra&ccedil;&atilde;o de sistemas e pacotes e/ou as interfaces para outras organiza&ccedil;&otilde;es externas (por exemplo, Interc&acirc;mbio Eletr&ocirc;nico de Dados, Internet).
												
												                  
												Fonte: ISTQB Syllabus
												
												http://www.bstqb.org.br
											
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
											          
												a) aceita&ccedil;&atilde;o.
												
												Teste de aceite
												
												Acceptance testing
												
												Teste formal relacionado &agrave;s necessidades dos usu&aacute;rios, requisitos e processos de neg&oacute;cios. &Eacute; realizado para estabelecer se um sistema satisfaz ou n&atilde;o os crit&eacute;rios de aceita&ccedil;&atilde;o e para possibilitar aos usu&aacute;rios, aos clientes e &agrave;s outras entidades autorizadas decidir aceitar ou n&atilde;o determinado sistema. [posterior a IEEE 610]
											
										        
      <br>
<br>
</p>
<p>
         
											          
												b) sistema.
												CORRETA
												            
												Teste de sistema
												
												System testing
												
												Testa um sistema integrado para verificar se ele atende aos requisitos especificados. [Hetzel]
											
										        
      <br>
<br>
</p>
<p>
         
											          
												c) unidade.
												
												Teste de unidade
												
												Unit testing
												
												Ver teste de componente.
												
												            
												Teste de componente
												
												Component testing
												
												Teste individual de componente de software. [posterior a IEEE 610]
											
										        
      <br>
<br>
</p>
<p>
         
											          
												d) opera&ccedil;&atilde;o.
												
												N&atilde;o tem defini&ccedil;&atilde;o no Syllabus do ISTQB
											
										        
      <br>
<br>
</p>
<p>
         
											          
												e) integra&ccedil;&atilde;o.
												
												Teste de integra&ccedil;&atilde;o
												
												Integration testing
												
												Teste realizado com a finalidade de expor defeitos nas interfaces e nas intera&ccedil;&otilde;es entre componentes ou sistemas integrados. Ver tamb&eacute;m teste de integra&ccedil;&atilde;o de componente e teste de integra&ccedil;&atilde;o de sistema.
												
												            
												Teste de integra&ccedil;&atilde;o de componentes
												
												Component integration testing
												
												Testes realizados para expor os defeitos nas interfaces e intera&ccedil;&atilde;o entre os componentes integrados.
												
												            
												Teste de integra&ccedil;&atilde;o de sistema
												
												System integration testing
												
												Testar a integra&ccedil;&atilde;o de sistemas e pacotes e/ou as interfaces para outras organiza&ccedil;&otilde;es externas (por exemplo, Interc&acirc;mbio Eletr&ocirc;nico de Dados, Internet).
												
												            
												Fonte: ISTQB Syllabus
												
												http://www.bstqb.org.br
											
										        
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 16
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eleizomar
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              http://pt.wikipedia.org/wiki/Teste_de_software
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 4
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Nath&aacute;lia Granja
									h&aacute; 4 meses.
								
								          
									            
										Na minha vis&atilde;o, quest&atilde;o muito generalista. N&atilde;o d&aacute; pra apontar especificamente em que etapa da estrat&eacute;gia de teste essa descri&ccedil;&atilde;o se encaixa.&nbsp;
										
										              
										"
										O objetivo &eacute; executar o sistema sob o ponto de vista de seu usu&aacute;rio final, varrendo as funcionalidades em busca de falhas em rela&ccedil;&atilde;o aos objetivos originais. Os testes s&atilde;o executados em condi&ccedil;&otilde;es similares &agrave;quelas que um usu&aacute;rio utilizar&aacute; no seu dia-a- dia de manipula&ccedil;&atilde;o do sistema.
										"
										
										              
										Essa descri&ccedil;&atilde;o se encaixa mais no conceito de teste beta, que &eacute; um teste de valida&ccedil;&atilde;o,&nbsp;segundo Roger Pressman:
										
										              
										"O teste beta, &eacute; conduzido nas instala&ccedil;&otilde;es de um ou mais usu&aacute;rios finais. O teste beta &eacute; uma aplica&ccedil;&atilde;o "ao vivo" do software em um ambiente n&atilde;o controlado. O cliente registra os problemas e os relata". &nbsp;
										
										              
										Ainda,
										
										              
										"O teste de valida&ccedil;&atilde;o proporciona a garantia final que o sft satisfaz a todos os requisitos funcionais, comportamentais e desempenho".&nbsp;
										
										              
										Segundo o mesmo, ainda:
										
										              
										"Teste de sistema &eacute; na realidade uma s&eacute;rie de diferentes testes cuja finalidade prim&aacute;ria &eacute; exercer totalmente o sistema. Ele verifica se todos os elementos do sistema, como um todo, se combinam corretamente".
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Esdras Fermon
									h&aacute; aproximadamente 1 m&ecirc;s.
								
								          
									            
										O ponto chave &eacute; "
										&nbsp;varrendo as funcionalidades em busca de falhas
										". O teste de aceita&ccedil;&atilde;o testa os requisitos, isto &eacute;, testa as funcionalidades, pode at&eacute; encontar falhas, mas seu o objetivo &eacute; validar os requisitos/funcionalidades. Como a quest&atilde;o fala que a aplica&ccedil;&atilde;o j&aacute; est&aacute; dispon&iacute;vel para o usu&aacute;rio, a resposta, na minha opni&atilde;o, teste de sistema.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q7">
<p class="enunciado">7. 
          
Em rela&ccedil;&atilde;o &agrave;s abordagens e estrat&eacute;gias de teste de software, analise os itens a seguir, colocando (V) para a assertiva verdadeira e (F) para a assertiva falsa.
(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)  Teste  fuma&ccedil;a  pode  ser  caracterizado  como  uma  estrat&eacute;gia de  integra&ccedil;&atilde;o constante para avaliar os  mecanismos de prote&ccedil;&atilde;o e seguran&ccedil;a do software  constru&iacute;do.
(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)  Teste de regress&atilde;o &eacute; a reexecu&ccedil;&atilde;o de algum sub- conjunto  de  testes  que  j&aacute;  foram  conduzidos  para  garantir que as modifca&ccedil;&otilde;es do software n&atilde;o propagaram efeitos colaterais indesej&aacute;veis.
(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)  Teste  de  estresse  tem  o  objetivo  de  submeter  o  sistema a situa&ccedil;&otilde;es anormais como, por exemplo,  uma carga de trabalho excessiva.
(&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)  Teste beta &eacute; um  teste de aceita&ccedil;&atilde;o que necessariamente &eacute; executado pelo usu&aacute;rio fnal  junto com  o desenvolvedor do software em um ambiente controlado.
Assinale a op&ccedil;&atilde;o com a sequ&ecirc;ncia CORRETA, na ordem  de cima para baixo.</p>
<ul class="opcoes">
<li correta="sim">a) F, V, V, F.</li>
<li correta="nao">b) V, V, F, F.</li>
<li correta="nao">c) F, V, V, V.</li>
<li correta="nao">d) V, F, V, V.</li>
</ul>
<div class="coment7"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 15
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Apoena Teixeira
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              
											                
												                  Letra A est&aacute; errado
												:
											
											Teste fuma&ccedil;a pode ser caracterizado como uma estrat&eacute;gia de integra&ccedil;&atilde;o constante para avaliar os mecanismos de prote&ccedil;&atilde;o e seguran&ccedil;a do software constru&iacute;do.
											
											                
											                
												                  Teste de Fuma&ccedil;
											                
											a ou
											Smoke Test
											&eacute; chamado de
											Teste B&aacute;sico
											pelo ISTQB
											
											                
											                
												                  Teste b&aacute;sico
											                
											                
											                Smoke test
											                
											Subconjunto de todos os casos de testes definidos/planejados que cobre a principal funcionalidade de um componente ou sistema,
											para averiguar as principais fun&ccedil;&otilde;es de um programa em funcionamento sem se preocupar com maiores detalhes
											. A realiza&ccedil;&atilde;o di&aacute;ria de testes de constru&ccedil;&atilde;o e teste b&aacute;sico est&aacute; entre as melhores pr&aacute;ticas do ramo.
											
											Ver tamb&eacute;m teste de entrada.
											
											                
											                
												                  Teste de entrada
											                
											                
											                Intake test
											                
											Inst&acirc;ncia especial do teste b&aacute;sico que decide se o componente ou sistema est&aacute; pronto para testes mais detalhados. Este teste normalmente &eacute; realizado no in&iacute;cio da fase de execu&ccedil;&atilde;o de teste.
											
											Ver tamb&eacute;m teste b&aacute;sico.
											
											                
											_____________________________________________________
											
											                
											                
												                  Letra B est&aacute; correto:
											                
											Teste de regress&atilde;o &eacute; a reexecu&ccedil;&atilde;o de algum sub- conjunto de testes que j&aacute; foram conduzidos para garantir que as modifca&ccedil;&otilde;es do software n&atilde;o propagaram efeitos colaterais indesej&aacute;veis.
											
											                
											                
												                  Teste de regress&atilde;o
											                
											                
											                Regression testing
											                
											Teste realizado em um programa previamente testado ap&oacute;s alguma modifica&ccedil;&atilde;o feita e com a finalidade de assegurar que defeitos n&atilde;o tenham sido introduzidos ou mascarados nas &aacute;reas n&atilde;o alteradas do software como resultado da referida modifica&ccedil;&atilde;o. Este teste &eacute; realizado quando o software ou seu ambiente &eacute; alterado.
											
											_____________________________________________________
											
											                
											                
											                Fonte:
											                
											                
												GLOSS&Aacute;RIO PADR&Atilde;O DE TERMOS UTILIZADOS EM TESTE DE SOFTWARE
												
												Vers&atilde;o 2.1br (Abril de 2010)
												
												Produzido pelo &ldquo;Glossary Working Party&rdquo;
												
												International Software Testing Qualification Board
											
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 13
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Apoena Teixeira
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              
										              
											                
												                  Letra C est&aacute; correto:
											                
											Teste de estresse tem o objetivo de submeter o sistema a situa&ccedil;&otilde;es anormais como, por exemplo, uma carga de trabalho excessiva.
											
											                
											                
												                  Teste de estresse
											                
											                
											                Stress testing
											                
											Avalia um sistema ou componente em rela&ccedil;&atilde;o e al&eacute;m dos limites de seus requisitos especificados. [IEEE 610].
											
											Ver tamb&eacute;m teste de carga.
											
											                
											                
												                  Teste de carga
											                
											                
											                Load testing
											                
											Tipo de teste de desempenho realizado para avaliar o comportamento de um componente ou sistema com carga crescente, por exemplo, n&uacute;mero de usu&aacute;rios paralelo e/ou o n&uacute;mero de transa&ccedil;&otilde;es, para determinar qual a carga pode ser manipulada por um componente
											
											                
											                
												                  Teste de desempenho
											                
											                
											                Performance testing
											                
											Processo que determina o desempenho de um produto de software.
											
											Ver tamb&eacute;m teste de efici&ecirc;ncia.
											
											                
											                
												                  Teste de efici&ecirc;ncia
											                
											                
											                Efficiency testing
											                
											Processo de teste para determinar a efici&ecirc;ncia de um produto de software.
											
											_____________________________________________________
											
											                
											                
												                  Letra D est&aacute; errado:
											                
											Teste beta &eacute; um teste de aceita&ccedil;&atilde;o que necessariamente &eacute; executado pelo usu&aacute;rio fnal junto com o desenvolvedor do software em um ambiente controlado.
											
											                
											                
												                  Teste beta
												                  
												                  Beta testing
											                
											                
											Teste operacional realizado por usu&aacute;rios/consumidores existentes/potenciais em um local externo,
											sem envolvimento dos desenvolvedores
											, a fim de determinar se um componente ou sistema satisfaz, ou n&atilde;o, as necessidades de usu&aacute;rios/consumidores e se encaixa dentro dos processos dos neg&oacute;cios. O teste beta &eacute; frequentemente utilizado como uma forma de teste de aceita&ccedil;&atilde;o externa para softwares de prateleira (off-the-shelf software), possibilitando avaliar o feedback do mercado.
											
											                
											                
											                Fonte:
											                
											                
												GLOSS&Aacute;RIO PADR&Atilde;O DE TERMOS UTILIZADOS EM TESTE DE SOFTWARE
												
												Vers&atilde;o 2.1br (Abril de 2010)
												
												Produzido pelo &ldquo;Glossary Working Party&rdquo;
												
												International Software Testing Qualification Board
											
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									jorge f cho
									h&aacute; aproximadamente 1 ano.
								
								          
									            Quarto item: (ERRADO) Teste beta&nbsp;ALFA &eacute; um teste de aceita&ccedil;&atilde;o que necessariamente &eacute; executado pelo usu&aacute;rio fnal junto com o desenvolvedor do software em um ambiente controlado.&nbsp;
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Lucas Vieira Ribeiro
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              Teste de Fuma&ccedil;a:
										&Eacute; uma estrat&eacute;gia de integra&ccedil;&atilde;o constante. O software &eacute; reconstru&iacute;do e testado diariamente para dar aos gerentes e desenvolvedores uma
										avalia&ccedil;&atilde;o real&iacute;stica do
										              
											                progresso
										              
										.
										
										              
										N&atilde;o se fala aqui de mecanismos de prote&ccedil;&atilde;o e seguran&ccedil;a do software constru&iacute;do.
										
										              
										              Teste Beta:
										PRESSMAN afirma que o
										teste beta
										&eacute; conduzido em uma ou mais instala&ccedil;&otilde;es do cliente, pelo
										usu&aacute;rio final
										do software. Diferente do
										teste alfa
										, o desenvolvedor geralmente n&atilde;o est&aacute; presente. Conseq&uuml;entemente, o teste beta &eacute; uma aplica&ccedil;&atilde;o do software num ambiente que n&atilde;o pode ser controlado pelo desenvolvedor.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rosa Machado
									h&aacute; 10 meses.
								
								          
									            
										I - teste de seguran&ccedil;a (Pressman cita este teste)
										
										IV - teste alfa
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q8">
<p class="enunciado">8. 
          Em sistemas de tempo real que usam mem&oacute;ria compartilhada ou uma interface de passagem de mensagens,  pode acontecer do produtor e consumidor de dados funcionarem a velocidades diferentes. Caso haja uma falha  de projeto, esse fato pode gerar um erro de
timinge o  consumidor pode obter informa&ccedil;&otilde;es desatualizadas. O  teste aplic&aacute;vel neste caso e que visa prevenir tais ocorr&ecirc;ncias &eacute; o
</p>
<ul class="opcoes">
<li correta="nao">a) de parti&ccedil;&otilde;es.</li>
<li correta="sim">b) de interfaces.</li>
<li correta="nao">c) de caminho.</li>
<li correta="nao">d) de componentes.</li>
<li correta="nao">e) estrutural.</li>
</ul>
<div class="coment8"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eduardo Jorge dos Santos Cordeiro
									h&aacute; 2 meses.
								
								          
									            Como o pr&oacute;prio enunciado diz:&nbsp;interface
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 2
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rosa Machado
									h&aacute; aproximadamente 1 m&ecirc;s.
								
								          
									            A resposta est&aacute; na pg 151 do livro do Sommerville - 9ed.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q9">
<p class="enunciado">9. 
          No  que  diz  respeito  aos  sistemas  de
software,  teste  &eacute;  um  conjunto  de  atividades  que  podem  ser  planejadas  antecipadamente  e  conduzidas  sistematicamente. Um  tipo  I  de teste se refere ao conjunto de atividades que garante que  o
softwareimplementa corretamente  uma  fun&ccedil;&atilde;o espec&iacute;fica,  associado &agrave; constru&ccedil;&atilde;o do produto de forma correta ou n&atilde;o,  enquanto  um  tipo  II  se  refere  a  um  conjunto  de  atividades  diferente que garante que o
softwareconstru&iacute;do corresponde  aos requisitos do cliente, associado &agrave; constru&ccedil;&atilde;o do produto  certo.  Esses  testes  do  tipo  I  e  II  s&atilde;o  denominados,  respectivamente:
</p>
<ul class="opcoes">
<li correta="nao">a) depura&ccedil;&atilde;o e homologa&ccedil;&atilde;o.</li>
<li correta="nao">b) homologa&ccedil;&atilde;o e aceita&ccedil;&atilde;o.</li>
<li correta="nao">c) aceita&ccedil;&atilde;o e verifica&ccedil;&atilde;o.</li>
<li correta="sim">d) verifica&ccedil;&atilde;o e valida&ccedil;&atilde;o.</li>
<li correta="nao">e) valida&ccedil;&atilde;o e depura&ccedil;&atilde;o.</li>
</ul>
<div class="coment9"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 28
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Lhugo T Jr
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              
											                
												                  O conceito de valida&ccedil;&atilde;o
												, para a engenharia de softwares, &eacute; a avalia&ccedil;&atilde;o do grau em que um sistema de software realmente satisfaz seus requisitos, no sentido de atender &agrave;s necessidades reais do usu&aacute;rio. Satisfazer requisitos n&atilde;o &eacute; o mesmo que estar conforme as especifica&ccedil;&otilde;es de requisitos. A
												
												especifica&ccedil;&atilde;o de requisitos &eacute; uma declara&ccedil;&atilde;o sobre uma solu&ccedil;&atilde;o particular proposta para um problema, podendo ela atingir ou n&atilde;o os seus objetivos.
												
												Especifica&ccedil;&otilde;es de requisitos est&atilde;o suscet&iacute;veis a erros, pois s&atilde;o escritas por humanos.
												As atividades de valida&ccedil;&atilde;o procuram medir o quanto o sistema realmente atinge seus prop&oacute;sitos.
												                  
												                  
												                  Para conceituar verifica&ccedil;&atilde;o
												, podemos afirmar que &eacute; a checagem da consist&ecirc;ncia de uma implementa&ccedil;&atilde;o com uma especifica&ccedil;&atilde;o.
												
													                    
														                      
															A verifica&ccedil;&atilde;o tem o objetivo de avaliar se
															o que foi planejado
															realmente foi realizado. Ou seja, se os requisitos, funcionalidades e performence documentados foram implementados.
															
															                        
															Fonte; www.ti24x7.com.br
														
													                    
												                  
											                
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 33
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Haroldo Oliveira de Souza
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Essa quest&atilde;o foi retirada literalmente do Pressman - Eng. de Software 6ed, cap 13 pag 289
										
										              
										"Verifica&ccedil;&atilde;o: refere-se ao conjunto de atividades que garante que o software implementa corretamente uma fun&ccedil;&atilde;o especifica.
										
										Estamos construindo o produto corretamente?
										
										              
										Valid&ccedil;&atilde;o: refere-se ao conjunto a um conjunto de atividades diferentes que garante q o software q foi corresponde aos requisitos do cliente.
										
										Estamos construindo o produto certo?"
										
										              
										Bons estudos!!
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 16
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Bruno Marquete da Silva
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Conceito b&aacute;sico da V&amp;V.
										
										              
										              Verifica&ccedil;&atilde;o:
										averiguar se est&aacute; construindo
										CERTO
										o produto, ou seja, se segue a especifica&ccedil;&atilde;o. Se apoia, entre outros, em inspe&ccedil;&otilde;es de c&oacute;digo e testes de software.
										
										              
										              Valida&ccedil;&atilde;o:
										averiguar se est&aacute; construindo o produto
										CERTO
										, ou seja, se vai de encontro com as necessidades do cliente. Se apoia, por exemplo,&nbsp; na valida&ccedil;&atilde;o por parte do cliente e na inspe&ccedil;&atilde;o de especifica&ccedil;&otilde;es de software (esta evita ambiguidades, incompleteza, etc).
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 12
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									SANDRA REBOU&Ccedil;AS
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										01) Verifica&ccedil;&atilde;o: Refere-se ao conjunto de atividades que garantem que o SW implementa CORRETAMENTE as fun&ccedil;&otilde;es especificadas.
										
										              
										"Estamos construindo o produto corretamente? "
										
										              
										Na verifica&ccedil;&atilde;o eu comparo o que estou implementando com o que foi especificado.
										
										              
										              
										Valida&ccedil;&atilde;o: Conjunto de atividades que busca garantir que o SW construido implementa o que o cliente desejava.
										
										&nbsp;
										
										"Estamos construindo o produto correto?"
										
										              
										Na valida&ccedil;&atilde;o eu comparo o que estou implementando com o que o usu&aacute;rio solicitou.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q10">
<p class="enunciado">10. 
          No que diz  respeito aos sistemas de
software,o objetivo do  teste &eacute; encontrar erros, sendo um  teste aquele que  tem alta  probabilidade  de  encontrar  um  erro.  Assim,  um  engenheiro  de
softwaredeve projetar  e  implementar  um  sistema ou um  produto  baseado  em  computador  com  &ldquo;testabilidade&rdquo;  em  mente.  Ao  mesmo  tempo,  os  testes  devem  exibir  um  conjunto de caracter&iacute;sticas que atinge o objetivo de encontrar  a maioria  dos  erros  com  um m&iacute;nimo  de  esfor&ccedil;o. Dentre  as  caracter&iacute;sticas que  levam a um
softwaretest&aacute;vel, uma pode  ser  resumida  pela  frase
&ldquo;Quanto  melhor  funciona,  mas  eficientemente pode ser testado&rdquo;.Se um sistema &eacute; projetado  e  implementado  com qualidade  em mente, poucos defeitos  v&atilde;o bloquear a execu&ccedil;&atilde;o dos  testes, permitindo que o  teste  progrida  sem  problemas.  Essa  caracter&iacute;stica  &eacute;  definida  como:
</p>
<ul class="opcoes">
<li correta="nao">a) estabilidade.</li>
<li correta="nao">b) simplicidade.</li>
<li correta="sim">c) operabilidade.</li>
<li correta="nao">d) controlabilidade.</li>
<li correta="nao">e) observabilidade.</li>
</ul>
<div class="coment10"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 35
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Thiago Brito
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              &ldquo;Quanto melhor funciona, mas eficientemente pode ser testado&rdquo;
										              
										Ao inves de "mas" eu creio que seria "mais".
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 38
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Black Soul
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Thiago, voc&ecirc; est&aacute; correto. &Eacute; "mais" mesmo
										
										              
										              Operabilidade
										: "Quanto melhor funcionar, MAIS eficientemente pode ser testado." Se um sistema for projetado e implementado tendo em mente a qualidade, haver&aacute; poucos defeitos bloqueando a execu&ccedil;&atilde;o dos testes, permitindo que o teste ocorra sem sobressaltos.
										
										              
										Ref: Roger S. Pressman
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 39
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Saulo Guerra
									h&aacute; aproximadamente 1 ano.
								
								          
									            
									            Operabilidade: quanto melhor funciona, mais eficientemente pode ser testado.
									            
										              
										Observabilidade: o que voc&ecirc; v&ecirc; &eacute; o que voc&ecirc; testa.
									
									            
										              
										Controlabilidade: quanto melhor voc&ecirc; pode controlar o software, mais o teste pode ser automatizado e otimizado.
									
									            
										              
										Decomponibilidade: controlando o escopo do teste, podemos isolar problemas mais rapidamente e realizar retestagemmais racionalmente.
										
										              
										Simplicidade: quanto menos houver a testar, mais rapidamente podemos test&aacute;-lo.
										
										              
										Estabilidade: quanto menos modifica&ccedil;&otilde;es, menos interrup&ccedil;&otilde;es no teste.
										
										              
										Compreemsibilidade: quanto mais informa&ccedil;&otilde;es temos, mais racionalmente vamos testar.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 7
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eder Ribeiro Ferreira
									h&aacute; aproximadamente 1 ano.
								
								          
									            Os conceitos citados nos coment&aacute;rios acima podem ser encontrados na p&aacute;gina 429 do livro do Pressman 7a edi&ccedil;&atilde;o.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 1
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									carloscjmc
									h&aacute; 2 meses.
								
								          
									            
										outro erro bobo, mas n&atilde;o &eacute; funciona e sim funcionaR
										
										s&atilde;o coisas bobas, mas na hora da prova, se voc&ecirc; n&atilde;o souber bem, acaba descartando a quest&atilde;o por achar que ela est&aacute; errada, j&aacute; que a desinencia n&atilde;o seria essa. J&aacute; no segundo item trocar mas por mais &eacute; pass&iacute;vel de recursos e anula&ccedil;&atilde;o.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q11">
<p class="enunciado">11. 
          S&atilde;o axiomas em risco
</p>
<ul class="opcoes">
<li correta="nao">a) &Eacute; imposs&iacute;vel testar um programa completamente. Teste de software &eacute; um exerc&iacute;cio baseado em certezas. Quanto menos bugsforem encontrados, mais bugsexistir&atilde;o.</li>
<li correta="nao">b) &Eacute; poss&iacute;vel testar um programa completamente. Teste de software n&atilde;o pode ter riscos. Quanto mais breaksforem encontrados, mais breaksexistir&atilde;o.</li>
<li correta="sim">c) &Eacute; imposs&iacute;vel testar um programa completamente. Teste de software &eacute; um exerc&iacute;cio baseado em risco. Quanto mais bugsforem encontrados, mais bugsexistir&atilde;o.</li>
<li correta="nao">d) &Eacute; imposs&iacute;vel testar um programa que tenha riscos. Teste de software deve ser feito pelos seus desenvolvedores. Todos os bugsencontrados ser&atilde;o consertados.</li>
<li correta="nao">e) &Eacute; imposs&iacute;vel testar um programa parcialmente. Teste de software aplica-se unicamente a ambientes sem risco. Quanto mais bugsforem encontrados, menos bugsexistir&atilde;o.</li>
</ul>
<div class="coment11"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 20
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									T. Renegado
									h&aacute; mais de 2 anos.
								
								          
									            Teoricamnte, &Eacute; poss&iacute;vel testar um programa completamente, como no teste da complexidade ciclom&aacute;tica, onde&nbsp; todos os caminhos independentes de um programa s&atilde;o exercitados.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 13
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leandro Alexandre de Oliveira
									h&aacute; mais de 2 anos.
								
								          
									            Que quest&atilde;o esquisita. Acredito que seja poss&iacute;vel testar um programa completamente. Se for um programa simples ele poder&aacute; ser testado completamente.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 14
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Dirceu Cardoso
									h&aacute; mais de 2 anos.
								
								          
									            
										Concordo com o coment&aacute;rio acima que seja poss&iacute;vel testar completamente um software muito pequeno.&nbsp;
										
										              
										              No entanto, existe alguns principios de teste de software (axiomas como se refere o enunciado da quest&atilde;o), e um deles &eacute;:&nbsp;
										              
											                &Eacute; imposs&iacute;vel testar um programa completamente.
										              
										              
										              
										uma boa refer&ecirc;ncia sobre essa quest&atilde;o est&aacute; em:&nbsp;
										http://blog.prasabermais.com/2011/07/10/axiomas-sobre-os-testes-de-software/
										              
										              
										              
											                Descri&ccedil;&otilde;es desse princ&iacute;pio:
										              
										              
										              
										              
											                
												                  Teste Exaustivo n&atilde;o s&atilde;o poss&iacute;veis.
											                
										              
										              
										A quantidade de permuta&ccedil;&otilde;es de caminhos, mesmo para um programa de tamanho moderado, &eacute; excepionalmente grande. Por essa raz&atilde;o,
										&nbsp;&eacute; imposs&iacute;vel &nbsp;executar todas as combina&ccedil;&otilde;es de caminhos durante o teste
										. &Eacute; poss&iacute;vel, no entanto, cobrir adequadamente a l&oacute;gica do programa e garantir que todas as condi&ccedil;&otilde;es do projeto, em n&iacute;vel de componente, tenham sido exercitadas.
										
										              
											                Segundo Pressman (6 edicao - p&aacute;g. 94)
										              
										              
										              
										              
											                Teste completo &eacute; imposs&iacute;vel.
										              
										              
										              
											Testes completo, que cobre todas as combina&ccedil;&otilde;es poss&iacute;veis de dados a fim de assegurar que nenhuma situa&ccedil;&atilde;o n&atilde;o testada possa surgir ap&oacute;s o lan&ccedil;amento do software.
											
												Exceto em aplica&ccedil;&otilde;es extremamente simples, o n&uacute;mero de combina&ccedil;&otilde;es poss&iacute;veis de dados &eacute; proibitivamente alta, &eacute; mais eficaz e eficiente para os testadores
												foco sobre os riscos e prioridades
												, de modo que os testes s&atilde;o direcionados para as necessidades de testes.
											
											                
											(fonte: http://www.knowledgetrain.co.uk/iseb-software-testing-seven-principles.php)
										
										              
										              
										              
											                
												                  Teste nunca pode encontrar 100% dos erros inclu&iacute;dos.
											                
											                
											                Haver&aacute; sempre um resto de erros remanescentes que n&atilde;o pode ser encontrado.
										              
										              
											                Cada tipo de teste vai encontrar um tipo diferente de erros.
										              
										              
										(fonte: http://www.the-software-experts.de/e_dta-sw-test-principles.htm)
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 13
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Luiz Cl&aacute;udio
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              A quest&atilde;o queria tratar os axiomas de teste.
										              
										              
										              Fonte:&nbsp;
										              https://www.cs.drexel.edu/~spiros/teaching/.../*testing*
										              
										              -realities.ppt
										              
										              
										              Software testing axioms
										              
										              
										              
											                1. It is impossible to test a program completely.
										              
										              
										              
											                2. Software testing is a risk-based exercise.
										              
										              
										              3. Testing cannot show the absence of bugs.
										              
										              
											                4. The more bugs you find, the more bugs there are.
										              
										              
										              5. Not all bugs found will be fixed.
										              
										              6. It is difficult to say when a bug is indeed a bug.
										              
										              7. Specifications are never final.
										              
										              8.Software testers are not the most popular members of aproject.
										              
										              9. Software testing is a disciplined and technical profession.
										              
										              
										              Parenthesis:What is an axiom anyway?
										              
										              
										              &amp;bull; An axiom is a sentence or proposition that is not
										              
										              proved or demonstrated and is considered as
										              
										              obvious or as an initial necessary consensus for a
										              
										              theory building or acceptation.
										              
										              
										              &amp;bull; Therefore, it is taken for granted as true, and serves
										              
										              as a starting point for deducing and inferring other
										              
										              
											(theory dependent) truths.
											
											                
											(Resposta dada pelo Thiago na Timasters)
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q12">
<p class="enunciado">12. 
          Em termos de teste de sistemas, s&atilde;o t&eacute;cnicas utilizadas para verificar a opera&ccedil;&atilde;o correta do sistema em rela&ccedil;&atilde;o a casos inv&aacute;lidos ou inesperados de entrada. Trata-se de t&eacute;cnicas
</p>
<ul class="opcoes">
<li correta="nao">a) de Regress&atilde;o.</li>
<li correta="sim">b) n&atilde;o Funcionais.</li>
<li correta="nao">c) da Caixa-cinza.</li>
<li correta="nao">d) da Caixa-branca.</li>
<li correta="nao">e) da Caixa-preta.</li>
</ul>
<div class="coment12"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 49
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									CMCL - Em 2013 essa flecha acertar&aacute; o alvo!!!
									h&aacute; mais de 2 anos.
								
								          
									            
										Puts, errei a quest&atilde;o.&nbsp; N&atilde;o percebi que ele falou de TECNICA, e respondi como se fosse tipo de teste. Coloquei
										da caixa preta
										. letra E)
										
										              
										Pelo que entendi existem duas T&eacute;cnicas de Teste ( Funcionais e N&atilde;o-Funcionais).
										
										              
										A
										T&eacute;cnica funcional
										aborda os seguintes tipos de testes:
										
										- Teste Caixa Branca
										
										- Teste Caixa preta
										
										- Teste Caixa Cinza
										
										- Teste&nbsp; de Regress&atilde;o
										
										              
										A
										T&eacute;cnica n&atilde;o-funcional
										aborda as seguintes:
										
										- Teste&nbsp; de desempenho
										
										- Teste de carga
										
										- Teste de usabilidade
										
										- Teste de confiabilidade
										
										- Teste de recupera&ccedil;&atilde;o
										
										              
										PS: Algu&eacute;m corrija-me se eu estiver errado ou acrescente se necess&aacute;rio.
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 26
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Luiz Cl&aacute;udio
									h&aacute; mais de 2 anos.
								
								          
									            
										Acho que &eacute; isso mesmo.
										
										              
										http://pt.wikipedia.org/wiki/Teste_de_software
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 32
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									RWerneck
									h&aacute; mais de 2 anos.
								
								          
									            
										Pelo que pesquisei, caixa-preta, caixa-branca e caixa-cinza tamb&eacute;m s&atilde;o
										t&eacute;cnicas
										para testar software, mas s&atilde;o
										t&eacute;cnicas funcionais
										.
										
										              
										Em contraste &agrave;s
										t&eacute;cnicas funcionais
										, que verificam a
										opera&ccedil;&atilde;o correta
										do sistema em
										rela&ccedil;&atilde;o a sua especifica&ccedil;&atilde;o
										, as
										t&eacute;cnicas n&atilde;o funcionais
										verificam a
										opera&ccedil;&atilde;o correta
										do sistema
										
											                em rela&ccedil;&atilde;o a casos inv&aacute;lidos ou inesperados de entrada
										              
										. &Eacute; uma forma de testar a
										
											                toler&acirc;ncia
										              
										e a
										
											                robustez
										              
										do software em lidar com o inesperado.
										
										              
										Fonte:
										http://pt.wikipedia.org/wiki/Teste_de_software
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 57
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Josepe
									h&aacute; mais de 2 anos.
								
								          
									            
										Quem errou essa quest&atilde;o estudou pelo Pressman ou Sommerville,
										
										quem acertou estudou pelo Wikipedia (bibliografia fundamental para FCC)
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 27
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Luiz Mendes
									h&aacute; mais de 2 anos.
								
								          
									            Wikipedia bibliografia fundamental para FCC? Que coisa..
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 16
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Wagner
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Eu ainda n&atilde;o consegui classificar os tipos de testes, est&aacute;gios ou n&iacute;veis de testes, t&eacute;cnicas de testes, ... Ora, o que s&atilde;o t&eacute;cnicas para alguns s&atilde;o chamados de tipos de testes para outros; ora &eacute; o inverso. Confesso que estou confuso. A classfica&ccedil;&atilde;o que havia feito at&eacute; esta quest&atilde;o era a seguinte:
										
										              T&eacute;cnicas
										: teste Operacional, teste negativo-positivo, teste de regress&atilde;o, teste de caixa branca, teste de caixa preta, teste alfa, teste beta.
										
										              Tipos de testes
										: teste de benchmark, teste de funcionalidade, teste de confiabilidade, teste de desempenho, teste de suportabilidade, ...
										
										Para mim, as t&eacute;cnicas eram aplicadas para tipos de testes espec&iacute;ficos.
										
										Devido a essa minha classifica&ccedil;&atilde;o, respondi como sendo teste de caixa-preta. Errei!!!
										
										Ap&oacute;s a ler o post do colega acima, concordo que casos inv&aacute;lidos ou inesperados de entrada, validam a robustez e a confiabilidade do sistema em rela&ccedil;&atilde;o a recupera&ccedil;&atilde;o contra erros e falhas e dessa forma n&atilde;o &eacute; um teste para validar requisitos FUNCIONAIS, mas para validar requisitos N&Atilde;O FUNCIONAIS.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 22
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Marcelo Guimaraes
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Essa FCC &eacute; uma praga (1).
										
										              
										Comportamento esperado &eacute; um tipo de requisito funcional.&nbsp;
										
										              
										"O teste caixa-preta tenta encontrar erros nas seguintes categorias:...(4) erros de comportamento ou de desempenho"
										
										Pressman, 7ed, pag 439.
										
										              
										              
										"Os termos teste funcional e teste estrutural s&atilde;o &agrave;s vezes usados em lugar de teste caixa-preta e teste caixa-branca, respectivamente."
										
										Pressman, 7ed, pag 431.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 5.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									J&eacute;ssika Alves "Andar com f&eacute; eu vou, que a f&eacute; n&atilde;o costuma falhar."
									h&aacute; 4 meses.
								
								          
									            Essa &eacute; uma quest&atilde;o que n&atilde;o vale a pena estudar, visto que foi tirada da wikipedia, &eacute; um conceito errado, n&atilde;o baseado em nenhuma literatura de refer&ecirc;ncia como Pressman ou Sommerville. Cabia a anula&ccedil;&atilde;o, com certeza.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 0.00
									
									Votos: 0
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Amanda
									h&aacute; aproximadamente 1 m&ecirc;s.
								
								          
									            
										Assim fica dif&iacute;cial, nem a pr&oacute;pria FCC estabeleceu um crit&eacute;rio para cobrar fases, n&iacute;veis, t&eacute;cnicas, etc. Olhem essa quest&atilde;o:
										
										              
										              Q62908
										A t&eacute;cnica de teste de software, tamb&eacute;m chamada de comportamental, &eacute; a t&eacute;cnica de:
										R
										: Caixa-Preta.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q13">
<p class="enunciado">13. 
          Na dire&ccedil;&atilde;o dos tipos de teste focados pela engenharia de
software, os testes de integra&ccedil;&atilde;o cuidam dos t&oacute;picos associados com os problemas de verifica&ccedil;&atilde;o
</p>
<ul class="opcoes">
<li correta="nao">a) da engenharia de sistemas.</li>
<li correta="sim">b) do projeto do software.</li>
<li correta="nao">c) dos c&oacute;digos de programa.</li>
<li correta="nao">d) dos requisitos funcionais.</li>
<li correta="nao">e) dos requisitos n&atilde;o funcionais.</li>
</ul>
<div class="coment13"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 85
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Manoel Marcondes
									h&aacute; mais de 2 anos.
								
								          
									            
									            &nbsp;Tem uma figura no pressman que explica a evolu&ccedil;&atilde;o dos testes:
									            
										1 - Testes de unidade est&atilde;o associados com o c&oacute;digo fonte
										
										2 - Testes de integra&ccedil;&atilde;o est&atilde;o associados com problemas de projeto
										
										3 - Testes de valida&ccedil;&atilde;o est&atilde;o associados com requisitos
										
										4 - Testes de sistema est&atilde;o associados com a engenharia de sistemas
									
									            [1] Pressman, 6&ordf; edi&ccedil;&atilde;o, Engenharia de Software, pag. 291
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 24
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									JULIANA FERRIS
									h&aacute; mais de 2 anos.
								
								          
									            
										Complementando coment&aacute;rio anterior...
										
										Pressman,
										4&ordf; edi&ccedil;&atilde;o
										, Engenharia de Software,
										pag. 840
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q14">
<p class="enunciado">14. 
          O teste de sistema que for&ccedil;a o software a falhar de diversos modos e verifica o retorno do processamento dentro de um tempo pr&eacute;-estabelecido &eacute; um tipo de teste de
</p>
<ul class="opcoes">
<li correta="nao">a) Integra&ccedil;&atilde;o.</li>
<li correta="nao">b) Estresse.</li>
<li correta="sim">c) Recupera&ccedil;&atilde;o.</li>
<li correta="nao">d) Desempenho.</li>
<li correta="nao">e) Seguran&ccedil;a.</li>
</ul>
<div class="coment14"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 35
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Hitalo
									h&aacute; mais de 3 anos.
								
								          
									            
									            &nbsp;O teste de recupera&ccedil;&atilde;o &eacute; usado para verificar a robustez do software em retornar a um estado est&aacute;vel de execu&ccedil;&atilde;o ap&oacute;s estar em um estado de falha.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 58
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									denispc
									h&aacute; mais de 2 anos.
								
								          
									            
									            
										              Conceito retirado do livro Engenharia de Software, de Roger S. Pressman, 6&ordf; Ed. (p&aacute;gina 306)
									            
									            
										              
											"O
											
												                  teste de recupera&ccedil;&atilde;o
											                
											&eacute; um teste de sistema que for&ccedil;a o software a falhar de diversos modos e verifica se a recupera&ccedil;&atilde;o &eacute; adequadamente realizada... Se a recupera&ccedil;&atilde;o requer interven&ccedil;&atilde;o humana, o tempo m&eacute;dio para reparo &eacute; avaliado para determinar se est&aacute; dentro de limites aceit&aacute;veis."
										
									            
									            
										              Logo, resposta correta, letra c.
									            
									            
										              Espero ter colaborado.
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q15">
<p class="enunciado">15. 
          O teste de software que garante o atendimento aos requisitos, ou seja, que verifica se os requisitos est&atilde;o corretamente codificados, s&atilde;o conhecidos como:
</p>
<ul class="opcoes">
<li correta="nao">a) teste de conformidade.</li>
<li correta="nao">b) teste de requisitos.</li>
<li correta="nao">c) teste caixa-branca.</li>
<li correta="sim">d) teste funcional.</li>
<li correta="nao">e) teste estutural.</li>
</ul>
<div class="coment15"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 26
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Paulo Eduardo Charone Bitar Junior
									h&aacute; mais de 3 anos.
								
								          
									            
									            &nbsp;Retirado do Somerville, cap&iacute;tulo 23 (Testes):
									            "O Sistema &eacute; tratado como uma caixa-presta, cujo o comportamento pode ser somente determinado por meio do estudo de suas entras e sa&iacute;das relacionada. Outro nome para isso &eacute; teste funcional, pois o testado concentra-se na funcionalidade, e n&atilde;o na sua implementa&ccedil;&atilde;o"
									            &nbsp;
									            &nbsp;
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 19
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rodrigo
									h&aacute; mais de 2 anos.
								
								          
									            
									            Discordo do gabarito pelo seguinte: acho que essa parte de "corretamente codificados" descaracteriza o teste funcional, pois este est&aacute; preocupado apenas com entradas e sa&iacute;das e "n&atilde;o se preocupa com a implementa&ccedil;&atilde;o", exatametne como mencionado por Sommerville.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 16
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									CMCL - Em 2013 essa flecha acertar&aacute; o alvo!!!
									h&aacute; mais de 2 anos.
								
								          
									            
										Eu concordo com o Rodrigo. Acho que a quest&atilde;o acabou ficando mal formulada para ter como gabarito o teste funcional/caixa preta. Eu errei a quest&atilde;o achando que seria teste de conformidade.
										
										              
										Vejam esse link: http://www.inpe.br/atifs/html/teste_de_conformidade.htm&nbsp;
										
										              
										N&atilde;o seria isso ai?
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									sergio
									h&aacute; aproximadamente 1 ano.
								
								          
									            Concordo que a quest&atilde;o est&aacute; mal formulada. Tempo de resposta, por exemplo, &eacute; um requisito n&atilde;o verific&aacute;vel no teste funcional.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leonardo Marcelino Teixeira
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Concordo com o gabarito, apesar de tamb&eacute;m ter ficado entre as alternativas a e d.
										
										              
										O que me fez decidir pela D foi exatamente o trecho "os requisitos est&atilde;o corretamente codificados"
										
										Entendi que ao fazer isso est&aacute; verificando se os requisitos foram implementados conforme especificados (verifica&ccedil;&atilde;o).
										
										J&aacute; o teste de conformidade entendi que seria verificar se realmente os requisitos especificados correspondem ao que foi pedido pelo cliente (valida&ccedil;&atilde;o).
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Bruno Marquete da Silva
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Trata-se de
										verifica&ccedil;&atilde;o
										, portanto s&atilde;o testes de caixa-preta ou
										funcionais
										.
										
										Mesmo a quest&atilde;o trazendo a express&atilde;o "est&atilde;o corretamente codificados"&nbsp; - o que pode trazer confus&atilde;o com testes caixa-branca - n&atilde;o &eacute; o caso. Testes de caixa-branca tamb&eacute;m s&atilde;o chamados de estruturais, seria
										
											                imposs&iacute;vel marcar 2 alternativas
										              
										.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 4
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leonardo Andrade
									h&aacute; aproximadamente 1 ano.
								
								          
									            Muitos achismos somente para justificar o gabarito. Um exemplo de teste foi funcional &eacute; o feito com a ferramenta Selenium (para sistemas Web), ele claramente n&atilde;o verifica se o sistema foi codificado corretamente. Tentar justificar isso &eacute; meio sem sentido.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q16">
<p class="enunciado">16. 
          Um crit&eacute;rio de teste de
softwarebaseado no fluxo de dados de aplica&ccedil;&atilde;o pode ser utilizado como uma t&eacute;cnica de teste baseada</p>
<ul class="opcoes">
<li correta="nao">a) na especifica&ccedil;&atilde;o.</li>
<li correta="sim">b) no c&oacute;digo.</li>
<li correta="nao">c) em falhas.</li>
<li correta="nao">d) no uso da aplica&ccedil;&atilde;o.</li>
<li correta="nao">e) na intui&ccedil;&atilde;o e experi&ecirc;ncia do engenheiro.</li>
</ul>
<div class="coment16"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 25
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Alessandro Caldas
									h&aacute; mais de 2 anos.
								
								          
									            
										A t&eacute;cnica de teste de caixa-branca tamb&eacute;m chamada de teste estrutural ou orientado &agrave; l&oacute;gica, avalia o comportamento interno do componente de software. Essa t&eacute;cnica trabalha
										diretamente sobre o c&oacute;digo fonte
										do componente de software para avaliar aspectos tais como: teste de condi&ccedil;&atilde;o,
										teste de fluxo de dados
										, teste de ciclos, teste de caminhos l&oacute;gicos, c&oacute;digos nunca executados.
										
										              
										Fonte:&nbsp;
										http://pt.wikipedia.org/wiki/Teste_de_software
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									RWerneck
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										O m&eacute;todo de teste de fluxo de dados seleciona caminhos de teste de um programa de acordo com a localiza&ccedil;&atilde;o das defini&ccedil;&otilde;es e dos usos das
										vari&aacute;veis
										no programa.
										
										              
										Fonte: Pressman - 6&ordf; edi&ccedil;&atilde;o - p&aacute;g.325
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q17">
<p class="enunciado">17. 
          H&aacute; um tipo de teste que vislumbra a "destrui&ccedil;&atilde;o do programa" por meio de sua submiss&atilde;o a quantidades, frequ&ecirc;ncias ou volumes anormais que &eacute; o teste
</p>
<ul class="opcoes">
<li correta="nao">a) de recupera&ccedil;&atilde;o.</li>
<li correta="nao">b) de configura&ccedil;&atilde;o.</li>
<li correta="nao">c) beta.</li>
<li correta="nao">d) de desempenho.</li>
<li correta="sim">e) de estresse.</li>
</ul>
<div class="coment17"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Fabio Nagamine
									h&aacute; 8 meses.
								
								          
									            
										"Em testes de desempenho, isso significa estressar o sistema, fazendo demandas que estejam fora dos limites de projeto do software. Isso &eacute; conhecido como &acute;
										teste de estresse
										&acute;. Por exemplo, digamos que voc&ecirc; est&aacute; testando um sistema de processamento de transa&ccedil;&otilde;es que &eacute; projetado para processar at&eacute; 300 transa&ccedil;&otilde;es por segundo. Voc&ecirc; come&ccedil;a a testar esse sistema com menos de 300 transa&ccedil;&otilde;es por segundo; ent&atilde;o, aumenta gradualmente a carga no sistema para al&eacute;m de 300 transa&ccedil;&otilde;es por segundo. at&eacute; que esteja bem al&eacute;m da carga m&aacute;xima de projeto do sistema e o sistema falhe." (Engenharia de Software - &nbsp;Sommerville -&nbsp;9a Ed. - Cap&iacute;tulo 8, pg 159)
										
										              
										"Os
										testes por esfor&ccedil;o (estresse)
										servem para colocar os programas em situa&ccedil;&otilde;es anormais. (...) O teste por esfor&ccedil;o usa um sistema de maneira que demande recursos em quantidade, frequencia ou volumes anormais." (Engenharia de Software - Pressman - 7a Ed - Cap&iacute;tulo 17, pg 419)
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q18">
<p class="enunciado">18. 
          Considere as informa&ccedil;&otilde;es abaixo em rela&ccedil;&atilde;o ao desenvolvimento de sistemas:
I. executar um
softwarecom o objetivo de revelar falhas, mas que n&atilde;o prova a exatid&atilde;o do
software.
II. correta constru&ccedil;&atilde;o do produto.
III. constru&ccedil;&atilde;o do produto certo.
Correspondem corretamente a I, II e III, respectivamente,
</p>
<ul class="opcoes">
<li correta="nao">a) valida&ccedil;&atilde;o, verifica&ccedil;&atilde;o e teste.</li>
<li correta="nao">b) verifica&ccedil;&atilde;o, teste e valida&ccedil;&atilde;o.</li>
<li correta="sim">c) teste, verifica&ccedil;&atilde;o e valida&ccedil;&atilde;o.</li>
<li correta="nao">d) valida&ccedil;&atilde;o, teste e verifica&ccedil;&atilde;o.</li>
<li correta="nao">e) teste, valida&ccedil;&atilde;o e verifica&ccedil;&atilde;o.</li>
</ul>
<div class="coment18"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									RWerneck
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              Teste
										-&gt; &eacute; um conjunto de atividades que podem ser planejadas antecipadamente e conduzidas sistematicamente. Uma das caracter&iacute;sticas do teste &eacute;: Um bom teste tem alta probabilidade de encontrar um erro.
										
										              
										              Verifica&ccedil;&atilde;o
										-&gt; refere-se ao conjunto de atividades que garante que o software implementa corretamente uma fun&ccedil;&atilde;o espec&iacute;fica.
										
										              
										              Valida&ccedil;&atilde;o
										-&gt; refere-se a um conjunto de atividades diferente que garante que o software constru&iacute;do corresponde aos requisitos do cliente.
										
										              
										Fonte: Pressman - 4&ordf; edi&ccedil;&atilde;o.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q19">
<p class="enunciado">19. 
          Com refer&ecirc;ncia a testes de software, assinale a op&ccedil;&atilde;o correta.
</p>
<ul class="opcoes">
<li correta="sim">a) Testes de regress&atilde;o s&atilde;o realizados somente durante a manuten&ccedil;&atilde;o do software.</li>
<li correta="nao">b) O teste de integra&ccedil;&atilde;o deve ser realizado logo ap&oacute;s os testes individuais de unidades, obrigatoriamente por equipes diferentes da equipe de desenvolvimento.</li>
<li correta="nao">c) O teste de unidade tem foco na menor unidade de um sistema, um programa. Testes em fun&ccedil;&otilde;es, procedimentos ou m&eacute;todos n&atilde;o s&atilde;o considerados testes de unidade.</li>
<li correta="nao">d) O teste alfa &eacute; conduzido pelo cliente em seu ambiente de uso final.</li>
<li correta="nao">e) Testes de sistema n&atilde;o podem explorar requisitos n&atilde;o funcionais.</li>
</ul>
<div class="coment19"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 18
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Bruno
									h&aacute; mais de 2 anos.
								
								          
									            
									            Completamente errada. O teste de regress&atilde;o podem ser realizadas em outras fases. Quest&atilde;o sem op&ccedil;&atilde;o correta.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Renato
									h&aacute; mais de 2 anos.
								
								          
									            
									            Concordo com o Bruno, tamb&eacute;m n&atilde;o achei nenhuma das alternativas corretas.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									RWerneck
									h&aacute; mais de 2 anos.
								
								          
									            
									            
										Tamb&eacute;m errei a quest&atilde;o, n&atilde;o tinha ouvido falar que o teste de regress&atilde;o era aplicado
										
											                somente
										              
										a
										manuten&ccedil;&atilde;o do sistema
										, mas parece que faz algum sentido sim.
										
										              
										O
										teste de regress&atilde;o
										&eacute; uma t&eacute;cnica do teste de software que consiste na aplica&ccedil;&atilde;o de testes &agrave;
										
											                vers&atilde;o mais recente do software
										              
										, para garantir que n&atilde;o surgiram novos defeitos em
										
											                componentes j&aacute; testados
										              
										. Se, ao juntar o novo componente ou as suas altera&ccedil;&otilde;es com os componentes restantes do sistema surgirem novos defeitos em componentes inalterados, ent&atilde;o considera-se que o sistema regrediu.
										
										              
										Nesse caso, a meu ver, o
										
											                teste de regress&atilde;o
										              
										poderia ser aplicado a
										
											                manuten&ccedil;&atilde;o
										              
										realizada com qualquer finalidade:&nbsp;fazer acr&eacute;scimo de funcionalidade, melhorar desempenho, adaptar o software a um ambiente operacional diferente, ou mesmo corrigir erros encontrados na fase de opera&ccedil;&atilde;o do sistema.
										
										              
										&nbsp;
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 2
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Fernanda  Rigamont
									h&aacute; mais de 2 anos.
								
								          
									            
										b) O teste de integra&ccedil;&atilde;o deve ser realizado logo ap&oacute;s os testes individuais de unidades, obrigatoriamente por equipes diferentes da equipe de desenvolvimento.
										
										              
										c) O teste de unidade tem foco na menor unidade de um sistema, um programa um m&oacute;dulo. Testes em fun&ccedil;&otilde;es, procedimentos ou m&eacute;todos n&atilde;o s&atilde;o considerados testes de unidade.
										
										              
										d) O teste alfa &eacute; conduzido pelo cliente em seu ambiente de uso final.
										
										- Projetista e cliente participam
										
										- &Eacute; simulado o ambiente de produ&ccedil;&atilde;o do cliente
										
										- &Eacute; conduzido nas instala&ccedil;&otilde;es do desenvolvedor com os usu&aacute;rios finais. O desenvolvedor &amp;#39;olhando&amp;#39; sobre os ombros dos usu&aacute;rios e registrando erros e problemas encontrados.
										
										              
										e) Testes de sistema n&atilde;o podem explorar requisitos n&atilde;o funcionais.
										
										O objetivo &eacute; executar o sistema sob o ponto de vista do usu&aacute;rio final, varrendo as funcionalidades em busca de falhas em rela&ccedil;&atilde;o aos objetivos.
										
										Os testes sao executados em condi&ccedil;&otilde;es similares &agrave;quelas que o usu&aacute;ri utilizar&aacute; no seu dia a dia.
										
										S&atilde;o testados requisitos funcionais e n&atilde;o funcionais.
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leandro Alexandre de Oliveira
									h&aacute; mais de 2 anos.
								
								          
									            N&atilde;o consegui identificar uma quest&atilde;o correta.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 1
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Lucas
									h&aacute; 11 meses.
								
								          
									            Quanto &agrave; alternativa d, esse conceito se refere ao teste beta.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 0.00
									
									Votos: 0
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Andr&eacute; Costa
									h&aacute; 6 meses.
								
								          
									            Correta letra (a) : &nbsp;Segundo Pressman, Cada vez que um novo m&oacute;dulo &eacute; adicionado como parte do teste de integra&ccedil;&atilde;o, o software se modifica. Novos caminhos de fluxo de dados s&atilde;o estabelecidos, nova E/S pode ocorrer e nova l&oacute;gica de controle &eacute; acionada. Essas modifica&ccedil;&otilde;es podem causar problemas com fun&ccedil;&otilde;es que previamente funcionavam impecavelmente.... o teste de regress&atilde;o &eacute; a reexecu&ccedil;&atilde;o de algum subconjunto de testes que j&aacute; foi conduzido para garantir que as modifica&ccedil;&otilde;es n&atilde;o propagassem efeitos coletareis indesej&aacute;veis.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 4
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									rafa
									h&aacute; 5 meses.
								
								          
									            Por ELIMINA&Ccedil;&Atilde;O, letra A
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q20">
<p class="enunciado">20. 
          Com rela&ccedil;&atilde;o a t&eacute;cnicas e estrat&eacute;gias de valida&ccedil;&atilde;o para desenvolvimento de sistemas, assinale a op&ccedil;&atilde;o correta.</p>
<ul class="opcoes">
<li correta="nao">a) O teste gama envolve a libera&ccedil;&atilde;o do sistema a uma s&eacute;rie de clientes potenciais que concordam em usar esse sistema.</li>
<li correta="nao">b) O teste alfa, conhecido como teste de aceita&ccedil;&atilde;o, encerra-se quando cliente e projetista concordam que o sistema &eacute; uma implementa&ccedil;&atilde;o aceit&aacute;vel dos requisitos do sistema e n&atilde;o se aplica a sistemas desenvolvidos para um &uacute;nico cliente.</li>
<li correta="sim">c) Aplicado ao final do processo de teste, o teste caixa-preta ou comportamental &eacute; baseado nos requisitos funcionais do software.</li>
<li correta="nao">d) A revis&atilde;o t&eacute;cnica informal &eacute; a mais utilizada para verifica&ccedil;&atilde;o de requisitos e examina a especifica&ccedil;&atilde;o para identificar erros de conte&uacute;do ou de interpreta&ccedil;&atilde;o.</li>
</ul>
<div class="coment20"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 12
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Felipe Guedes
									h&aacute; mais de 2 anos.
								
								          
									            
									            &nbsp;A) est&aacute; falando dos testes Beta
									            B) O erro est&aacute; no final quando ele fala que n&atilde;o se aplica a sistemas de cliente &uacute;nicos
									            C) ok
									            D) Revis&atilde;o T&eacute;cnica Formal
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 5
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									RWerneck
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Segundo
										Pressman (6&ordf; edi&ccedil;&atilde;o - p&aacute;gina 304)
										,
										testes alfa
										e
										beta
										              somente
										s&atilde;o utilizados quando o sistema &eacute; desenvolvido para ser utilizado por
										m&uacute;ltiplos clientes
										.&nbsp;No caso de
										um &uacute;nico cliente
										, utiliza-se o
										teste de aceita&ccedil;&atilde;o
										. Portanto, o erro da alternativa "a" est&aacute; em afirmar que
										o teste alfa &eacute; conhecido como teste de aceita&ccedil;&atilde;o
										. O conceitos s&atilde;o diferentes.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q21">
<p class="enunciado">21. 
          Os testes de integra&ccedil;&atilde;o t&ecirc;m por objetivo verificar se</p>
<ul class="opcoes">
<li correta="nao">a) os m&oacute;dulos testados produzem os mesmos resultados que as unidades testadas individualmente.</li>
<li correta="nao">b) os m&oacute;dulos testados suportam grandes volumes de dados.</li>
<li correta="sim">c) as funcionalidades dos m&oacute;dulos testados atendem aos requisitos.</li>
<li correta="nao">d) os valores limites entre as unidades testadas individualmente s&atilde;o aceit&aacute;veis.</li>
<li correta="nao">e) o tempo de resposta dos m&oacute;dulos testados est&aacute; adequado.</li>
</ul>
<div class="coment21"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 35
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Phoenix
									h&aacute; mais de 3 anos.
								
								          
									            C) CORRETOcomentando as erradas:A) um m&oacute;dulo geralmente cont&eacute;m e engloba as funcionalidades das unidades que o comp&otilde;e, e h&aacute; de se esperar que os resultados sejam diferentes, ou mais completos, do que se fiz&eacute;ssemos os testes individualmente;B) refere-se a testes de carga;C) testes de caixa branca ou caixa preta, e de regress&atilde;o;E) testes de desempenho.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 27
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									scotta
									h&aacute; mais de 3 anos.
								
								          
									            
									            &nbsp;de acordo com a wikip&eacute;dia:
									            
										              
											                Na fase de teste de integra&ccedil;&atilde;o, o objetivo &eacute; encontrar falhas provenientes da integra&ccedil;&atilde;o interna dos componentes de um sistema. Geralmente os tipos de falhas encontradas s&atilde;o de transmiss&atilde;o de dados. Por exemplo, um componente A pode estar aguardando o retorno de um valor X ao executar um m&eacute;todo do componente B; por&eacute;m, B pode retornar um valor Y, gerando uma falha. N&atilde;o faz parte do escopo dessa fase de teste o tratamento de interfaces com outros sistemas (integra&ccedil;&atilde;o entre sistemas). Essas interfaces s&atilde;o testadas na fase de teste de sistema, apesar de, a crit&eacute;rio do gerente de projeto, estas interfaces podem ser testadas mesmo antes de o sistema estar plenamente constru&iacute;do.
										              
									            
									            sendo assim, n&atilde;o parece mais coerente a resposta A?
									            &nbsp;
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 28
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Manoel Marcondes
									h&aacute; mais de 2 anos.
								
								          
									            
									            Tendo em vista que as duas &uacute;nicas alternativas que causam problemas, dado sua similaridade, s&atilde;o a letra A e C vou coment&aacute;-las:
									            A) Um m&oacute;dulo n&atilde;o pode apresentar o mesmo resultado que suas unidades testadas individualmente, at&eacute; porque esses resultados individuais ser&atilde;o computados pelo m&oacute;dulo que ir&aacute; apresentar seu pr&oacute;prio resultado. O que podemos entender de forma err&ocirc;nea &eacute; que os m&oacute;dulos precisam apresentar resultados corretos assim como as unidades apresentam resultados corretos, mas n&atilde;o &eacute; isso que a alternativa nos apresenta.
									            C) Se um m&oacute;dulo &eacute; testado e apresenta os resultados sem nenhum erro podemos dizer que esse m&oacute;dulo atende aos requisitos de sua responsabilidade.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 14
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Lucienne
									h&aacute; mais de 2 anos.
								
								          
									            N&atilde;o seriam os testes de valida&ccedil;&atilde;o que testariam a conformidade com os requisitos??
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 11
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leandro Alexandre de Oliveira
									h&aacute; mais de 2 anos.
								
								          
									            "As funcionalidades dos m&oacute;dulos testados atendem aos requisitos" n&atilde;o seriam testes de unidades?
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 17
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Marcelo Guimaraes
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										"O teste de integra&ccedil;&atilde;o &eacute; uma t&eacute;cnica para descobrir erros associados com as interfaces"
										
										Pressman, 7ed, pag 409
										
										              
										              
										O mais triste de tudo &eacute; ver gente confirmando essas presepadas da FCC atrav&eacute;s de wikipedia........
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 6
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									friathau
									h&aacute; 8 meses.
								
								          
									            
									            
										              Teste de integra&ccedil;&atilde;o
										&eacute; uma tecnica sistem&aacute;tica para construir a arquitetura do software enquanto,&nbsp;ao mesmo tempo, conduz testes para descobrir erros associados as interfaces.&nbsp;Pressman, 6 ed. p. 297
										
										              
										              Teste de Valida&ccedil;&atilde;o
										: A valida&ccedil;&atilde;o do software e conseguida por interm&eacute;dio de uma s&eacute;rie de testes que demonstram&nbsp;conformidade com os requisitos. Pressman, 6 ed. p. 304
									
									            
										              
										              O sentido de interface do Pressman s&atilde;o as intefaces dos m&oacute;dulos que est&atilde;o sendo integrados. A letra C tem mais a ver com teste de valida&ccedil;&atilde;o.
										              
										Para mim &eacute; a letra A.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 7
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rodrigo
									h&aacute; 6 meses.
								
								          
									            
										A verdade &eacute; &nbsp;que n&atilde;o existe concenso nenhum entro os autores, cada um utiliza a nomenclatura que bem entender e alem disso definem testes com nomes diferente para confundir nossa cabe&ccedil;a. Esse assunto deveria ser &nbsp;estudado por apenas uma bibliografia e a banca deveria definir isso no edital, eh um absurdo oque os examinadores fazem com essa "margem" que as bancas d&atilde;o, parece um circo, cada um utilizando a refer&ecirc;ncia que quiser.&nbsp;
										
										              
										Enquanto Sommerville define testes de componentes, Pressman trata do mesmo teste com outra nomenclatura - teste de integra&ccedil;&atilde;o - ... Sommerville define testes de usu&aacute;rio ( alfa, beta e de aceita&ccedil;&atilde;o , alfa - usuarios junto com desenvolvedores em sistema em desenvolvimento, beta - quando release antecipado &eacute; disponibilizado para o cliente ) enquanto Pressman diz que os testes alfa e beta s&atilde;o testes de aceita&ccedil;&atilde;o. Pelo menos aqui ambos falam em testes de usu&aacute;rio. &nbsp;Sommerville define testes de sistemas da seguinte maneira: " Teste de sistema, em que alguns ou todos os componentes de um sistema est&atilde;o integrados e o sistema &eacute; testado como um todo. O teste de sistema deve centrar-se em testar as intera&ccedil;&otilde;es entre os componentes". Com essa defini&ccedil;&atilde;o &eacute; muito f&aacute;cil vc se confundir com os testes de integra&ccedil;&atilde;o definidos pelo Pressman.
										
										              
										No quesito Verifica&ccedil;&atilde;o e valida&ccedil;&atilde;o ent&atilde;o a confus&atilde;o &eacute; geral. Segundo Sommerville o primeiro est&aacute; relacionado com a efic&aacute;cia e o segundo com a efici&ecirc;ncia. O primeiro &eacute; mais geral e verifica se o software atendeu as necessidades do cliente, ou seja, se construiu o produto certo , enquanto que o segundo fala em atendimento dos "requisitos n&atilde;o funcionais" dos usu&aacute;rio, ou seja, se o produto atende as exigencias de perfomance, confiabilidade e etc, &nbsp;logo, eficiencia. Por isso, DISCORDO do coment&aacute;rio anterior que diz que a VALIDA&Ccedil;&Acirc;O &eacute; o atendimento dos requisitos.... acho que seria mais adequado falar em atendimento das necessidades dos usu&aacute;rios ou em efic&aacute;cia.. &nbsp;e para fechar, temos um show de testes de performance, que pelo ponto de vista do Sommerville, este trata como "teste de desempenho" e dentro desta categoria ainda fala do teste de estresse, ou seja, o teste de estresse &eacute; um tipo de teste de desempenho.. J&aacute; o Presman entende que todos s&atilde;o subitens dos testes de sistemas. Dentro dessa categoria temos, (i) testes de recupera&ccedil;&atilde;o, (ii) testes de seguran&ccedil;a, (iii) teste de estresse e (iv) testes de desempenho, ou seja, na vis&atilde;o deste autor o teste de estresse &eacute; um e o de desempenho &eacute; outro. Este &uacute;ltimo tem o objetivo de testar o sitema em execu&ccedil;&atilde;o enquanto o primeiro &eacute; de levar o sistema ao limite e evidenciar falhas... &nbsp;enfim,&nbsp;
										
										              
										tudo isso que eu citei geram uma s&eacute;rie de d&uacute;vidas e ambiguidades. Sem d&uacute;vida as limita&ccedil;&otilde;es da nossa liinguagem atrapalham e muito dificultando bastante. Enfim, minha dica &eacute; que estudem por ambos, tentem pegar as nu&acirc;ncias de cada tipo de teste e de&ecirc;m sim uma olhada na wikipedia antes da prova pois la tem um apanhado geral dos principais testes e o bom &eacute; que tem conceitos dos v&aacute;rios autores.&nbsp;
										
										              
										Quanto a quest&atilde;o, concordo com o gabarito.
										
										              
										Abcs
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eduardo Jorge dos Santos Cordeiro
									h&aacute; 2 meses.
								
								          
									            Simplesmente as duas quest&otilde;es est&atilde;o certas, pois conforme comentaram, n&atilde;o existe converg&ecirc;ncia de ideias sobre os autores, por&eacute;m se analisar bem, a quest&atilde;o C est&aacute; mais correta do que a quest&atilde;o A.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q22">
<p class="enunciado">22. 
          Sobre os processos de teste de software, considere:
I. Em um processo de desenvolvimento iterativo, o teste de sistema concentra-se no teste de um incremento que ser&aacute; entregue ao cliente.
II. No teste de integra&ccedil;&atilde;o &eacute; feito o planejamento de uma s&eacute;rie de testes em que a carga &eacute; constantemente aumentada at&eacute; que o desempenho do sistema torne-se aceit&aacute;vel.
III. A &uacute;nica meta do teste de software &eacute; descobrir falhas ou defeitos no software que apresenta comportamento incorreto, n&atilde;o desej&aacute;vel ou em n&atilde;o conformidade com sua especifica&ccedil;&atilde;o.
Est&aacute; correto o que consta em
</p>
<ul class="opcoes">
<li correta="sim">a) I, apenas.</li>
<li correta="nao">b) I, II e III.</li>
<li correta="nao">c) I e II, apenas.</li>
<li correta="nao">d) II e III, apenas.</li>
<li correta="nao">e) III, apenas.</li>
</ul>
<div class="coment22"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 35
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Saia da Matrix. Assita: http://www.youtube.com/watch?v=YnQb58BoBQw
									h&aacute; mais de 3 anos.
								
								          
									            I - Cada incremento do desenvolvimento iterativo gera um produto que j&aacute; poder&aacute; ser utilizado pelo cliente. Portanto, pass&iacute;vel de sofrer o teste do sistema (teste do conjunto). Alem do teste do sistema temos testes unit&aacute;rios e testes de intera&ccedil;&atilde;o. Lembre-se tamb&eacute;m que no desenvolvimento por prototipagem, os prot&oacute;tipos parciais n&atilde;o s&atilde;o us&aacute;veis. S&atilde;o por exemplos, telas sem m&eacute;todos associados (s&oacute; a casca :))II-O teste descrito &eacute; o teste de estresseII-Os testes tamb&eacute;m s&atilde;o &uacute;teis para comprovar que o software faz aquilo que deve ser feito.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 20
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rafael Concurseiro
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										De acordo com Sommerville 8a edi&ccedil;&atilde;o cap. 23:
										
										              
										Item I:
										
										O teste de sistema envolve a integra&ccedil;&atilde;o de dois ou mais componentes que implementam fun&ccedil;&otilde;es ou carac-ter&iacute;sticas do sistema e depois o teste desse sistema integrado.
										Em um processo de desenvolvimento iterativo, o teste de sistema concentra-se no teste de um incremento que ser&aacute; entregue ao cliente
										; em um processo em cascata, o teste de sistema concentra-se no teste de todo o sistema.
										
										              
										Item II:
										
										              
											                Os testes de desempenho
										              
										devem ser projetados para assegurar que o sistema pode operar na carga necess&aacute;ria. Isso envolve, geralmente, o planejamento de uma s&eacute;rie de testes em que a carga &eacute; constantemente aumentada at&eacute; que o desempenho se torne
										
											                inaceit&aacute;vel
										              
										.
										
										              
										Item III:
										
										Conforme expliquei no Cap&iacute;tulo 22, o processo de teste de software
										
											                tem duas metas
										              
										distintas:
										
										1.
										Demonstrar ao desenvolvedor e ao cliente que o software atende aos requisitos
										. (..)
										
										2.
										Descobrir falhas ou defeitos no software que apresenta comportamento incorreto, n&atilde;o desej&aacute;vel ou em n&atilde;o conformidade com sua especifica&ccedil;&atilde;o
										. (..)
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q23">
<p class="enunciado">23. 
          No contexto da estrat&eacute;gia para o teste de um projeto, os est&aacute;gios de teste desempenham um papel importante. O teste que &eacute; aplicado a componentes do modelo de implementa&ccedil;&atilde;o para verificar se os fluxos de controle e de dados est&atilde;o cobertos e funcionam conforme o esperado, &eacute; o teste
</p>
<ul class="opcoes">
<li correta="nao">a) do desenvolvedor.</li>
<li correta="nao">b) independente.</li>
<li correta="nao">c) de integra&ccedil;&atilde;o.</li>
<li correta="nao">d) de sistema.</li>
<li correta="sim">e) unit&aacute;rio.</li>
</ul>
<div class="coment23"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 38
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Manoel Marcondes
									h&aacute; mais de 2 anos.
								
								          
									            
									            &nbsp;Essa quest&atilde;o &eacute; um tanto controversa, j&aacute; que em uma grande quantidade de quest&otilde;es que cita componentes o teste comentado &eacute; o de integra&ccedil;&atilde;o. Mas, n&atilde;o podemos nos deixar induzir por apenas uma palavra do enunciado nos levar a conclus&otilde;es err&ocirc;neas. Fiz um breve resumo dos coment&aacute;rios lidos no TIMasters sobre essa quest&atilde;o:
									            
										Primeiro temos um conceito para eliminar a solu&ccedil;&atilde;o direta:&nbsp;O teste de unidade focaliza o esfor&ccedil;o de verifica&ccedil;&atilde;o na
										menor unidade de&nbsp;projeto do software
										- o
										componente
										ou
										m&oacute;dulo de software
										. [2]
									
									            Tendo em vista que componentes tamb&eacute;m est&atilde;o associados a testes de unidade, porque n&atilde;o poderia ser tamb&eacute;m teste de integra&ccedil;&atilde;o. Podemos perceber que a quest&atilde;o trata de testes de muito baixo n&iacute;vel como fluxos de controle e de dados, onde podemos relacion&aacute;-los com testes do pr&oacute;prio c&oacute;digo do componente, ou seja, testes de unidade.
									            Os testes de integra&ccedil;&atilde;o, tamb&eacute;m relacionados a testes de componentes do software, s&atilde;o bem mais alto n&iacute;vel e s&atilde;o efetuados entre as comunica&ccedil;&otilde;es existentes entre componentes do sistema e n&atilde;o fluxos internos do componente. Esses testes est&atilde;o mais relacionados com as sa&iacute;das que os componentes apresentam uns para os outros.
									            Tendo em vista esses conceitos de testes de unidade e de integra&ccedil;&atilde;o, podemos perceber uma estrita rela&ccedil;&atilde;o com os testes de caixa branca e de caixa preta, respectivamente.
									            &nbsp;
									            [1] TIMasters
									            [2]&nbsp;Pressman, 6a ed. pag 295
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q24">
<p class="enunciado">24. 
          N&Atilde;O se trata de uma categoria de erros encontrados por meio de teste caixa-preta:</p>
<ul class="opcoes">
<li correta="sim">a) Conjunto b&aacute;sico de caminhos de execu&ccedil;&atilde;o.</li>
<li correta="nao">b) Fun&ccedil;&otilde;es incorretas ou omitidas.</li>
<li correta="nao">c) Acesso &agrave; base de dados externa.</li>
<li correta="nao">d) Comportamento ou desempenho.</li>
<li correta="nao">e) Inicia&ccedil;&atilde;o e t&eacute;rmino.</li>
</ul>
<div class="coment24"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 27
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									CHE
									h&aacute; mais de 3 anos.
								
								          
									            Testes de caminho b&aacute;sico &eacute; uma t&eacute;cnica de caixa branca, e possibilita que o projetista do caso de teste derive uma medida da complexidade l&oacute;gica de um projeto procedimental e use essa medida como guia para definir um conjunto b&aacute;sico de caminhos de execu&ccedil;&atilde;o.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 19
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									T. Renegado
									h&aacute; mais de 2 anos.
								
								          
									            
										S&oacute; complementando
										
										              
										Isso est&aacute; relacionado ao teste de McCabe, ou teste do caminho b&aacute;sico, que deve executar um conjunto b&aacute;sico do programa.
										
										              
										Um caminho b&aacute;sico &eacute; o conjunto de caminhos de execu&ccedil;&atilde;o em que um programa executa cada um de seus comandos pelo menos uma vez, e as condicionais s&atilde;o executadas tanto quando for verdadeiro quanto quando for falso.
										
										              
										Um caminho independente &eacute; um caminho que introduza um novo conjunto de comandos, ou uma condicional, em sua execu&ccedil;&atilde;o.
										
										              
										              
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 2
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Amanda
									h&aacute; 2 meses.
								
								          
									            
										Segundo Pressman,
										o teste caixa-preta tenta encontrar erros nas seguintes categorias: (1)Fun&ccedil;&otilde;es incorretas ou faltando, (2)Erros de interface, (3)Erros em estruturas de dados ou acesso a base de dados externas, (4)Erros de comportamento ou desempenho, (5)Erros de inicializa&ccedil;&atilde;o e t&eacute;rmino.
										              
										(
										Fonte
										: Engenharia de Software, 7ed, Pressman, pag 439)
										
										Gabarito letra "
										A
										".
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q25">
<p class="enunciado">25. 
          Uma sistem&aacute;tica para constru&ccedil;&atilde;o da arquitetura do software enquanto, ao mesmo tempo, conduz ao descobrimento de erros associados &agrave;s interfaces &eacute; a estrat&eacute;gia de teste de software denominada de</p>
<ul class="opcoes">
<li correta="nao">a) sistema.</li>
<li correta="nao">b) unidade.</li>
<li correta="nao">c) valida&ccedil;&atilde;o.</li>
<li correta="nao">d) arquitetura.</li>
<li correta="sim">e) integra&ccedil;&atilde;o.</li>
</ul>
<div class="coment25"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 37
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									rafaelborba
									h&aacute; mais de 3 anos.
								
								          
									            Integra&ccedil;&atilde;o. Mas a quest&atilde;o est&aacute; esquisita. Integra&ccedil;&atilde;o N&Atilde;O &eacute; uma estrat&eacute;gia de teste de software, mas sim uma FASE do ciclo de vida de teste.O examinador poderia ter tomado mais cuidado...
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Marcelo Guimaraes
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										O examinador realmente transcreveu PORCAMENTE uma passagem do pressman:
										
										              
										"O teste de integra&ccedil;&atilde;o &eacute; uma t&eacute;cnica sistem&aacute;tica para construir a arquitetura de software ao mesmo tempo que conduz testes para descobrir erros associados com as interfaces."
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q26">
<p class="enunciado">26. 
          Durante um treinamento para as equipes de desenvolvimento e de testes, um analista transmitiu as orienta&ccedil;&otilde;es a seguir.
I - Para isolar a causa de um erro de software, os desenvolvedores deveriam utilizar a estrat&eacute;gia de depura&ccedil;&atilde;o for&ccedil;a bruta por ser o m&eacute;todo mais eficiente, e, para grandes programas, utilizar a abordagem de rastreamento.
II - Para os testes de integra&ccedil;&atilde;o em sistemas orientados a objetos, poderiam ser utilizadas as estrat&eacute;gias de teste com base no caminho de execu&ccedil;&atilde;o e no uso.
III - Em sistemas orientados a objetos, o teste de sensibilidade poderia ser utilizado para tentar descobrir combina&ccedil;&otilde;es de dados, dentro das classes de entrada v&aacute;lidas, que poderiam causar instabilidade ou processamento inadequado do sistema.
Constitui(em) pr&aacute;tica(s) adequada(s) de estrat&eacute;gias de testes de software a(s) orienta&ccedil;&atilde;o(&otilde;es)
</p>
<ul class="opcoes">
<li correta="nao">a) I, apenas.</li>
<li correta="nao">b) II, apenas.</li>
<li correta="nao">c) I e II, apenas.</li>
<li correta="sim">d) II e III, apenas.</li>
<li correta="nao">e) I, II e III.</li>
</ul>
<div class="coment26"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 20
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Plinio Vieira
									h&aacute; mais de 3 anos.
								
								          
									            Depura&ccedil;&atilde;o for&ccedil;a bruta &eacute; o m&eacute;todo MENOS eficiente.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 29
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Alexandre Paiva
									h&aacute; mais de 3 anos.
								
								          
									            O teste de sensibilidade, exatamente como descrito na op&ccedil;&atilde;o III, &eacute; uma esp&eacute;cie de especializa&ccedil;&atilde;o do teste de Estresse, mas localiza dados sens&iacute;veis (pequeno conjunto que afeta a execu&ccedil;&atilde;o) em vez de achar o ponto do estresse.Op&ccedil;&atilde;o II exatamente como definido por Pressman. Ele tamb&eacute;m cita o teste de agrupamento, que &eacute; uma etapa do teste de integra&ccedil;&atilde;o da OO.For&ccedil;a bruta s&oacute; em &uacute;ltimo caso, n&atilde;o privilegia as t&eacute;cnicas de resolu&ccedil;&atilde;o de problemas. Pode ser inexequ&iacute;vel dependendo do tamanho do software.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q27">
<p class="enunciado">27. 
          O processo de teste repetido continuamente at&eacute; que o cliente e o projetista concordem que a vers&atilde;o liberada seja uma implementa&ccedil;&atilde;o aceit&aacute;vel dos requisitos do sistema desenvolvido sob encomenda de um &uacute;nico cliente &eacute; chamado teste de aceita&ccedil;&atilde;o ou teste</p>
<ul class="opcoes">
<li correta="sim">a) alfa.</li>
<li correta="nao">b) beta.</li>
<li correta="nao">c) de carga.</li>
<li correta="nao">d) em cascata.</li>
<li correta="nao">e) em espiral.</li>
</ul>
<div class="coment27"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 37
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Saia da Matrix. Assita: http://www.youtube.com/watch?v=YnQb58BoBQw
									h&aacute; mais de 3 anos.
								
								          
									            No teste alfa o projetista participa. No teste beta o software est&aacute; no ambiente de produ&ccedil;&atilde;o sendo usado somente pelo cliente que, eventualmente, reporta os problemas ao projetista.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 29
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leonardo
									h&aacute; mais de 3 anos.
								
								          
									            questao que nao esta de acordo com o Pressman, 6 edi&ccedil;ao pagina 304, o teste alfa seria para varios clientes, e nao um unico cliente!!!!!!!
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 21
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									marciah
									h&aacute; mais de 3 anos.
								
								          
									            Teste Alfa n&atilde;o tem a ver com a quantidade de clientes, mas sim com o ambiente em que o teste est&aacute; sendo feito (no caso ambiente de desenvolvimento).
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 17
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Augusto C&eacute;sar Santos
									h&aacute; mais de 2 anos.
								
								          
									            
									            Concordo com marciah, mas essa quest&atilde;o foi tirada do Pressman, no cap&iacute;tulo "Teste de Aceita&ccedil;&atilde;o". Nele, o teste alfa &eacute; feito em um ambiente controlado pelo desenvolvedor e em apenas UM cliente. Diferente do teste alfa, o teste beta, segundo Pressman, &eacute; realizado em um ambiente n&atilde;o controlado pelo desenvolvedor e &eacute; feito em V&Aacute;RIOS clientes.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Reginaldo Gadelha
									h&aacute; mais de 2 anos.
								
								          
									            
										Se o teste &eacute; repetido continuamente significa que ele &eacute; controlado, um teste controlado &eacute; executado at&eacute; a aceita&ccedil;&atilde;o final do cliente, Segundo Pressman as caracteristicas do teste alfa s&atilde;o:
										
										&Eacute; conduzido na instala&ccedil;&atilde;o do desenvolvedor com os usu&aacute;rios
										
										O Software &eacute; usado em um ambiente natural com o desenvolvedor "olhando sobre o ombro" dos usu&aacute;rios t&iacute;picos e registrando erros e problemas de uso.
										
										S&atilde;o conduzido em um ambiente controlado. (Compara&ccedil;&atilde;o com a quest&atilde;o).
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									RWerneck
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Conforme comentou o colega Leonardo,
										
										              
										Segundo os conceitos do Pressman, a
										quantidade de clientes
										tem sim influ&ecirc;ncia nessa defini&ccedil;&atilde;o de
										teste Alfa
										e
										Beta
										. Na
										p&aacute;gina 304
										(Pressman, 6&ordf; edi&ccedil;&atilde;o). Diz o seguinte:
										
										              
										"Quando um software sob encomenda &eacute; constru&iacute;do para
										um cliente
										, uma s&eacute;rie de
										testes de aceita&ccedil;&atilde;o
										&eacute; conduzida para permitir ao cliente validar todos os requisitos. Conduzido pelo usu&aacute;rio final em vez de pelos engenheiros de software, um teste de aceita&ccedil;&atilde;o pode variar de uma "volta de teste" informal para uma s&eacute;rie de testes planejada e executada sistematicamente.(...)"
										
										              
										"Se o software &eacute; desenvolvido como um produto a ser usado por
										v&aacute;rios clientes
										,
										n&atilde;o &eacute; pr&aacute;tico
										realizar
										testes formais de aceita&ccedil;&atilde;o com cada um
										. A maioria dos construtores de produtos de software usa os processos chamados de
										testes alfa
										e
										beta
										para descobrir erros que o
										usu&aacute;rio final
										parece ser capaz de descobrir.(...)"
										
										              
										Essa quest&atilde;o deveria ser
										anulada
										, tendo em vista que ela
										cita explicitamente o n&uacute;mero de clientes (um)
										e NENHUMA das alternativas atende &agrave;s defini&ccedil;&otilde;es acima citadas.&nbsp;
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 11
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rafael Concurseiro
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Examinador tirou essa quest&atilde;o do
										Sommerville
										e n&atilde;o do Pressman. Na p&aacute;gina 53 da 8a edi&ccedil;&atilde;o:
										
										              
										"O teste de aceita&ccedil;&atilde;o &eacute; algumas vezes chamado de teste alfa. Os sistemas sob encomenda s&atilde;o desenvolvidos para um &uacute;nico cliente, o processo de teste alfa continua at&eacute; que o projetista do sistema e o cliente concordem que o sistema liberado &eacute; uma implementa&ccedil;&atilde;o aceit&aacute;vel dos requisitos do sistema."
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 1
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Amanda
									h&aacute; 2 meses.
								
								          
									            
										Gabarito letra "
										A
										". Pra quem quiser saber mais sobre esses dois tipos de teste, segue um pdf com essas defini&ccedil;&otilde;es nas principais bibliografias desse assunto:&nbsp;
										http://pt.scribd.com/doc/151374001/Testes-Alfa-e-Beta
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q28">
<p class="enunciado">28. 
          Um importante aspecto da elabora&ccedil;&atilde;o de casos de testes para um sistema em desenvolvimento &eacute; a escolha dos valores de entrada e das sa&iacute;das previstas dos casos de teste. Escolhas baseadas apenas em valores t&iacute;picos, em geral, s&atilde;o incapazes de revelar todas as falhas da implementa&ccedil;&atilde;o. &Eacute; necess&aacute;rio identificar conjuntos de valores que possuam caracter&iacute;sticas comuns, do ponto de vista das funcionalidades a serem testadas, como, por exemplo, "n&uacute;meros negativos", "n&uacute;meros com mais d&iacute;gitos do que o previsto", "strings sem brancos", "arrays de um s&oacute; elemento", al&eacute;m de prever casos de teste cobrindo a totalidade destes conjuntos, e projetar, para cada conjunto, casos de teste com valores nos limites e pr&oacute;ximos ao ponto m&eacute;dio do conjunto. Esses conjuntos s&atilde;o denominados</p>
<ul class="opcoes">
<li correta="sim">a) parti&ccedil;&otilde;es de equival&ecirc;ncia.</li>
<li correta="nao">b) grupos de controle.</li>
<li correta="nao">c) espa&ccedil;os amostrais.</li>
<li correta="nao">d) classes caracter&iacute;sticas.</li>
<li correta="nao">e) intervalos de testes.</li>
</ul>
<div class="coment28"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 21
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									flaviomosafi
									h&aacute; mais de 3 anos.
								
								          
									            o particionamento por equival&ecirc;ncia &eacute; uma t&eacute;cnica de teste da caixa preta, ele seleciona um dominio de entrada de dados de um programa de classe, a partir dos quais os casos de teste possam ser derivados a fim de realiza&ccedil;&atilde;o das verifica&ccedil;&otilde;es, Existem mais tr&ecirc;s tipos de teste da caixa preta que s&atilde;o: a) causa e efeito; b) valor limite; c) compara&ccedil;&atilde;o
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 22
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									gustavol
									h&aacute; mais de 3 anos.
								
								          
									            Explicando o primeiro coment&aacute;rio, que ficou bem confuso no come&ccedil;o:O particionamento de equival&ecirc;ncia divide o dom&iacute;nio de entrada de um programa em classes de dados, das quais os casos de testes podem ser derivados.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Luciano
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Segundo Pressman:
										
										O p
										articionamento de equival&ecirc;ncia
										&eacute; um m&eacute;todo de teste caixa-preta que divide o dom&iacute;nio de entrada de um programa em classes de dados, das quais os casos de testes podem ser derivados. Ele busca definir um caso de teste que descobre classes de erros, reduzindo assim o n&uacute;mero total de casos de testes que precisam ser desenvolvidos.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q29">
<p class="enunciado">29. 
          
No contexto de engenharia de
software, testes de
softwarepodem ser decompostos numa s&eacute;rie de passos que devem ser executados seq&uuml;encialmente. Considerando a arquitetura de
softwareconvencional, o primeiro passo deve ser o teste de</p>
<ul class="opcoes">
<li correta="nao">a) estresse.</li>
<li correta="nao">b) integra&ccedil;&atilde;o.</li>
<li correta="nao">c) sistema.</li>
<li correta="sim">d) unidade.</li>
<li correta="nao">e) valida&ccedil;&atilde;o.</li>
</ul>
<div class="coment29"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 14
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Paulo Camboim
									h&aacute; mais de 4 anos.
								
								          
									            
										Porque nao a letra E? Alguem poderia responder?
										
										              
										A validacao nao seria primeiro ? Para saber se o projeto esta indo de acordo com o que o cliente queria?
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 16
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									roberta
									h&aacute; mais de 3 anos.
								
								          
									            segundo pressman no seu livro de engenharia de software uma estrat&eacute;gia de teste de software inicia-se com teste unit&aacute;rio, depois progride para o teste de integra&ccedil;&atilde;o, depois valida&ccedil;&atilde;o e por fim o teste de sistema
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 11
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Daniel Ferreira Castro
									h&aacute; mais de 3 anos.
								
								          
									            
									            Primeiro faz-se o teste unit&aacute;rio para saber se o que foi desenvolvido funciona como o que era desejado na etapa de codifica&ccedil;&atilde;o;
									            Depois o teste de integra&ccedil;&atilde;o, para saber se as partes funcionam bem juntas.
									            Em seguida o teste de valida&ccedil;&atilde;o, para identificar se o que est&aacute; integrado condiz com o que era desejado.
									            
										Por fim o teste de sistema que vai testar todo o sistema ap&oacute;s as mudan&ccedil;as introduzidas nas etapas anteriores.
										
										&nbsp;
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q30">
<p class="enunciado">30. 
          
O teste alfa (alpha test) &eacute; conduzido pelo:</p>
<ul class="opcoes">
<li correta="nao">a) cliente, no seu pr&oacute;prio ambiente.</li>
<li correta="sim">b) cliente, no ambiente do desenvolvedor.</li>
<li correta="nao">c) analista de teste, no ambiente do desenvolvedor.</li>
<li correta="nao">d) analista de teste, no seu pr&oacute;prio ambiente.</li>
<li correta="nao">e) desenvolvedor, no seu pr&oacute;prio ambiente.</li>
</ul>
<div class="coment30"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 20
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Ingrid Lotfi
									h&aacute; mais de 4 anos.
								
								          
									            
										Testes Alpha, Beta e Gama.
										
										http://imasters.uol.com.br/artigo/9572/des_de_software/teste_de_software/
										
										              
										Em casos especiais de processos de desenvolvimento de software - Sistemas Operacionais, Sistemas Gerenciadores de Bancos de Dados (SGBD), e outros softwares comerciais disponibilizados no mercado nacional e internacional - os testes requerem fases tamb&eacute;m especiais antes do produto ser disponibilizado a todos os usu&aacute;rios.
										
										              
										O per&iacute;odo entre o t&eacute;rmino do desenvolvimento e a entrega &eacute; conhecido como fase alpha e os testes executados nesse per&iacute;odo, como testes alpha. PRESSMAN afirma que o teste alpha &eacute; conduzido pelo cliente no ambiente do desenvolvedor, com este "olhando sobre o ombro" do usu&aacute;rio e registrando erros e problemas de uso.
										
										Completada a fase alpha de testes, s&atilde;o lan&ccedil;adas a grupos restritos de usu&aacute;rios, vers&otilde;es de teste do sistema denominadas vers&otilde;es beta. O Teste Beta tamb&eacute;m &eacute; um teste de aceita&ccedil;&atilde;o voltado para softwares cuja distribui&ccedil;&atilde;o atingir&aacute; grande n&uacute;mero de usu&aacute;rios de uma ou v&aacute;rias empresas compradoras. PRESSMAN afirma que o teste beta &eacute; conduzido em uma ou mais instala&ccedil;&otilde;es do cliente, pelo usu&aacute;rio final do software. Diferente do teste alpha, o desenvolvedor geralmente n&atilde;o est&aacute; presente. Conseq&uuml;entemente, o teste beta &eacute; uma aplica&ccedil;&atilde;o "ao vivo" do software num ambiente que n&atilde;o pode ser controlado pelo desenvolvedor. O cliente registra todos os problemas (reais ou imagin&aacute;rios) que s&atilde;o encontrados durante o teste beta e os relata ao desenvolvedor em intervalos regulares. Com o resultado dos problemas relatados durante os testes beta, os engenheiros de software fazem modifica&ccedil;&otilde;es e depois se preparam para liberar o produto de software para toda a base de clientes.
										
										              
										Os testes Gama n&atilde;o s&atilde;o propriamente testes de software. A comunidade do teste de software usa este termo de forma sarc&aacute;stica referindo-se aos produtos que s&atilde;o mal testados e s&atilde;o entregues aos usu&aacute;rios ("end-users") para que estes encontrem os defeitos j&aacute; em fase de produ&ccedil;&atilde;o.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 23
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									cd
									h&aacute; mais de 3 anos.
								
								          
									            PRESSMAN afirma que o teste alfa &eacute; conduzido pelo cliente no ambiente do desenvolvedor, com este "olhando sobre o ombro" do usu&aacute;rio e registrando erros e problemas de uso.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
</div>
</body>
</html>
