<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=utf-8">
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script><script src="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.js"></script>
<link rel="stylesheet" href="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.css" type="text/css">
<style type="text/css">
	ul { 
		list-style-type: none; 
		line-height:150%
	}

	ol { 
		line-height:150%
	}
	
	table {
		border-collapse:collapse;
	}
	
	#cabecalho {
		border: 0px solid black;
		text-align:left;
		width:100%;
	}
	
	th, td {
		border: 1px solid black;
		text-align:center;
		padding:1px;
	}

	div
	{
		text-align:justify;
		text-justify:inter-word;
	}

	p {
		line-height:150%
	}
	
	img {
	    height: auto;
	    max-width: 100%;
	}

	div.cabecalho {

	margin: 20px;
    padding: 3px 10px 10px;
    
	}	
	
</style>
</head>
<body>
<h2></h2>
<div class="cabecalho">
<ul>
<li>Universidade FUMEC / Faculdade de Ci&ecirc;ncias Empresariais</li>
</ul>
<ul>
<li>Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o</li>
</ul>
<ul>
<li>Disciplina de
Engenharia de Software
/ Turma
12-7DA / 12-7NA
</li>
</ul>
<ul>
<li>Professor Dr. Fernando Silva Parreiras</li>
</ul>
<ul>
<li>Exercicios de Revisao (
2017-02/cap02-prototipagem
)</li>
</ul>
</div>
<div style="width=100%">
<div class="questao" id="q1">
<p class="enunciado">1. 
          Segundo SOMMERVILLE, um prot&oacute;tipo de software apoia duas  atividades do processo de engenharia de requisitos. S&atilde;o elas:
</p>
<ul class="opcoes">
<li correta="sim">a) levantamento de requisitos e valida&ccedil;&atilde;o de requisitos;</li>
<li correta="nao">b) desenvolvimento incremental e desenvolvimento em espiral;</li>
<li correta="nao">c) especifica&ccedil;&atilde;o de requisitos e depura&ccedil;&atilde;o do software;</li>
<li correta="nao">d) gerenciamento de riscos e plano de testes;</li>
<li correta="nao">e) continuidade nas mudan&ccedil;as e depura&ccedil;&atilde;o do software.</li>
</ul>
<div class="coment1"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									kayto
									h&aacute; 5 meses.
								
								          
									            
										              
											                
												                  Correta: Alternativa A)
											                
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 6
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Breno
									h&aacute; 4 meses.
								
								          
									            
										"
										
											Um prot&oacute;tipo de software pode ser usado em um processo de desenvolvimento de software de v&aacute;rias maneiras:
											
											1. No processo de engenharia de resquisitos, um prot&oacute;tipo pode ajudar na descoberta e valida&ccedil;&atilde;o dos requisitos do sistema.
										
										"
										
										              
										Fonte: Sommerville, Engenharia de Software, 8&ordf; Edi&ccedil;&atilde;o, p&aacute;gina 271
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q2">
<p class="enunciado">2. 
          Em  Engenharia  de  Software,  temos  o  Desenvolvimento em Espiral, cada loop da espiral &eacute;  dividido em quatro setores, a seguir apresentamos  alguns  deles.  Analise  as  assertivas  e  assinale  a  alternativa que apresenta os corretos.
I.  Desenvolvimento  de  integra&ccedil;&atilde;o:  O  software  que  n&atilde;o  puder  ser  comprado  ser&aacute;  desenvolvido, e os componentes e sistemas  COTS  ser&atilde;o  integrados,  a  fim  de  criar  um  sistema.  A  integra&ccedil;&atilde;o  de  sistemas,  nesse  modelo,  pode  ser  parte  do  processo  de  desenvolvimento,  em  vez  de  uma  atividade  separada.
II.  Defini&ccedil;&atilde;o  de  objetivos:  S&atilde;o  definidos  os  objetivos  espec&iacute;ficos  para  essa  fase  do  projeto. S&atilde;o  identificadas as  restri&ccedil;&otilde;es para  o  processo  e  o  produto,  e  &eacute;  preparado  um  plano  de  gerenciamento  detalhado.  S&atilde;o  identificados  os  riscos  do  projeto  e,  dependendo  dos  riscos,  poder&atilde;o  ser  planejadas estrat&eacute;gias alternativas.
III.  Avalia&ccedil;&atilde;o e redu&ccedil;&atilde;o de riscos: Para cada um  dos  riscos  de  projeto  identificados,  &eacute;  realizada  uma  an&aacute;lise  detalhada  e  s&atilde;o  tomadas  provid&ecirc;ncias  para  reduzir  esses  riscos. Por exemplo, se houver um  risco de  os requisitos serem inadequados, poder&aacute; ser  desenvolvido um prot&oacute;tipo.
IV.  Panejamento: O projeto &eacute; revisto e &eacute; tomada  uma decis&atilde;o sobre continuar com o pr&oacute;ximo  loop  da  espiral.  Se  a  decis&atilde;o  for  continuar,  ser&atilde;o  tra&ccedil;ados  os  planos  para  a  pr&oacute;xima  fase do projeto.
</p>
<ul class="opcoes">
<li correta="nao">a) Apenas I e II.</li>
<li correta="sim">b) Apenas II, III e IV.</li>
<li correta="nao">c) Apenas IV.</li>
<li correta="nao">d) Apenas III e IV.</li>
<li correta="nao">e) I, II, III e IV.</li>
</ul>
<div class="coment2"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 17
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Alex  Alves da Silva
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Conforme um artigo encontrado na internet, resumindo o desenvolvimento em Espiral:
										
										no endere&ccedil;o: http://www.linux.ime.usp.br/~cef/mac499-05/monografias/rec/daw/eng_soft.html
										
										DIZ:
										
									            
									            Neste modelo o processo de software &eacute; representado como uma espiral. Cada loop na espiral representa uma fase do processo de software, por exemplo, o loop mais interno pode estar relacionado a viabilidade do sistema. Cada loop &eacute; dividido em 4 setores:
									            
										              Defini&ccedil;&atilde;o de objetivos - S&atilde;o definidos os objetivos para a fase do projeto.
										              Avalia&ccedil;&atilde;o e redu&ccedil;&atilde;o de risco - &eacute; realizada uma an&aacute;lise detalhada para cada risco identificado e s&atilde;o tomadas providencias para reduzir esses riscos.
										              Desenvolvimento e valida&ccedil;&atilde;o - &eacute; escolhido o modelo de desenvolvimento do sistema, e o sistema &eacute; ent&atilde;o desenvolvido e validado.
										              Planejamento - O projeto &eacute; revisto e &eacute; tomada uma decis&atilde;o sobre continuar com o pr&oacute;ximo loop, e se for o caso &eacute; tra&ccedil;ado o planejamento para a pr&oacute;xima fase.
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         Defini&ccedil;&atilde;o de objetivos - S&atilde;o definidos os objetivos para a fase do projeto.
      <br>
<br>
</p>
<p>
         Avalia&ccedil;&atilde;o e redu&ccedil;&atilde;o de risco - &eacute; realizada uma an&aacute;lise detalhada para cada risco identificado e s&atilde;o tomadas providencias para reduzir esses riscos.
      <br>
<br>
</p>
<p>
         Desenvolvimento e valida&ccedil;&atilde;o - &eacute; escolhido o modelo de desenvolvimento do sistema, e o sistema &eacute; ent&atilde;o desenvolvido e validado.
      <br>
<br>
</p>
<p>
         Planejamento - O projeto &eacute; revisto e &eacute; tomada uma decis&atilde;o sobre continuar com o pr&oacute;ximo loop, e se for o caso &eacute; tra&ccedil;ado o planejamento para a pr&oacute;xima fase.
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 11
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									CHE
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Determinar os objetivos, alternativas e restri&ccedil;&otilde;es
										
										&nbsp;-&gt; An&aacute;lise, identifica&ccedil;&atilde;o e resolu&ccedil;&atilde;o de riscos
										
										&nbsp;&nbsp;&nbsp;&nbsp; -&gt; desenvolver e verificar o produto
										
										&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&gt; Planejar a pr&oacute;xima fase (ou ciclo)
										
										&nbsp;&nbsp;&nbsp;&nbsp; N O V O&nbsp; C I C L O
										
										&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&gt; Determinar os objetivos, alternativas e restri&ccedil;&otilde;es
										
										&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&gt; An&aacute;lise, identifica&ccedil;&atilde;o e resolu&ccedil;&atilde;o de riscos
										
										&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp; -&gt; desenvolver e verificar o produto&nbsp;
										
										&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; -&gt; Planejar a pr&oacute;xima fase (ou ciclo)
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Elmano
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										O gabarito est&aacute; errado.
										
										II. Defini&ccedil;&atilde;o de objetivos: S&atilde;o definidos os objetivos espec&iacute;ficos para essa fase do projeto. S&atilde;o identificadas as restri&ccedil;&otilde;es para o processo e o produto, e &eacute; preparado um plano de gerenciamento detalhado.
										S&atilde;o identificados os riscos do projeto e, dependendo dos riscos, poder&atilde;o ser planejadas estrat&eacute;gias alternativas.
										              
										A letra correta deveria ser D.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 4
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leonardo Rizzo
									h&aacute; 11 meses.
								
								          
									            Concordo com o Elmano.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Emanuel Amoras Rodrigues
									h&aacute; 9 meses.
								
								          
									            
										Gabarito Correto, Segundo Sommerville 9&ordm; edi&ccedil;&atilde;o Pag. 33
										
										              
										              
											                
												                  
													                    I - ERRADO,
												                  
											                
										              
										n&atilde;o tem esse setor e sim o
										Desenvolvimento e Valida&ccedil;&atilde;o
										              
										              
										              
											                II - Defini&ccedil;&otilde;es de Objetivos:
										              
										&nbsp; Objetivos especificos para essa fase do projeto s&atilde;o definidos; restri&ccedil;&otilde;es ao processo e ao produto s&atilde;o identificadas, e um plano de gerenciamento detalhado &eacute; elaborado; os riscos do projeto s&atilde;o identificados. Podem ser planejadas estrat&eacute;gias alternativas em fun&ccedil;&atilde;o desses riscos.
										
										              
										              
											                III - Avalia&ccedil;&atilde;o e redu&ccedil;&atilde;o de riscos:
										              
										copia do livro, CORRETO
										
										              
										              
											                IV - Planejamento:
										              
										o projeto &eacute; revisado, e uma decis&atilde;o &eacute; tomada a respeito da continuidade do modelo com mais uma volta da espiral. caso se decida pela continuidade, planos &nbsp;s&atilde;o elaborados para a proxima fase do projeto.
										
										              
										Gabarito LETRA B
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 6
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Sergio Gon&ccedil;alves
									h&aacute; 7 meses.
								
								          
									            
									            Um framework de processo de software dirigido a risco.&nbsp;
									            Cada volta da espiral &eacute; dividida em quatro setores:
									            Defini&ccedil;&atilde;o dos objetivos
									            Avalia&ccedil;&atilde;o e redu&ccedil;&atilde;o de riscos
									            Desenvolvimento e valida&ccedil;&atilde;o
									            Planejamento
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q3">
<p class="enunciado">3. 
          Sobre a Obten&ccedil;&atilde;o de requisitos de um sistema proposto, abaixo analise as assertivas e assinale a alternativa que aponta a(s) correta(s).

I. Fontes de informa&ccedil;&otilde;es durante a fase de obten&ccedil;&atilde;o de requisitos incluem documenta&ccedil;&atilde;o, stakeholders de sistema e especifica&ccedil;&otilde;es de sistemas similares.

II. A intera&ccedil;&atilde;o com os stakeholders neste processo de d&aacute; por meio de entrevistas e observa&ccedil;&otilde;es, podendo ser utilizado cen&aacute;rio e at&eacute; mesmo prot&oacute;tipos para auxiliar nesta obten&ccedil;&atilde;o.

III. Os stakeholders variam de usu&aacute;rios finais do sistema a gerentes e envolvidos externos.

IV. Fontes de requisitos como stakeholders, dom&iacute;nios e outros sistemas podem ser representados como pontos de vista do sistema, em que cada ponto de vista apresenta um subconjunto de requisitos do novo sistema.
</p>
<ul class="opcoes">
<li correta="nao">a) Apenas I e II.</li>
<li correta="nao">b) Apenas I e III.</li>
<li correta="nao">c) Apenas II e III.</li>
<li correta="nao">d) Apenas II, III e IV.</li>
<li correta="sim">e) I, II, III e IV.</li>
</ul>
<div class="coment3"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 16
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									VICTOR  DE ALENCAR JESUS
									h&aacute; aproximadamente 1 ano.
								
								          
									            A alternativa II est&aacute; errada: cen&aacute;rio &eacute; com "C" e n&atilde;o com "S"...rsrsrs... espero que corrijam!
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									LEANDRO MARTINS AGUIAR
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Colegas, aceitei esse item porque tinha 100% de conviccao que a I, II e IV eram corretas, logo so&amp;#39; poderia marcar a letra E
										
										Porem uma duvida me deixou "encasquetado" e pergunto se algum colega poderia me esclarecer.
										
										Na afirmativa III
										
										III. Os stakeholders variam de usu&aacute;rios finais do sistema a gerentes e
										envolvidos externos
										.
										
										O conceito de stakeholders nao estaria relacionado somente envolvidos internos do sistema?
										
										Alguem poderia me esclarecer por favor?
										
										Grato
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 7
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Alexandre Oliveira Silva
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Uma luz para o colega
										LEANDRO MARTINS AGUIAR
										              
										Stakeholder &eacute; qualquer pessoa ou organiza&ccedil;&atilde;o que tenha interesse, ou seja afetado pelo projeto.
										
										A palavra vem de:
									
									            
										              Stake: interesse, participa&ccedil;&atilde;o, risco
										              Holder: aquele que possui
									            
									            Os primeiros stakeholders que imaginamos em um projeto s&atilde;o o Gerente de Projeto, o Patrocinador do Projeto, a Equipe de Projeto e o Cliente. Entretanto, na pr&aacute;tica podem existir muitos outros:
									            
										              A comunidade
										              Outras &aacute;reas da empresa
										              Concorrentes
										              Fornecedores
										              Investidores e acionistas
										              Governo
										              As fam&iacute;lias da equipe de projeto
									            
									Al&eacute;m disso, cada projeto pode ter alguns stakeholders que sejam espec&iacute;ficos para sua realidade, e que n&atilde;o se apliquem a outros projetos.
									
									Fonte: http://ogerente.com/stakeholder/2007/02/23/o-que-e-um-stakeholder/
								
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         Stake: interesse, participa&ccedil;&atilde;o, risco
      <br>
<br>
</p>
<p>
         Holder: aquele que possui
      <br>
<br>
</p>
<p>
         A comunidade
      <br>
<br>
</p>
<p>
         Outras &aacute;reas da empresa
      <br>
<br>
</p>
<p>
         Concorrentes
      <br>
<br>
</p>
<p>
         Fornecedores
      <br>
<br>
</p>
<p>
         Investidores e acionistas
      <br>
<br>
</p>
<p>
         Governo
      <br>
<br>
</p>
<p>
         As fam&iacute;lias da equipe de projeto
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Emanuel Amoras Rodrigues
									h&aacute; 10 meses.
								
								          
									            
										quest&atilde;o
										ctrl+c e ctrl+v &nbsp;
										do &nbsp;livro Engenharia de Software Sommerville 9&ordm; Edi&ccedil;&atilde;o Pag. 72. Descoberta de Requisito.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q4">
<p class="enunciado">4. 
          Com base na metodologia de desenvolvimento din&acirc;mico de sistemas  (DSDM &ndash; Dynamic System Development  Method), analise as afirmativas:
I.
Estudo de viabilidade: estabelece os requisitos b&aacute;sicos e restri&ccedil;&otilde;es do neg&oacute;cio associados &agrave; aplica&ccedil;&atilde;o em  constru&ccedil;&atilde;o e depois avalia se a aplica&ccedil;&atilde;o &eacute; vi&aacute;vel ao processo de desenvolvimento.
II.
Estudo do neg&oacute;cio: estabelece os requisitos funcionais e de informa&ccedil;&atilde;o que permitir&atilde;o &agrave; aplica&ccedil;&atilde;o fornecer valor  ao neg&oacute;cio; tamb&eacute;m define a arquitetura b&aacute;sica da aplica&ccedil;&atilde;o e identifica os requisitos de manutenibilidade para a  aplica&ccedil;&atilde;o.
III.
Itera&ccedil;&atilde;o do modelo funcional: produz um conjunto de prot&oacute;tipos incrementais que demonstram a funcionalidade  para o cliente.
IV.
Itera&ccedil;&atilde;o de projeto e constru&ccedil;&atilde;o: revisita os prot&oacute;tipos constru&iacute;dos durante a itera&ccedil;&atilde;o do modelo funcional para  garantir que cada um tenha passado por engenharia,  de modo que seja capaz de fornecer valor ao neg&oacute;cio  operacional para os usu&aacute;rios finais.
Est&atilde;o corretas apenas as afirmativas:</p>
<ul class="opcoes">
<li correta="sim">a) I, II, III, IV</li>
<li correta="nao">b) I, IV</li>
<li correta="nao">c) II, III, IV</li>
<li correta="nao">d) I, II, III</li>
<li correta="nao">e) I, III, IV</li>
</ul>
<div class="coment4"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 5
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Marco Aur&eacute;lio Americo de Azevedo
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              http://pt.wikipedia.org/wiki/Dynamic_Systems_Development_Method
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 12
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									DANIEL RODRIGUES MONTEIRO
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Essa quest&atilde;o &eacute; copiada integralmente do Pressman.
										
										              
										O DSDM Consortium &eacute; um grupo mundial de empresas que assumiram coletivamente, o papel de "zeladores do m&eacute;todo". O cons&oacute;rcio definiu um modelo &aacute;gil de processo, chamado de ciclo de vida DSDM. O ciclo de vida DSDM define tr&ecirc;s ciclos iterativos diferentes, precedidos por duas atividades adicionais de ciclo de vida:
										
										              
										              Estudo de viabilidade
										: estabelece os requisitos b&aacute;sicos e restri&ccedil;&otilde;es do neg&oacute;cio associados &agrave; aplica&ccedil;&atilde;o em constru&ccedil;&atilde;o e depois avalia se a aplica&ccedil;&atilde;o &eacute; vi&aacute;vel ao processo de desenvolvimento.
										
										              Estudo do neg&oacute;cio
										: estabelece os requisitos funcionais e de informa&ccedil;&atilde;o que permitir&atilde;o &agrave; aplica&ccedil;&atilde;o fornecer valor ao neg&oacute;cio; tamb&eacute;m define a arquitetura b&aacute;sica da aplica&ccedil;&atilde;o e identifica os requisitos de manutenibilidade para a aplica&ccedil;&atilde;o.
										
										              Itera&ccedil;&atilde;o do modelo funcional
										: produz um conjunto de prot&oacute;tipos incrementais que demonstram a funcionalidade para o cliente.
										
										              Itera&ccedil;&atilde;o de projeto e constru&ccedil;&atilde;o
										: revisita os prot&oacute;tipos constru&iacute;dos durante a itera&ccedil;&atilde;o do modelo funcional para garantir que cada um tenha passado por engenharia, de modo que seja capaz de fornecer valor ao neg&oacute;cio operacional para os usu&aacute;rios finais.
										
										              Implementa&ccedil;&atilde;o
										: coloca o &uacute;ltimo incremento de software no ambiente operacional.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 1
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rosa Machado
									h&aacute; 3 meses.
								
								          
									            Pg 68 do Pressman - 6ed
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q5">
<p class="enunciado">5. 
          Metodologias de desenvolvimento de software se baseiam  em um modelo de ciclo de vida, tais como cascata, espiral e  prototipagem; sendo assim, &eacute; correto afirmar que
</p>
<ul class="opcoes">
<li correta="nao">a) metodologias que seguem o modelo em espiral normalmente possuem um maior potencial de risco, uma vez que esse modelo n&atilde;o lida explicitamente com isso.</li>
<li correta="nao">b) metodologias que seguem o modelo de prototipagem devem, necessariamente, descartar os prot&oacute;tipos constru&iacute;dos; dessa forma, essas metodologias costumam ser mais custosas.</li>
<li correta="nao">c) metodologias que seguem o modelo em cascata possuem fases bem definidas, que podem ser desenvolvidas incrementalmente, em diferentes ciclos de desenvolvimento,. Isto &eacute;, a fase seguinte pode ser executada, ainda que a fase anterior n&atilde;o tenha sido finalizada completamente.</li>
<li correta="sim">d) metodologias que seguem o modelo em cascata possuem fases bem definidas e executadas sequencialmente. Al&eacute;m disso, n&atilde;o h&aacute; sobreposi&ccedil;&atilde;o entre as fases, isto &eacute;, a fase seguinte somente pode ser executada ap&oacute;s a finaliza&ccedil;&atilde;o da fase anterior.</li>
<li correta="nao">e) em metodologias que seguem o modelo em espiral, o software &eacute; desenvolvido em apenas uma itera&ccedil;&atilde;o.</li>
</ul>
<div class="coment5"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 12
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Fernanda  Rigamont
									h&aacute; mais de 2 anos.
								
								          
									            
										a) metodologias que seguem o modelo em espiral normalmente possuem um maior menor potencial de risco, uma vez que esse modelo n&atilde;o lida explicitamente com isso.
										
										              
										b) metodologias que seguem o modelo de prototipagem devem, necessariamente, descartar os prot&oacute;tipos constru&iacute;dos; dessa forma, essas metodologias costumam ser mais custosas.
										
										              
										c) metodologias que seguem o modelo em cascata possuem fases bem definidas, que podem ser desenvolvidas incrementalmente, em diferentes ciclos de desenvolvimento,. Isto &eacute;, a fase seguinte pode ser executada, ainda que a fase anterior n&atilde;o tenha sido finalizada completamente.
										
										              
										e) em metodologias que seguem o modelo em espiral, o software &eacute; desenvolvido em apenas uma v&aacute;rias intera&ccedil;&otilde;es&nbsp; itera&ccedil;&atilde;o.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Luciano
									h&aacute; aproximadamente 1 ano.
								
								          
									            N&atilde;o h&aacute; possibilidade de n&atilde;o descartar o prot&oacute;tipo?
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 3
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Glauber
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Luciano disse: "N&atilde;o h&aacute; a possibilidade de se descartar o prot&oacute;tipo?".
										
										              
										Veja:
										
										              
										a prototipa&ccedil;&atilde;o &eacute; uma forma de desenvolvimento incremental e cont&eacute;m quatro tipos diferentes: ilustrativos (telas), simulado (acesso ao BD &eacute; simulado), funcional (subconjunto ilimitado) e evolucion&aacute;rio (come&ccedil;a pequeno e cresce). Podendo ainda ser:
										
										              
										a) explorat&oacute;rio: o cliente e o desenvolvedor trabalham juntos sendo que o processo &eacute; fazer o levantamento de requisitos b&aacute;sico e desenvolver um sistema inicial e ap&oacute;s isto ir incrementando novas funcionalidades ao sistema &nbsp;(a desvantagem &eacute; que o c&oacute;digo fica meio "cocha de retalhos") e
										
										              
										b) prot&oacute;tipos descart&aacute;veis: permite compreender melhor os requisitos do cliente que estejam mal compreendidos atrav&eacute;s do desenvolvimento de prot&oacute;tipos que depois ser&atilde;o descartados.
										
										              
										A fonte, se n&atilde;o me engane &eacute; do Pressman.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q6">
<p class="enunciado">6. 
          Um prot&oacute;tipo de software pode ser usado em um processo de desenvolvimento de software para:
I. Ajudar na descoberta e valida&ccedil;&atilde;o dos requisitos do sistema, durante a engenharia de requisitos.
II. Explorar solu&ccedil;&otilde;es espec&iacute;ficas de software e apoiar o projeto de interface com o usu&aacute;rio, durante o projeto do sistema.
III. Realizar testes completos com o sistema que ser&aacute; entregue para o cliente, durante o processo de teste.
Est&aacute; correto o que se afirma em
</p>
<ul class="opcoes">
<li correta="sim">a) I, II e III.</li>
<li correta="nao">b) II e III, apenas.</li>
<li correta="nao">c) I e II, apenas.</li>
<li correta="nao">d) II, apenas.</li>
<li correta="nao">e) I, apenas.</li>
</ul>
<div class="coment6"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 47
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Saia da Matrix. Assita: http://www.youtube.com/watch?v=YnQb58BoBQw
									h&aacute; mais de 3 anos.
								
								          
									            
									            Com rela&ccedil;&atilde;o &agrave; &uacute;ltima op&ccedil;&atilde;o (III)
									            Resposta de um TiMasters:
									            
										"O problema &eacute; que a vers&atilde;o em portugu&ecirc;s (livro do Sommerville) traduziu "back-to-back" pra
										
										"completo". Na vers&atilde;o em ingl&ecirc;s do Sommerville, tem isso a&iacute;, s&oacute; que no lugar
										
										de "testes completos" tem "back-to-back tests". Mais na frente Sommerville
										
										explica um teste back-to-back:
									
									            
										The same test cases are submitted to the prototype and to the system under
										
										test. If both systems give the same result, the test case has probably not
										
										detected a fault. If the results differ, it may mean that there is a system
										
										fault and the reasons for the difference should be investigated.
									
									            
										Ou seja, um teste back-to-back &eacute; um teste de compara&ccedil;&atilde;o. Coloca os mesmos
										
										inputs no sistema a ser testado e no prot&oacute;tipo, e compara a sa&iacute;da dos dois."
									
									            FCC, como sempre pegando rodap&eacute; de p&aacute;gina, lascou isso na prova!
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 30
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Rogerio Cardoso
									h&aacute; mais de 2 anos.
								
								          
									            
									            &nbsp;Gabarito: A
									            
										Segundo Sommerville:
										
										Um prot&oacute;tipo de software pode ser usado em um processo de desenvolvimento de software de v&aacute;rias maneiras:
										
										1- No processo de engenharia de requisitos, em prot&oacute;tipo pode ajudra na descoberta e valida&ccedil;&atilde;o dos requisitos do sistema.
										
										2- No processo de projeto de sistema, um prot&oacute;tipo pode ser usado para explorar solu&ccedil;&otilde;es espec&iacute;ficas de software e apoiar o projeto de interface com o usu&aacute;rio.
										
										3- No processo de teste, um prot&oacute;tipo pode ser usado para realizar teste completos com sistema que ser&aacute; entregue para o cliente.
									
									            &nbsp;
									            fonte: engenharia de software sommervile p&aacute;gina 271 8&ordm; edi&ccedil;&atilde;o
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 6
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Lucas Vieira Ribeiro
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Um prot&oacute;tipo de software pode ser usado nas seguintes situa&ccedil;&otilde;es:
										
										* No processo de engenharia de requisitos, um prot&oacute;tipo pode ajudar na elicita&ccedil;&atilde;o e valida&ccedil;&atilde;o de requisitos de sistema.
										
										* No processo de projeto de sistema, um prot&oacute;tipo pode ser usado para estudar solu&ccedil;&otilde;es espec&iacute;ficas do software e para apoiar o projeto de interface de usu&aacute;rio.
										
										* Enquanto o sistema est&aacute; em projeto, um prot&oacute;tipo do sistema pode ser usado para a realiza&ccedil;&atilde;o de experimentos de projeto visando &agrave; verifica&ccedil;&atilde;o da viabilidade da proposta.
										
										Obs: O mesmo prot&oacute;tipo n&atilde;o pode cumprir todos os objetivos.
										
										              
										Sommerville, 9&ordf; edi&ccedil;&atilde;o, p&aacute;gina 30
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q7">
<p class="enunciado">7. 
          O XP (Extreme Programming) usa uma abordagem orientada a objetos como seu paradigma de desenvolvimento predileto. Nessa perspectiva, analise as afirmativas abaixo.
I - A atividade de Codifica&ccedil;&atilde;o come&ccedil;a com a cria&ccedil;&atilde;o de um conjunto de hist&oacute;rias que descreve as caracter&iacute;sticas e as funcionalidades requeridas para o software a ser constru&iacute;do.
II - O XP encoraja o uso de cart&otilde;es CRC (Class- Responsibility-Colaborator) como um mecanismo efetivo para raciocinar sobre o software no contexto orientado a objetos.
III - O XP emprega a t&eacute;cnica de refectoring na codifica&ccedil;&atilde;o, mas desaconselha a utiliza&ccedil;&atilde;o da programa&ccedil;&atilde;o por pares.
IV - A cria&ccedil;&atilde;o de testes unit&aacute;rios antes da codifica&ccedil;&atilde;o come&ccedil;ar &eacute; uma pr&aacute;tica do XP.
V - Se um dif&iacute;cil problema de projeto &eacute; encontrado como parte do projeto de uma hist&oacute;ria, o XP recomenda a cria&ccedil;&atilde;o imediata de um prot&oacute;tipo operacional daquela parte do projeto.
Est&atilde;o corretas APENAS as afirmativas
</p>
<ul class="opcoes">
<li correta="nao">a) I, II e IV.</li>
<li correta="nao">b) I, III e IV.</li>
<li correta="nao">c) I, IV e V.</li>
<li correta="nao">d) II, III e V.</li>
<li correta="sim">e) II, IV e V.</li>
</ul>
<div class="coment7"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 35
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									_perdeu
									h&aacute; mais de 3 anos.
								
								          
									            
										A maior duvida deve ficar entre a alterntiva
										"C"
										e
										"E"
										. Existe uma pequena nuance no item I. que diz "
										A atividade de Codifica&ccedil;&atilde;o come&ccedil;a com a cria&ccedil;&atilde;o de um conjunto de hist&oacute;rias
										" Atividade de codifica&ccedil;&atilde;o come&ccedil;a com a escrita de testes. J&aacute; o item III pode ser desconsidera, pois o XP encoraja a programa&ccedil;&atilde;o em pares.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 29
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Wilson
									h&aacute; mais de 3 anos.
								
								          
									            Eu entendo que a op&ccedil;&atilde;o I est&aacute; incorreta porque a cria&ccedil;&atilde;o das est&oacute;rias &eacute; feita anteriormente &agrave; codifica&ccedil;&atilde;o, e n&atilde;o como inicio da mesma. Se observar bem, I e IV s&atilde;o conflitantes pois, se voc&ecirc; come&ccedil;a a testar antes de codificar (e isso est&aacute; correto), n&atilde;o &eacute; poss&iacute;vel escrever os testes se primeiro definir a est&oacute;ria.Assim, I n&atilde;o &eacute; uma afirma&ccedil;&atilde;o verdadeira.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 28
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Henrique
									h&aacute; mais de 2 anos.
								
								          
									            
										I. O conjunto de hist&oacute;rias se desenrola nas atividades de planejamento e projeto, na codifica&ccedil;&atilde;o j&aacute; dever&atilde;o estar prontas.
										
										              
										III. A codifica&ccedil;&atilde;o no XP &eacute; feita atrav&eacute;s da programa&ccedil;&atilde;o em pares.
										
										              
										Demais quest&otilde;es corretas.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 7
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Lucienne
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										              I - A atividade de (
										              
											                
												                  Codifica&ccedil;&atilde;o
											                
										              
										              )
										              Planejamento
										              come&ccedil;a com a cria&ccedil;&atilde;o de um conjunto de hist&oacute;rias que descreve as caracter&iacute;sticas e as funcionalidades requeridas para o software a ser constru&iacute;do.&nbsp;
										              
										              Errado
										.
										O&nbsp;XP envolve um conjunto de regras e pr&aacute;ticas constantes no contexto de quatro atividades metodol&oacute;gicas: Planejamento, Projeto, Codifica&ccedil;&atilde;o e Testes. Na atividade de Planejamento (tamb&eacute;m denominada o jogo do planejamento) &eacute; que s&atilde;o criadas as hist&oacute;rias de usu&aacute;rios. Essas hist&oacute;rias descrevem o resultado, as caracter&iacute;sticas e a funcionalidade para o software a ser constru&iacute;do.
										(pag 88)
										
										              
										              II - O XP encoraja o uso de cart&otilde;es CRC (Class- Responsibility-Colaborator) como um mecanismo efetivo para raciocinar sobre o software no contexto orientado a objetos.
										              
										              Certo
										.
										A XP encoraja o uso de cart&otilde;es CRC como um mecanismo eficaz para pensar sobre o software em um contexto orientado a objetos. Os cart&otilde;es CRC identificam e organizam as classes orientadas a objetos relevantes para o incremento de software corrente. Os cart&otilde;es CRC s&atilde;o o &uacute;nico artefato de projeto produzidos como parte do processo XP.
										(pag 89)
										
										              
										              III - O XP emprega a t&eacute;cnica de refectoring na codifica&ccedil;&atilde;o,&nbsp;(
										              
											                
												                  mas desaconselha
											                
										              
										              )
										              
											                &nbsp;
										              
										              como tamb&eacute;m
										              a utiliza&ccedil;&atilde;o da programa&ccedil;&atilde;o por pares.&nbsp;
										              
										              Errado
										.
										Um conceito-chave na atividade de codifica&ccedil;&atilde;o (e um dos mais discutidos aspectos da XP) &eacute; a programa&ccedil;&atilde;o em dupla. A XP recomenda que duas pessoas trabalhem juntas em uma mesma esta&ccedil;&atilde;o de trabalho para criar c&oacute;digo para uma hist&oacute;ria.
										(pag 90)
										
										              
										              IV - A cria&ccedil;&atilde;o de testes unit&aacute;rios antes da codifica&ccedil;&atilde;o come&ccedil;ar &eacute; uma pr&aacute;tica do XP.
										              
										              Certo
										.
										A cria&ccedil;&atilde;o de testes de unidade, antes de come&ccedil;ar a codifica&ccedil;&atilde;o, &eacute; um elemento-chave da abordagem XP.
										(pag 90)
										
										              
										              V - Se um dif&iacute;cil problema de projeto &eacute; encontrado como parte do projeto de uma hist&oacute;ria, o XP recomenda a cria&ccedil;&atilde;o imediata de um prot&oacute;tipo operacional daquela parte do projeto.
										              
										              Certo
										.
										Se um dif&iacute;cil problema de projeto &eacute; encontrado como parte do projeto de uma hist&oacute;ria, o XP recomenda a cria&ccedil;&atilde;o imediata de um prot&oacute;tipo operacional daquela parte do projeto
										.&nbsp;
										Denominada solu&ccedil;&atilde;o pontual, o prot&oacute;tipo &eacute; implementado e avaliado. O objetivo &eacute; reduzir o risco para quando a verdadeira implementa&ccedil;&atilde;o iniciar e validar as estimativas originais para a hist&oacute;ria contendo o problema de projeto. (
										pag89)
										
										              
										(Fonte: Livro Engenharia de Software 7ed, Pressman)
										
										              
										Logo, gabarito "
										E
										"
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q8">
<p class="enunciado">8. 
           H&aacute; um consider&aacute;vel debate sobre os benef&iacute;cios e a aplicabilidade do desenvolvimento &aacute;gil de software em contraposi&ccedil;&atilde;o aos processos mais convencionais de engenharia de software. Relacione o modelo &aacute;gil de software com a sua respectiva caracter&iacute;stica.
 ModeloI - DAS II - DSDM III - FDD IV - XP
 Caracter&iacute;stica (P)
Define um ciclo de vida que incorpora tr&ecirc;s fases: especula&ccedil;&atilde;o, colabora&ccedil;&atilde;o e aprendizado. Durante a fase de aprendizado, &agrave; medida que os membros de uma equipe come&ccedil;am a desenvolver os componentes que fazem parte de um ciclo adaptativo, a &ecirc;nfase est&aacute; tanto no aprendizado quanto no progresso em dire&ccedil;&atilde;o a um ciclo completo. (Q)
O conceito caracter&iacute;stica &eacute; uma fun&ccedil;&atilde;o valorizada pelo cliente, que pode ser implementada em duas semanas ou menos. Este modelo define seis marcos de refer&ecirc;ncia durante o projeto e implementa&ccedil;&atilde;o de uma caracter&iacute;stica: travessia do projeto, projeto, inspe&ccedil;&atilde;o de projeto, c&oacute;digo, inspe&ccedil;&atilde;o de c&oacute;digo, promo&ccedil;&atilde;o para constru&ccedil;&atilde;o. (R)
Fornece um arcabou&ccedil;o para construir e manter sistemas que satisfazem &agrave;s restri&ccedil;&otilde;es de prazo apertadas por meio do uso de prototipagem incremental em ambiente controlado de projeto. Essa abordagem sugere uma filosofia que &eacute; emprestada de uma vers&atilde;o modificada do princ&iacute;pio de Pareto. A rela&ccedil;&atilde;o correta &eacute;:</p>
<ul class="opcoes">
<li correta="nao">a) I - P, II - Q, III - R.</li>
<li correta="sim">b) I - P, II - R, III - Q.</li>
<li correta="nao">c) I - Q, III - R, IV - P.</li>
<li correta="nao">d) II - P, III - R, IV - Q.</li>
<li correta="nao">e) II - Q, III - P, IV - R.</li>
</ul>
<div class="coment8"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 24
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Gabriel Aquino
									h&aacute; mais de 5 anos.
								
								          
									            S&oacute; uma dica: esta quest&atilde;o &eacute; f&aacute;cil para quem sabe o signigicado da sigla do modelo FDD (Feature Driven Development) ou Desenvolvimento Baseado em Caracter&iacute;stica. O &uacute;nico item que fala de caracter&iacute;stica &eacute; o item III, e s&oacute; existe uma op&ccedil;&atilde;o com III - Q.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 31
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									_perdeu
									h&aacute; mais de 4 anos.
								
								          
									            O Pressman &eacute; uma otima referencia de agile.....pracaba mesmo
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									T. Renegado
									h&aacute; mais de 2 anos.
								
								          
									            
									            
										              FDD ( Feature Driven Development )
									            
									            
										              Foco em desenho e constru&ccedil;&atilde;o
										              Iterativo
										              N&atilde;o existe nenhum processo espec&iacute;fico de modelagem.
										              Resposta r&aacute;pida para mudan&ccedil;as de requisito e de mercado
										              Preocupa&ccedil;&atilde;o com a qualidade, entregas frequentes e tang&iacute;veis
									            
									            Processos
									            
										              Desenvolver um modelo compreens&iacute;vel
										              Construir uma lista de funcionalidades
										              Planejar por funcionalidade
										              Projetar por funcionalidade
										              Construir por funcionalidade
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         Foco em desenho e constru&ccedil;&atilde;o
      <br>
<br>
</p>
<p>
         Iterativo
      <br>
<br>
</p>
<p>
         N&atilde;o existe nenhum processo espec&iacute;fico de modelagem.
      <br>
<br>
</p>
<p>
         Resposta r&aacute;pida para mudan&ccedil;as de requisito e de mercado
      <br>
<br>
</p>
<p>
         Preocupa&ccedil;&atilde;o com a qualidade, entregas frequentes e tang&iacute;veis
      <br>
<br>
</p>
<p>
         Desenvolver um modelo compreens&iacute;vel
      <br>
<br>
</p>
<p>
         Construir uma lista de funcionalidades
      <br>
<br>
</p>
<p>
         Planejar por funcionalidade
      <br>
<br>
</p>
<p>
         Projetar por funcionalidade
      <br>
<br>
</p>
<p>
         Construir por funcionalidade
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 5
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Gabriel  Di Atlanta
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										DAS -
										P
										- Ele define um "ciclo de vida" DAS que incorpora tr&ecirc;s fases: especula&ccedil;&atilde;o, colabora&ccedil;&atilde;o e aprendizagem.
										
										DSDM -
										R
										- Oferece uma metodologia para construir e manter sistemas que atendem restri&ccedil;&otilde;es de prazo apertado, atrav&eacute;s do uso da prototipagem incremental em um ambiente de projeto controlado.
										
										FDD -
										Q
										- funcionalidade &eacute; uma fun&ccedil;&atilde;o valorizada pelo cliente pass&iacute;vel de ser implementada em duas semanas ou menos
										
										              
										Pressman, 7ed, 2011
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q9">
<p class="enunciado">9. 
          Considere as seguintes assertivas sobre modelos te&oacute;ricos de processo de desenvolvimento de software:
I - O modelo em cascata especifica que a defini&ccedil;&atilde;o do comportamento externo do sistema deve preceder o projeto de sua arquitetura;
II - O modelo incremental requer que na primeira fase seja feito primeiro o levantamento de todos os requisitos do sistema;
III - O modelo de prototipa&ccedil;&atilde;o de requisitos consiste na cria&ccedil;&atilde;o de implementa&ccedil;&otilde;es parciais do sistema com o objetivo de conhecer os requisitos do sistema.
Est&atilde;o corretas somente:</p>
<ul class="opcoes">
<li correta="nao">a) I e II</li>
<li correta="nao">b) I e III</li>
<li correta="nao">c) II e III</li>
<li correta="sim">d) I, II e III</li>
<li correta="nao">e) nenhuma</li>
</ul>
<div class="coment9"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 21
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									RAYSON ROMULO COSTA E SILVA
									h&aacute; mais de 4 anos.
								
								          
									            
										A quest&atilde;o pode gerar um pouco de pol&ecirc;mica no item II, onde afirma que TODOS os requisitos devem ser elicitados logo no in&iacute;cio do processo. Sendo que Sommerville afirma que o modelo incremental tem a vantagem de postergar o detalhamento de alguns requisitos para os pr&oacute;ximos incrementos. Afirmando ser esta uma das caracter&iacute;sticas principais dos modelos evolucion&aacute;rios.
										
										Por&eacute;m, o que pode ser adiado &eacute; o DETALHAMENTO de alguns requisitos e n&atilde;o o levantamento de requistos. E por isso o &iacute;tem II est&aacute; correto.
										
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eduardo
									h&aacute; mais de 2 anos.
								
								          
									            
										Discordo completamente. A quest&atilde;o n&atilde;o &eacute; pol&ecirc;mica, ela est&aacute; realmente ERRADA.
										
										Uma das grandes vantagens do modelo incremental &eacute; possibilitar que NOVOS requisitos sejam levantados a cada nova itera&ccedil;&atilde;o, por isso, este modelo n&atilde;o REQUER que primeiro todos requisitos sejam levantados.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 2
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Luciano
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Eu entendo da seguinte forma:
										
										O modelo incremental combina elementos do modelo em cascata aplicado de maneira iterativa.
										
										A cada novo incremento liberado para o cliente, uma nova funcionalidade &eacute; agregada. Diferentemente do modelo evolucion&aacute;rio, em que novos incrementos t&ecirc;m melhorias (evolu&ccedil;&otilde;es) nas funcionalidades j&aacute; implementadas.
										
										O in&iacute;cio de desenvolvimento do incremento-(N+1) n&atilde;o est&aacute; condicionando &agrave; entrega do incremento-N. Os diversos incrementos podem ser desenvolvidos em paralelo. (Pressman, 6a.Ed. p&aacute;g.40)
										
										Deste modo, podemos inferir que todos os requisistos do sistema j&aacute; estejam levantados, pois de outro modo, como poderia iniciar o desenvolvimento do incremento subsequente antes do feedback do usu&aacute;rio relativo ao incremento anterior, se n&atilde;o tenho os requisitos j&aacute; levantados?
										
										              
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
</div>
</body>
</html>
