<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=utf-8">
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script><script src="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.js"></script>
<link rel="stylesheet" href="http://ppg.fumec.br/sigc/wp-content/uploads/2015/10/data2.css" type="text/css">
<style type="text/css">
	ul { 
		list-style-type: none; 
		line-height:150%
	}

	ol { 
		line-height:150%
	}
	
	table {
		border-collapse:collapse;
	}
	
	#cabecalho {
		border: 0px solid black;
		text-align:left;
		width:100%;
	}
	
	th, td {
		border: 1px solid black;
		text-align:center;
		padding:1px;
	}

	div
	{
		text-align:justify;
		text-justify:inter-word;
	}

	p {
		line-height:150%
	}
	
	img {
	    height: auto;
	    max-width: 100%;
	}

	div.cabecalho {

	margin: 20px;
    padding: 3px 10px 10px;
    
	}	
	
</style>
</head>
<body>
<h2></h2>
<div class="cabecalho">
<ul>
<li>Universidade FUMEC / Faculdade de Ci&ecirc;ncias Empresariais</li>
</ul>
<ul>
<li>Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o</li>
</ul>
<ul>
<li>Disciplina de
Engenharia de Software
/ Turma
12-7DA / 12-7NA
</li>
</ul>
<ul>
<li>Professor Dr. Fernando Silva Parreiras</li>
</ul>
<ul>
<li>Exercicios de Revisao (
2017-02/cap09
)</li>
</ul>
</div>
<div style="width=100%">
<div class="questao" id="q1">
<p class="enunciado">1. 
          Em rela&ccedil;&atilde;o &agrave; Refatora&ccedil;&atilde;o, &eacute; INCORRETO afirmar:
</p>
<ul class="opcoes">
<li correta="sim">a) a exist&ecirc;ncia ou n&atilde;o de testes automatizados no software &eacute; irrelevante .</li>
<li correta="nao">b) utiliza fortemente conceitos de orienta&ccedil;&atilde;o a objeto.</li>
<li correta="nao">c) melhora a estrutura interna do c&oacute;digo sem alterar seu comportamento externo.</li>
<li correta="nao">d) evita a deteriora&ccedil;&atilde;o durante o ciclo de vida de um c&oacute;digo.</li>
<li correta="nao">e) incrementa melhoria no entendimento do c&oacute;digo.</li>
</ul>
<div class="coment1"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 11
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Paulo Eduardo
									h&aacute; aproximadamente 1 ano.
								
								          
									            Ap&oacute;s toda atividade de refatora&ccedil;&atilde;o, &eacute; recomend&aacute;vel a execu&ccedil;&atilde;o de testes (de prefer&ecirc;ncia automatizados) a fim de atestar que o comportamento do c&oacute;digo refatorado n&atilde;o mudou.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q2">
<p class="enunciado">2. 
          No &acirc;mbito da Refatora&ccedil;&atilde;o de software, analise as afirmativas a seguir.
I - Introduce Parameter Object &eacute; uma t&eacute;cnica de refatora&ccedil;&atilde;o que pode ser aplicada em m&eacute;todos muito longos.
II - C&oacute;digo duplicado &eacute; candidato para aplica&ccedil;&atilde;o das t&eacute;cnicas Extract Method e Substitute Algorithm.
III - Extract Class &eacute; uma t&eacute;cnica de refatora&ccedil;&atilde;o que pode ser aplicada em classes muito grandes.
Est&aacute;(&atilde;o) correta(s) a(s) afirmativa(s)
</p>
<ul class="opcoes">
<li correta="nao">a) I, apenas.</li>
<li correta="nao">b) II, apenas.</li>
<li correta="nao">c) III, apenas.</li>
<li correta="nao">d) I e II, apenas.</li>
<li correta="sim">e) I, II e III.</li>
</ul>
<div class="coment2"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 14
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Lucas
									h&aacute; mais de 3 anos.
								
								          
									            
									            &nbsp;Algu&eacute;m poderia me explicar essa quest&atilde;o?
									            O Parameter Object, pelo que pesquisei, agrega todos os par&acirc;metros de um m&eacute;todo em uma classe.
									            Na afirmativa I, caberia a t&eacute;cnica Extract Method, que cria um novo m&eacute;todo extraindo um bloco de c&oacute;digo.
									            &nbsp;
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leonardo Marcelino Teixeira
									h&aacute; mais de 2 anos.
								
								          
									            
									            
										              &nbsp;I - Introduce Parameter Object
										, em seu uso, cria-se uma classe imut&aacute;vel que represente o grupo de par&acirc;metros de um ou mais m&eacute;todos. O que valida a quest&atilde;o &eacute; que algumas vezes no corpo do m&eacute;todo h&aacute; estrutras/comportamento usados exclusivamente para manipular os par&acirc;metros. Esses comportamentos podem ser movidos para o objeto de par&acirc;metros.
										
										Fonte:
										Introduce Parameter Object
									            
									            II -&nbsp;
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Marcelo Guimaraes
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Esta questao est&aacute; MUITO errada. Como ng entrou com recurso?!?!
										
										              
										Introduce Parameter Object &eacute; uma tecnica usada quando metodos possuem LISTAS DE PARAMETROS muito longos. E nao m&eacute;todos longos.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 6
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Jos&eacute; Lima
									h&aacute; aproximadamente 1 ano.
								
								          
									            Concordo com Marcelo. Quando o item I fala m&eacute;todos longos, d&aacute; a entender m&eacute;todos com corpo longo, e n&atilde;o a assinatura do m&eacute;todo. Eu entraria com recurso
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Eduardo Neves
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										O primeiro item da quest&atilde;o
										
											                n&atilde;o est&aacute; errado
										              
										.
										
										              
										Na
										explica&ccedil;&atilde;o
										sobre os
										refactorings
										que podem ser
										usados em m&eacute;todos muito longos
										(pag 77, Refactoring, Fowler) ele explica que:
										
										              
										              Quando &eacute; utilizado o Extract Method
										, em m&eacute;todos muito longos,
										pode ocorrer desse novo m&eacute;todo possuir muitos par&acirc;metros e vari&aacute;veis tempor&aacute;rias como par&acirc;metros
										fazendo com que a chamada do m&eacute;todo extra&iacute;do fique t&atilde;o confusa quanto originalmente.
										Nesses casos
										ele
										sugere
										o uso de
										
											Replace Temp With Query,
											Introduce Parameter Object
											e Preserve Whole Object.
										
										              
										              
										Um bom lugar para consulta r&aacute;pida dos padr&otilde;es &eacute;:&nbsp;http://refactoring.com/catalog/
										
										Existe uma descri&ccedil;&atilde;o e um exemplo de utiliza&ccedil;&atilde;o do padr&atilde;o.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 4
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Marcelo Guimaraes
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										@Eduardo,
										
										              
										Voce escreveu:
										
										"pode ocorrer desse novo m&eacute;todo possuir muitos par&acirc;metros e vari&aacute;veis tempor&aacute;rias como par&acirc;metros fazendo com que a chamada do m&eacute;todo extra&iacute;do fique t&atilde;o confusa quanto originalmente. Nesses casos ele sugere o uso de Replace Temp With Query, Introduce Parameter Object e Preserve Whole Object."
										
										              
										Nesta passagem est&aacute; dizendo que ao criar o novo metodo (Extract Method), o mesmo possa necessitar de muitos par&acirc;metros ou variaveis temporarias como parametros. Entendo que isso quer dizer q, a quantidade de parametros a serem passados para este novo metodo fique muito grande e confusa, sendo necessario o uso do Introduce Parameter Object. Nao tem a ver com uso do Introduce Parameter Object &nbsp;para metodos longos, mas sim com o fato de que o novo metodo do Extract Method fique com a lista de parametros enorme.
										
										              
										@Marcelino
										
										              
										Introduce Parameter Object diz:
										
										Often the bodies of the methods have common manipulations of the parameter values. By moving this behavior into the new object, you can remove a lot of duplicated code.
										
										              
										Ou seja, esses parametros sao manipulados por opera&ccedil;&otilde;es dentro desses metodos que, ao utilizar o Introduce Parameter Object, acaba que, por consequencia, voce elimina algumas linhas daquele c&oacute;digo. Isso nao quer dizer q o metodo era longo.
										
										              
										              
										@All
										
										              
										O link do fowler[1] disserta sobre metodos longos dizendo:
										
										              
										" Long lists of parameters can be slimmed down with Introduce Parameter Object and Preserve Whole Object."
										
										              
										[1]http://sourcemaking.com/refactoring/long-method
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 7
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Leonardo Marcelino Teixeira
									h&aacute; aproximadamente 1 ano.
								
								          
									            
										Reanalisando o livro sobre padr&otilde;es de refatora&ccedil;&atilde;o do Fowler, percebi o seguinte:
										
										Na contra capa, h&aacute; uma tabela com os cheiros e as refatora&ccedil;&otilde;es aplic&aacute;veis.
										
										              M&eacute;todo longo
										, p. 71 {
										Extrair m&eacute;todo
										,
										Substituir vari&aacute;vel tempor&aacute;ria por consulta
										,
										Substituir m&eacute;todo por objeto m&eacute;todo
										,
										Decompor condicional
										}
										
										              
										No entanto, na parte que trata sobre os cheiros temos o seguinte:
										
										              M&eacute;todos longos
										:
										
										Em 99% do tempo acplica-se o
										Extrair M&eacute;todo
										.
										
										Voc&ecirc; muitas vezes pode usar
										Substituir vari&aacute;vel tempor&aacute;ria por consulta
										para eliminar as vari&aacute;veis tempor&aacute;rias. Listas longas de par&acirc;metros pode ser diminu&iacute;das com
										Introduzir objeto par&acirc;metro
										e
										Preservar o objeto inteiro
										.
										
										Se voc&ecirc; tentou isso e ainda tem vari&aacute;veis tempor&aacute;rias e par&acirc;metros demais, &eacute; hora de usar a artilharia pesada:
										Substituir m&eacute;todo por objeto m&eacute;todo
										.
										
										...
										
										Condi&ccedil;&otilde;es e la&ccedil;&otilde;s tamb&eacute;m sinalizam extra&ccedil;&otilde;es. Use
										Decompor Condicional
										para lidar com express&otilde;es condicionais.
										
										              
										Ent&atilde;o o examinador percebeu a seguinte possibilidade de derrubar meio mundo (eu incluso nessa):
										
										Se o cara estudar s&oacute; essa tabelinha da contra-capa ao inv&eacute;s de ir l&aacute; dentro do livro, vai levar um ferro daqueles. (
										enquanto ria diabolicamente
										)
										
										              
										E pronto, est&aacute; feita uma quest&atilde;o a l&aacute; cesgranrio.
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 4.00
									
									Votos: 1
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									gustavo ide maciel
									h&aacute; 7 meses.
								
								          
									            
										Eu sabia que a II e a III estavam corretas, como n&atilde;o havia na resposta apenas II e III tive que considerar a I verdadeira tb, apesar de achar que a I est&aacute; errado..
										
										j&aacute; que para mim&nbsp;
										&nbsp;Parameter Object &eacute; para quando existe muitos parametros e n&atilde;o um metodo longo
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q3">
<p class="enunciado">3. 
          O principal sistema de informa&ccedil;&atilde;o de uma empresa, desenvolvido internamente, cont&eacute;m regras de neg&oacute;cio no c&oacute;digo da interface de usu&aacute;rio. Qual a t&eacute;cnica de refatora&ccedil;&atilde;o que o arquiteto de software pode indicar para melhorar consideravelmente o sistema nesse caso?</p>
<ul class="opcoes">
<li correta="nao">a) Tease Apart Inheritance.</li>
<li correta="sim">b) Separate Domain from Presentation.</li>
<li correta="nao">c) Extract Hierarchy.</li>
<li correta="nao">d) Convert Procedural Design to Objects.</li>
<li correta="nao">e) Apply Table Data Gateway Pattern.</li>
</ul>
<div class="coment3"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Gustavo de Almeida Neves
									h&aacute; aproximadamente 1 ano.
								
								          
									            
									            Tease Apart Inheritance quando voc&ecirc; tem uma hierarquia de&nbsp;heran&ccedil;a que realiza dois trabalhos ao mesmo tempo.
									            
										              
										Convert Procedural Design to Objects quando voc&ecirc; tem c&oacute;digo&nbsp;escrito em estilo procedural.
										
										              
										Separate Domain from Presentation quando voc&ecirc; tem classes de&nbsp;GUI que cont&eacute;m l&oacute;gica do dom&iacute;nio.
									
									            
										              
										Extract Hierarchy quando voc&ecirc; tem uma classe que est&aacute; fazendo&nbsp;muito trabalho, principalmente atrav&eacute;s de muitos comandos&nbsp;condicionais
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q4">
<p class="enunciado">4. 
          A respeito de mudan&ccedil;a de software, assinale a op&ccedil;&atilde;o correta.
</p>
<ul class="opcoes">
<li correta="nao">a) A manuten&ccedil;&atilde;o de software &eacute; um processo geral de mudan&ccedil;as que ocorre antes ou depois que um sistema &eacute; entregue.</li>
<li correta="nao">b) A manuten&ccedil;&atilde;o corretiva para reparar defeitos de software diz respeito &agrave; mudan&ccedil;a em um sistema para corrigir erros, que podem ser somente de codifica&ccedil;&atilde;o. Erros de projeto e de l&oacute;gica n&atilde;o est&atilde;o inclu&iacute;dos nessa categoria.</li>
<li correta="nao">c) A manuten&ccedil;&atilde;o adaptativa para adaptar o software a mudan&ccedil;as ambientais se refere a mudan&ccedil;as de diversos tipos, como uma nova plataforma de hardware. Mudan&ccedil;as de sistemas operacionais ou software em geral n&atilde;o est&atilde;o inclu&iacute;das nessa categoria.</li>
<li correta="nao">d) A manuten&ccedil;&atilde;o perfectiva tem como objetivo tornar o software perfeito, melhorar seu desempenho e sua manutenibilidade ou adicionar-lhe funcionalidade para satisfazer a novos requisitos.</li>
<li correta="sim">e) A manuten&ccedil;&atilde;o preventiva tem como objetivo detectar e corrigir falhas latentes no produto antes que elas virem falhas efetivas.</li>
</ul>
<div class="coment4"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 7
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									spaww
									h&aacute; mais de 3 anos.
								
								          
									            
										a) Ocorre depois que o sistema &eacute; entregue.
										
										b) "...somente de codifica&ccedil;&atilde;o..." de projeto e de l&oacute;gica tamb&eacute;m (uma an&aacute;lise de requisitos errada tamb&eacute;m gera manuten&ccedil;&atilde;o corretiva).
										
										c) "... mudan&ccedil;a de SO / software..." est&atilde;o inclusas.
										
										d) "...software perfeito..." n&atilde;o faz parte.
										
										e) Correto
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q5">
<p class="enunciado">5. 
          Quanto &agrave; caracteriza&ccedil;&atilde;o, a reengenharia de
software&eacute; classificada como manuten&ccedil;&atilde;o</p>
<ul class="opcoes">
<li correta="sim">a) preventiva.</li>
<li correta="nao">b) criptogr&aacute;fica.</li>
<li correta="nao">c) de melhoria.</li>
<li correta="nao">d) adaptativa.</li>
<li correta="nao">e) corretiva.</li>
</ul>
<div class="coment5"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									mimi
									h&aacute; mais de 3 anos.
								
								          
									            
										Resposta "A"Tipos de manuten&ccedil;&atilde;o de software:
										Corretiva:
										corre&ccedil;&atilde;o de erros/falhas.
										Adaptativa
										: adapta&ccedil;&atilde;o do software para acomodar mudan&ccedil;as em seu ambiente externo, i.e. uma nova plataforma (hardware, sistema operacional) ou  mudan&ccedil;as nas regras de neg&oacute;cio, leis, pol&iacute;ticas governamentais etc.
										Evolutiva (ou perfectiva)
										: acr&eacute;scimo de funcionalidades, n&atilde;o previstas em seu documento de requisitos original.
										Preventiva (reengenharia):o software &eacute; modificado para oferecer uma base melhor para futuras manuten&ccedil;&otilde;es. Ou seja, para melhorar a sua confiabilidade ou manutenibilidade futura.
									            
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
								          
									            
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 3.00
									
									Votos: 10
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									apg-bh
									h&aacute; mais de 2 anos.
								
								          
									            
										do timaster..
										
										              
										              
										Resumo do Pressman sobre reengenharia:
										
										              
										Mudan&ccedil;a de Software pode ser (pg 685):
										
										* Manuten&ccedil;&atilde;o Corretiva;
										
										* Manuten&ccedil;&atilde;o Adaptativa;
										
										* Manuten&ccedil;&atilde;o Evolutiva;
										
										*
										Manuten&ccedil;&atilde;o Preventiva ou Reengenharia.
										              
										              
										Objetivos principais da Reengenharia (pg 681):
										
										* aperfei&ccedil;oar o produto (modelos, procedimentos, software)
										
										* adicionar novas funcionalidades
										
										* melhorar desempenho
										
										* aumentar a confiabilidade
										
										* melhorar a manutenabilidade
									
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q6">
<p class="enunciado">6. 
          Existem v&aacute;rias maneiras de se depurar (debug) programas. Algumas delas envolvem conhecimento, pr&aacute;tica e bom senso do programador. Acerca de pontos que s&atilde;o importantes para depurar programas, julgue os itens a seguir.
I &Eacute; poss&iacute;vel encontrar falhas nos programas por meio da reprodu&ccedil;&atilde;o do erro em testes.
II Quanto maior a entrada de dados nos testes, mais simples &eacute; encontrar o problema e mais f&aacute;cil &eacute; encontrar a solu&ccedil;&atilde;o da falha.
III Em um programa modular, o processo de encontrar falhas requer uma menor varia&ccedil;&atilde;o de informa&ccedil;&otilde;es de entrada, de modo que o programador possa encontrar o m&oacute;dulo com erros.
IV A passagem de par&acirc;metros para vari&aacute;veis auxiliares evita o uso de break points.
V A an&aacute;lise estruturada &eacute; a melhor maneira de encontrar erros em programa&ccedil;&atilde;o orientada a objetos.
Est&atilde;o certos apenas os itens
</p>
<ul class="opcoes">
<li correta="nao">a) I e II.</li>
<li correta="sim">b) I e III.</li>
<li correta="nao">c) II e V.</li>
<li correta="nao">d) III e IV.</li>
<li correta="nao">e) IV e V.</li>
</ul>
<div class="coment6"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 13
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									JULIANO SOARES CORREA
									h&aacute; mais de 3 anos.
								
								          
									            Programa&ccedil;&atilde;o modular &eacute; um paradigma de programa&ccedil;&atilde;o no qual o desenvolvimento das rotinas de programa&ccedil;&atilde;o &eacute; feito atrav&eacute;s de m&oacute;dulos, que s&atilde;o interligados entre si atrav&eacute;s de uma interface comum.A principal opera&ccedil;&atilde;o que um debugger permite &eacute; a suspens&atilde;o e continua&ccedil;&atilde;o da execu&ccedil;&atilde;o de um programa em uma determinada linha de c&oacute;digo, atrav&eacute;s do que chamamos de "breakpoint".Passagem de par&acirc;metros Os par&acirc;metros s&atilde;o dados que recebem as fun&ccedil;&otilde;es e as utilizam para realizar as opera&ccedil;&otilde;es de fun&ccedil;&atilde;o. Uma fun&ccedil;&atilde;o pode receber qualquer n&uacute;mero de par&acirc;metros, ou mesmo nenhum. Na hora de definir a fun&ccedil;&atilde;o, no cabe&ccedil;alho, definem-se os par&acirc;metros que vai receber. function f1 ($parametro1, $parametro2) Assim definimos uma fun&ccedil;&atilde;o f1 que recebe dois par&acirc;metros. Como se pode observar, n&atilde;o temos de definir o tipo de dados de cada par&acirc;metro. Os par&acirc;metros tem validede durante a execu&ccedil;&atilde;o da fun&ccedil;&atilde;o, isto &eacute;, tem um &acirc;mbito local &agrave; fun&ccedil;&atilde;o de onde se recebem.Quando a fun&ccedil;&atilde;o termina, os par&acirc;metros deixam de existir. Os par&acirc;metros por valor A passagem de par&acirc;metros em PHP realiza-se por valor. "Por valor" &eacute; uma maneira t&iacute;pica de passar par&acirc;metros em fun&ccedil;&otilde;es, quer dizer que a modifica&ccedil;&atilde;o de um par&acirc;metro n&atilde;o actualiza o dado da vari&aacute;vel como par&acirc;metro, apesar de mudarmos o valor do par&acirc;metro dentro da fun&ccedil;&atilde;o, a vari&aacute;vel original n&atilde;o se v&ecirc; afectada pela mudan&ccedil;a.http://www.criarweb.com/artigos/86.phpPassagem de par&acirc;metros por refer&ecirc;ncia Em contraposi&ccedil;&atilde;o &agrave; passagem de par&acirc;metros por valor, est&aacute; a passagem de par&acirc;metros por refer&ecirc;ncia. Neste &uacute;ltimo caso, a mudan&ccedil;a do valor de um par&acirc;metro dentro de uma fun&ccedil;&atilde;o afecta o valor da vari&aacute;vel original. Podemos passar os par&acirc;metros por refer&ecirc;ncia se, na declara&ccedil;&atilde;o da fun&ccedil;&atilde;o, colocarmos um "&amp;" antes do par&acirc;metro.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q7">
<p class="enunciado">7. 
          &Eacute; recomendado que um projeto possua um mecanismo formal e documentado de controle de mudan&ccedil;as. Sobre este mecanismo, s&atilde;o feitas as afirmativas a seguir.
I - O mecanismo deve rastrear e tratar mudan&ccedil;as em quaisquer fatores cr&iacute;ticos de sucesso do projeto, incluindo escopo, prazos e custos.
II - Para tornar o processo gerenci&aacute;vel, &eacute; recomendado que sejam rastreadas apenas mudan&ccedil;as que possuam impacto significativo no custo ou nos prazos do projeto e que n&atilde;o sejam rejeitadas em primeira an&aacute;lise.
III - A avalia&ccedil;&atilde;o e a aprova&ccedil;&atilde;o de quaisquer solicita&ccedil;&otilde;es de mudan&ccedil;as s&atilde;o atribui&ccedil;&otilde;es exclusivas do gerente de projeto, pois o mesmo det&eacute;m a autoridade e a responsabilidade sobre os resultados finais do projeto perante os stakeholders.
IV - Tipicamente, o mecanismo de controle de mudan&ccedil;as prev&ecirc; algumas categorias de mudan&ccedil;as que s&atilde;o automaticamente aprovadas - tais como as resultantes de emerg&ecirc;ncias - as quais devem ser registradas e rastreadas, da mesma forma que as demais.
Est&atilde;o corretas
APENASas afirmativas</p>
<ul class="opcoes">
<li correta="nao">a) I e II</li>
<li correta="nao">b) I e III</li>
<li correta="sim">c) I e IV</li>
<li correta="nao">d) II e III</li>
<li correta="nao">e) III e IV</li>
</ul>
<div class="coment7"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 1.00
									
									Votos: 8
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Alan  Argollo dos Santos Quadros
									h&aacute; mais de 3 anos.
								
								          
									            Ainda continuo com a d&uacute;vida... o escopo pode ser modificado durante a fase de controle de mudan&ccedil;as ? considero tal quest&atilde;o um pouco complicada para a resolu&ccedil;&atilde;o, pois ao meu ver o escopo &eacute; definido no inicio do projeto e n&atilde;o pode ser modificado... as modifica&ccedil;&otilde;es atuam sobre o planejamento, custos e prazos... em caso de mudan&ccedil;a de escopo &eacute; necess&aacute;rio um novo projeto.
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
<p>
         
						      
							        
								          
									            
								          
							        
							        
							
								          
									            
								          
								          
								          
							        
						      
						      
							
							
								          
									Nota m&eacute;dia: 2.00
									
									Votos: 9
								
								          
								          
								          
							        
							        
								
								
									Comentado por
									Vanuza Pereira
									h&aacute; mais de 2 anos.
								
								          
									            
									            Alan
									            Um dos processos da ger&ecirc;ncia de escopo &eacute; o controle de mudan&ccedil;as no escopo.
									            &nbsp;
								          
								          
								          
								          
								          
								
									            Este coment&aacute;rio &eacute; ofensivo ou inapropriado? Denuncie aqui.
									            
									            
								          
								          
								          
							        
							        
							        
						      
						      
					    
      <br>
<br>
</p>
</div>
</div>
<div class="questao" id="q8">
<p class="enunciado">8. 
          
S&atilde;o estrat&eacute;gias poss&iacute;veis de serem adotadas por uma organiza&ccedil;&atilde;o para evolu&ccedil;&atilde;o de seus sistemas legados as apresentadas a seguir,
EXCETO:</p>
<ul class="opcoes">
<li correta="nao">a) descartar o sistema completamente.</li>
<li correta="nao">b) substituir todo ou parte do sistema por um novo sistema.</li>
<li correta="nao">c) deixar o sistema sem altera&ccedil;&otilde;es e continuar com a manuten&ccedil;&atilde;o regular.</li>
<li correta="nao">d) fazer reengenharia do sistema para aprimorar sua facilidade de manuten&ccedil;&atilde;o.</li>
<li correta="sim">e) realizar engenharia reversa do c&oacute;digo do sistema com o objetivo de aumentar sua complexidade ciclom&aacute;tica e torn&aacute;-lo cr&iacute;tico &agrave; empresa.</li>
</ul>
<div class="coment8"> 
				COMENT&Aacute;RIOS: Parab&eacute;ns! Voc&ecirc; acertou a quest&atilde;o.<br>
<br>
</div>
</div>
</div>
</body>
</html>
